*** crates/slophammer-cli/src/app.rs:175:23: replace == with != in finish_check

*** mutation diff:
--- crates/slophammer-cli/src/app.rs
+++ replace == with != in finish_check
@@ -167,17 +167,17 @@
             return Ok(AppResult {
                 code: EXIT_OK,
                 stdout: summary,
                 stderr: String::new(),
             });
         }
     }
     let mut stdout = render_report(options.format, &report)?;
-    if options.format == OutputFormat::Text {
+    if options.format != /* ~ changed by cargo-mutants ~ */ OutputFormat::Text {
         stdout.push_str(&trailer);
     }
     Ok(AppResult {
         code: if report.ok { EXIT_OK } else { EXIT_FINDINGS },
         stdout,
         stderr: String::new(),
     })
 }

*** result: Success
