*** crates/slophammer-cli/src/rust_rules/mod.rs:195:5: replace rust_dependency_audit -> Vec<Finding> with vec![]

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ replace rust_dependency_audit -> Vec<Finding> with vec![]
@@ -187,22 +187,17 @@
     missing(
         is_rust_project(snapshot)
             && !evidence::command_text(snapshot).contains("slophammer-rs dry"),
         rule_ids::RUST_DRY_REQUIRED,
     )
 }
 
 fn rust_dependency_audit(snapshot: &Snapshot) -> Vec<Finding> {
-    let evidence = evidence::command_text(snapshot);
-    missing(
-        is_rust_project(snapshot)
-            && !(evidence.contains("cargo audit") || evidence.contains("cargo deny")),
-        rule_ids::RUST_DEPENDENCY_AUDIT_REQUIRED,
-    )
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 fn missing(condition: bool, rule_id: &str) -> Vec<Finding> {
     if condition {
         vec![Finding::new(definition(rule_id))]
     } else {
         Vec::new()
     }

*** result: Success
