*** crates/slophammer-cli/src/app.rs:217:5: replace expand_only_rule_ids -> Result<Vec<String>, AppError> with Ok(vec!["xyzzy".into()])

*** mutation diff:
--- crates/slophammer-cli/src/app.rs
+++ replace expand_only_rule_ids -> Result<Vec<String>, AppError> with Ok(vec!["xyzzy".into()])
@@ -209,35 +209,17 @@
     Ok(AppResult {
         code: if report.ok { EXIT_OK } else { EXIT_FINDINGS },
         stdout,
         stderr: String::new(),
     })
 }
 
 fn expand_only_rule_ids(raw: &[String]) -> Result<Vec<String>, AppError> {
-    let expanded: Vec<String> = raw
-        .iter()
-        .flat_map(|value| value.split(','))
-        .map(str::trim)
-        .filter(|rule_id| !rule_id.is_empty())
-        .map(str::to_owned)
-        .collect();
-    if !raw.is_empty() && expanded.is_empty() {
-        return Err(AppError::EmptyOnlyRule);
-    }
-    let unknown: Vec<&str> = expanded
-        .iter()
-        .filter(|rule_id| !crate::rust_rules::known_rule(rule_id))
-        .map(String::as_str)
-        .collect();
-    if !unknown.is_empty() {
-        return Err(AppError::UnknownRule(unknown.join(", ")));
-    }
-    Ok(expanded)
+    Ok(vec!["xyzzy".into()]) /* ~ changed by cargo-mutants ~ */
 }
 
 fn command_root(root: &str) -> &str {
     if root.is_empty() { "." } else { root }
 }
 
 fn render_report(format: OutputFormat, report: &Report) -> Result<String, AppError> {
     match format {

---- app::tests::unknown_only_rule_is_error stdout ----

thread 'app::tests::unknown_only_rule_is_error' (1781449) panicked at crates/slophammer-cli/src/app.rs:289:9:
assertion `left == right` failed
  left: 0
 right: 2

---- app::tests::check_applies_rule_severity_overrides stdout ----

thread 'app::tests::check_applies_rule_severity_overrides' (1781441) panicked at crates/slophammer-cli/src/app.rs:437:9:
assertion `left == right` failed
  left: 0
 right: 1

---- app::tests::rust_failure_fixtures_report_findings stdout ----

thread 'app::tests::rust_failure_fixtures_report_findings' (1781448) panicked at crates/slophammer-cli/src/app.rs:360:13:
assertion `left == right` failed: rust-bad-dependency
  left: 0
 right: 1

failures:
    app::tests::check_applies_rule_severity_overrides
    app::tests::empty_only_rules_are_an_error
    app::tests::rust_failure_fixtures_report_findings
    app::tests::unknown_only_rule_is_error

test result: FAILED. 59 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
