*** crates/slophammer-cli/src/rust_rules/mod.rs:198:51: replace || with && in rust_dependency_audit

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ replace || with && in rust_dependency_audit
@@ -190,17 +190,17 @@
         rule_ids::RUST_DRY_REQUIRED,
     )
 }
 
 fn rust_dependency_audit(snapshot: &Snapshot) -> Vec<Finding> {
     let evidence = evidence::command_text(snapshot);
     missing(
         is_rust_project(snapshot)
-            && !(evidence.contains("cargo audit") || evidence.contains("cargo deny")),
+            && !(evidence.contains("cargo audit") && /* ~ changed by cargo-mutants ~ */ evidence.contains("cargo deny")),
         rule_ids::RUST_DEPENDENCY_AUDIT_REQUIRED,
     )
 }
 
 fn missing(condition: bool, rule_id: &str) -> Vec<Finding> {
     if condition {
         vec![Finding::new(definition(rule_id))]
     } else {

---- app::tests::clean_fixture_has_no_findings stdout ----

thread 'app::tests::clean_fixture_has_no_findings' (1978579) panicked at crates/slophammer-cli/src/app.rs:351:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    app::tests::clean_fixture_has_no_findings

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
