*** crates/slophammer-cli/src/app.rs:221:27: delete ! in expand_only_rule_ids

*** mutation diff:
--- crates/slophammer-cli/src/app.rs
+++ delete ! in expand_only_rule_ids
@@ -213,17 +213,17 @@
     })
 }
 
 fn expand_only_rule_ids(raw: &[String]) -> Result<Vec<String>, AppError> {
     let expanded: Vec<String> = raw
         .iter()
         .flat_map(|value| value.split(','))
         .map(str::trim)
-        .filter(|rule_id| !rule_id.is_empty())
+        .filter(|rule_id|  /* ~ changed by cargo-mutants ~ */rule_id.is_empty())
         .map(str::to_owned)
         .collect();
     if !raw.is_empty() && expanded.is_empty() {
         return Err(AppError::EmptyOnlyRule);
     }
     let unknown: Vec<&str> = expanded
         .iter()
         .filter(|rule_id| !crate::rust_rules::known_rule(rule_id))

---- app::tests::check_applies_rule_severity_overrides stdout ----

thread 'app::tests::check_applies_rule_severity_overrides' (1782295) panicked at crates/slophammer-cli/src/app.rs:455:9:
assertion `left == right` failed
  left: 2
 right: 1

---- app::tests::empty_only_rules_are_an_error stdout ----

thread 'app::tests::empty_only_rules_are_an_error' (1782299) panicked at crates/slophammer-cli/src/app.rs:338:9:
assertion failed: result.stderr.contains("--only requires a rule id")

---- app::tests::unknown_only_rule_is_error stdout ----

thread 'app::tests::unknown_only_rule_is_error' (1782303) panicked at crates/slophammer-cli/src/app.rs:308:9:
assertion failed: result.stderr.contains("unknown rule: missing.rule, other.rule")

failures:
    app::tests::check_applies_rule_severity_overrides
    app::tests::empty_only_rules_are_an_error
    app::tests::only_rules_accept_comma_separated_ids
    app::tests::unknown_only_rule_is_error

test result: FAILED. 59 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
