*** crates/slophammer-cli/src/app.rs:224:24: replace && with || in expand_only_rule_ids

*** mutation diff:
--- crates/slophammer-cli/src/app.rs
+++ replace && with || in expand_only_rule_ids
@@ -216,17 +216,17 @@
 fn expand_only_rule_ids(raw: &[String]) -> Result<Vec<String>, AppError> {
     let expanded: Vec<String> = raw
         .iter()
         .flat_map(|value| value.split(','))
         .map(str::trim)
         .filter(|rule_id| !rule_id.is_empty())
         .map(str::to_owned)
         .collect();
-    if !raw.is_empty() && expanded.is_empty() {
+    if !raw.is_empty() || /* ~ changed by cargo-mutants ~ */ expanded.is_empty() {
         return Err(AppError::EmptyOnlyRule);
     }
     let unknown: Vec<&str> = expanded
         .iter()
         .filter(|rule_id| !crate::rust_rules::known_rule(rule_id))
         .map(String::as_str)
         .collect();
     if !unknown.is_empty() {

---- app::tests::check_applies_rule_severity_overrides stdout ----

thread 'app::tests::check_applies_rule_severity_overrides' (1783019) panicked at crates/slophammer-cli/src/app.rs:455:9:
assertion `left == right` failed
  left: 2
 right: 1

---- app::tests::config_error_fixtures_return_error_code stdout ----

thread 'app::tests::config_error_fixtures_return_error_code' (1783021) panicked at crates/slophammer-cli/src/app.rs:476:13:
rust-invalid-config

---- app::tests::clean_fixture_has_no_findings stdout ----

thread 'app::tests::clean_fixture_has_no_findings' (1783020) panicked at crates/slophammer-cli/src/app.rs:351:9:
assertion `left == right` failed
  left: 2
 right: 0

failures:
    app::tests::check_applies_rule_severity_overrides
    app::tests::clean_fixture_has_no_findings
    app::tests::config_error_fixtures_return_error_code
    app::tests::only_rules_accept_comma_separated_ids
    app::tests::rust_failure_fixtures_report_findings
    app::tests::unknown_only_rule_is_error

test result: FAILED. 57 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
