*** crates/slophammer-cli/src/app.rs:224:8: delete ! in expand_only_rule_ids

*** mutation diff:
--- crates/slophammer-cli/src/app.rs
+++ delete ! in expand_only_rule_ids
@@ -216,17 +216,17 @@
 fn expand_only_rule_ids(raw: &[String]) -> Result<Vec<String>, AppError> {
     let expanded: Vec<String> = raw
         .iter()
         .flat_map(|value| value.split(','))
         .map(str::trim)
         .filter(|rule_id| !rule_id.is_empty())
         .map(str::to_owned)
         .collect();
-    if !raw.is_empty() && expanded.is_empty() {
+    if  /* ~ changed by cargo-mutants ~ */raw.is_empty() && expanded.is_empty() {
         return Err(AppError::EmptyOnlyRule);
     }
     let unknown: Vec<&str> = expanded
         .iter()
         .filter(|rule_id| !crate::rust_rules::known_rule(rule_id))
         .map(String::as_str)
         .collect();
     if !unknown.is_empty() {

---- app::tests::rust_failure_fixtures_report_findings stdout ----

thread 'app::tests::rust_failure_fixtures_report_findings' (1783765) panicked at crates/slophammer-cli/src/app.rs:378:13:
assertion `left == right` failed: rust-bad-dependency
  left: 2
 right: 1

---- app::tests::clean_fixture_has_no_findings stdout ----

thread 'app::tests::clean_fixture_has_no_findings' (1783759) panicked at crates/slophammer-cli/src/app.rs:351:9:
assertion `left == right` failed
  left: 2
 right: 0

---- app::tests::config_error_fixtures_return_error_code stdout ----

thread 'app::tests::config_error_fixtures_return_error_code' (1783760) panicked at crates/slophammer-cli/src/app.rs:476:13:
rust-invalid-config

failures:
    app::tests::clean_fixture_has_no_findings
    app::tests::config_error_fixtures_return_error_code
    app::tests::empty_only_rules_are_an_error
    app::tests::rust_failure_fixtures_report_findings

test result: FAILED. 59 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
