*** crates/slophammer-cli/src/app.rs:229:27: delete ! in expand_only_rule_ids

*** mutation diff:
--- crates/slophammer-cli/src/app.rs
+++ delete ! in expand_only_rule_ids
@@ -221,17 +221,17 @@
         .filter(|rule_id| !rule_id.is_empty())
         .map(str::to_owned)
         .collect();
     if !raw.is_empty() && expanded.is_empty() {
         return Err(AppError::EmptyOnlyRule);
     }
     let unknown: Vec<&str> = expanded
         .iter()
-        .filter(|rule_id| !crate::rust_rules::known_rule(rule_id))
+        .filter(|rule_id|  /* ~ changed by cargo-mutants ~ */crate::rust_rules::known_rule(rule_id))
         .map(String::as_str)
         .collect();
     if !unknown.is_empty() {
         return Err(AppError::UnknownRule(unknown.join(", ")));
     }
     Ok(expanded)
 }

---- app::tests::only_rules_accept_comma_separated_ids stdout ----

thread 'app::tests::only_rules_accept_comma_separated_ids' (1784527) panicked at crates/slophammer-cli/src/app.rs:325:9:
assertion `left == right` failed: check failed: unknown rule: repo.readme-required, repo.agents-required

  left: 2
 right: 0

---- app::tests::check_applies_rule_severity_overrides stdout ----

thread 'app::tests::check_applies_rule_severity_overrides' (1784521) panicked at crates/slophammer-cli/src/app.rs:455:9:
assertion `left == right` failed
  left: 2
 right: 1

---- app::tests::unknown_only_rule_is_error stdout ----

thread 'app::tests::unknown_only_rule_is_error' (1784530) panicked at crates/slophammer-cli/src/app.rs:307:9:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    app::tests::check_applies_rule_severity_overrides
    app::tests::only_rules_accept_comma_separated_ids
    app::tests::unknown_only_rule_is_error

test result: FAILED. 60 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
