*** crates/slophammer-cli/src/app.rs:232:8: delete ! in expand_only_rule_ids

*** mutation diff:
--- crates/slophammer-cli/src/app.rs
+++ delete ! in expand_only_rule_ids
@@ -224,17 +224,17 @@
     if !raw.is_empty() && expanded.is_empty() {
         return Err(AppError::EmptyOnlyRule);
     }
     let unknown: Vec<&str> = expanded
         .iter()
         .filter(|rule_id| !crate::rust_rules::known_rule(rule_id))
         .map(String::as_str)
         .collect();
-    if !unknown.is_empty() {
+    if  /* ~ changed by cargo-mutants ~ */unknown.is_empty() {
         return Err(AppError::UnknownRule(unknown.join(", ")));
     }
     Ok(expanded)
 }
 
 fn command_root(root: &str) -> &str {
     if root.is_empty() { "." } else { root }
 }

---- app::tests::check_applies_rule_severity_overrides stdout ----

thread 'app::tests::check_applies_rule_severity_overrides' (1785256) panicked at crates/slophammer-cli/src/app.rs:455:9:
assertion `left == right` failed
  left: 2
 right: 1

---- app::tests::config_error_fixtures_return_error_code stdout ----

thread 'app::tests::config_error_fixtures_return_error_code' (1785258) panicked at crates/slophammer-cli/src/app.rs:476:13:
rust-invalid-config

---- app::tests::rust_failure_fixtures_report_findings stdout ----

thread 'app::tests::rust_failure_fixtures_report_findings' (1785263) panicked at crates/slophammer-cli/src/app.rs:378:13:
assertion `left == right` failed: rust-bad-dependency
  left: 2
 right: 1

failures:
    app::tests::check_applies_rule_severity_overrides
    app::tests::clean_fixture_has_no_findings
    app::tests::config_error_fixtures_return_error_code
    app::tests::only_rules_accept_comma_separated_ids
    app::tests::rust_failure_fixtures_report_findings
    app::tests::unknown_only_rule_is_error

test result: FAILED. 57 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
