*** crates/slophammer-cli/src/app.rs:239:5: replace command_root -> &str with "xyzzy"

*** mutation diff:
--- crates/slophammer-cli/src/app.rs
+++ replace command_root -> &str with "xyzzy"
@@ -231,17 +231,17 @@
         .collect();
     if !unknown.is_empty() {
         return Err(AppError::UnknownRule(unknown.join(", ")));
     }
     Ok(expanded)
 }
 
 fn command_root(root: &str) -> &str {
-    if root.is_empty() { "." } else { root }
+    "xyzzy" /* ~ changed by cargo-mutants ~ */
 }
 
 fn render_report(format: OutputFormat, report: &Report) -> Result<String, AppError> {
     match format {
         OutputFormat::Text => Ok(write_text(report)),
         OutputFormat::Json => Ok(write_json(report)?),
         OutputFormat::Sarif => Ok(write_sarif(report)?),
     }

---- app::tests::config_error_fixtures_return_error_code stdout ----

thread 'app::tests::config_error_fixtures_return_error_code' (1787044) panicked at crates/slophammer-cli/src/app.rs:476:13:
rust-invalid-config

---- app::tests::check_applies_rule_severity_overrides stdout ----

thread 'app::tests::check_applies_rule_severity_overrides' (1787042) panicked at crates/slophammer-cli/src/app.rs:455:9:
assertion `left == right` failed
  left: 2
 right: 1

---- app::tests::clean_fixture_has_no_findings stdout ----

thread 'app::tests::clean_fixture_has_no_findings' (1787043) panicked at crates/slophammer-cli/src/app.rs:351:9:
assertion `left == right` failed
  left: 2
 right: 0

failures:
    app::tests::check_applies_rule_severity_overrides
    app::tests::clean_fixture_has_no_findings
    app::tests::config_error_fixtures_return_error_code
    app::tests::direct_commands_use_report_contract
    app::tests::only_rules_accept_comma_separated_ids
    app::tests::rust_failure_fixtures_report_findings

test result: FAILED. 57 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
