*** crates/slophammer-cli/src/app.rs:243:5: replace render_report -> Result<String, AppError> with Ok("xyzzy".into())

*** mutation diff:
--- crates/slophammer-cli/src/app.rs
+++ replace render_report -> Result<String, AppError> with Ok("xyzzy".into())
@@ -235,21 +235,17 @@
     Ok(expanded)
 }
 
 fn command_root(root: &str) -> &str {
     if root.is_empty() { "." } else { root }
 }
 
 fn render_report(format: OutputFormat, report: &Report) -> Result<String, AppError> {
-    match format {
-        OutputFormat::Text => Ok(write_text(report)),
-        OutputFormat::Json => Ok(write_json(report)?),
-        OutputFormat::Sarif => Ok(write_sarif(report)?),
-    }
+    Ok("xyzzy".into()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn render_rules(
     format: OutputFormat,
     definitions: &[RuleDefinition],
 ) -> Result<String, serde_json::Error> {
     match format {
         OutputFormat::Text | OutputFormat::Sarif => Ok(rules_text(definitions)),

---- app::tests::direct_commands_use_report_contract stdout ----

thread 'app::tests::direct_commands_use_report_contract' (1788608) panicked at crates/slophammer-cli/src/app.rs:388:9:
assertion failed: dry.stdout.contains("OK: no findings")

---- app::tests::rust_failure_fixtures_report_findings stdout ----

thread 'app::tests::rust_failure_fixtures_report_findings' (1788612) panicked at crates/slophammer-cli/src/app.rs:375:13:
rust-bad-dependency

---- app::tests::check_applies_rule_severity_overrides stdout ----

thread 'app::tests::check_applies_rule_severity_overrides' (1788605) panicked at crates/slophammer-cli/src/app.rs:452:9:
assertion failed: result.stdout.contains("\"rule_id\": \"repo.readme-required\"")

failures:
    app::tests::check_applies_rule_severity_overrides
    app::tests::clean_fixture_has_no_findings
    app::tests::direct_commands_use_report_contract
    app::tests::rust_failure_fixtures_report_findings

test result: FAILED. 59 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
