*** crates/slophammer-cli/src/app.rs:254:5: replace render_rules -> Result<String, serde_json::Error> with Ok(String::new())

*** mutation diff:
--- crates/slophammer-cli/src/app.rs
+++ replace render_rules -> Result<String, serde_json::Error> with Ok(String::new())
@@ -246,20 +246,17 @@
         OutputFormat::Sarif => Ok(write_sarif(report)?),
     }
 }
 
 fn render_rules(
     format: OutputFormat,
     definitions: &[RuleDefinition],
 ) -> Result<String, serde_json::Error> {
-    match format {
-        OutputFormat::Text | OutputFormat::Sarif => Ok(rules_text(definitions)),
-        OutputFormat::Json => Ok(format!("{}\n", serde_json::to_string_pretty(definitions)?)),
-    }
+    Ok(String::new()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn rules_text(definitions: &[RuleDefinition]) -> String {
     let mut output = String::from("RULE ID\tCATEGORY\tSEVERITY\tSTATUS\tTOOL\n");
     for definition in definitions {
         output.push_str(&format!(
             "{}\t{}\t{}\t{}\t{}\n",
             definition.id,

---- app::tests::rules_and_explain_are_available stdout ----

thread 'app::tests::rules_and_explain_are_available' (1789398) panicked at crates/slophammer-cli/src/app.rs:418:9:
assertion failed: catalog.stdout.contains("rust.check-required")

failures:
    app::tests::rules_and_explain_are_available

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
