*** crates/slophammer-cli/src/app.rs:261:5: replace rules_text -> String with String::new()

*** mutation diff:
--- crates/slophammer-cli/src/app.rs
+++ replace rules_text -> String with String::new()
@@ -253,28 +253,17 @@
 ) -> Result<String, serde_json::Error> {
     match format {
         OutputFormat::Text | OutputFormat::Sarif => Ok(rules_text(definitions)),
         OutputFormat::Json => Ok(format!("{}\n", serde_json::to_string_pretty(definitions)?)),
     }
 }
 
 fn rules_text(definitions: &[RuleDefinition]) -> String {
-    let mut output = String::from("RULE ID\tCATEGORY\tSEVERITY\tSTATUS\tTOOL\n");
-    for definition in definitions {
-        output.push_str(&format!(
-            "{}\t{}\t{}\t{}\t{}\n",
-            definition.id,
-            definition.category,
-            definition.severity,
-            definition.status,
-            definition.tool.unwrap_or("")
-        ));
-    }
-    output
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 impl fmt::Display for OutputFormat {
     fn fmt(&self, formatter: &mut fmt::Formatter<'_>) -> fmt::Result {
         match self {
             Self::Text => formatter.write_str("text"),
             Self::Json => formatter.write_str("json"),
             Self::Sarif => formatter.write_str("sarif"),

*** result: Success
