*** crates/slophammer-cli/src/app.rs:277:9: replace <impl fmt::Display for OutputFormat>::fmt -> fmt::Result with Ok(Default::default())

*** mutation diff:
--- crates/slophammer-cli/src/app.rs
+++ replace <impl fmt::Display for OutputFormat>::fmt -> fmt::Result with Ok(Default::default())
@@ -269,21 +269,17 @@
             definition.tool.unwrap_or("")
         ));
     }
     output
 }
 
 impl fmt::Display for OutputFormat {
     fn fmt(&self, formatter: &mut fmt::Formatter<'_>) -> fmt::Result {
-        match self {
-            Self::Text => formatter.write_str("text"),
-            Self::Json => formatter.write_str("json"),
-            Self::Sarif => formatter.write_str("sarif"),
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use crate::core::{EXIT_FINDINGS, EXIT_OK};

*** result: Success
