*** crates/slophammer-cli/src/baseline.rs:100:5: replace debt_line -> String with String::new()

*** mutation diff:
--- crates/slophammer-cli/src/baseline.rs
+++ replace debt_line -> String with String::new()
@@ -92,23 +92,17 @@
     let serialized = serde_json::to_string_pretty(&file)
         .map_err(|error| BaselineError::Write(error.to_string()))?;
     std::fs::write(root.join(BASELINE_FILE), format!("{serialized}\n"))
         .map_err(|error| BaselineError::Write(error.to_string()))?;
     Ok(write_summary(current.len(), &added, &removed))
 }
 
 pub fn debt_line(report: &Report) -> String {
-    let baselined = report
-        .findings
-        .iter()
-        .filter(|finding| finding.baselined == Some(true))
-        .count();
-    let new = report.findings.len() - baselined;
-    format!("{baselined} findings baselined; {new} new\n")
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 fn read_baseline(root: &Path) -> Result<BTreeSet<BaselineEntry>, BaselineError> {
     let content = match std::fs::read_to_string(root.join(BASELINE_FILE)) {
         Ok(content) => content,
         Err(error) if error.kind() == std::io::ErrorKind::NotFound => {
             return Err(BaselineError::Missing);
         }

---- baseline::tests::new_findings_keep_failing stdout ----

thread 'baseline::tests::new_findings_keep_failing' (1800750) panicked at crates/slophammer-cli/src/baseline.rs:208:9:
assertion `left == right` failed
  left: ""
 right: "1 findings baselined; 1 new\n"

failures:
    baseline::tests::new_findings_keep_failing

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
