*** crates/slophammer-cli/src/baseline.rs:103:45: replace == with != in debt_line

*** mutation diff:
--- crates/slophammer-cli/src/baseline.rs
+++ replace == with != in debt_line
@@ -95,17 +95,17 @@
         .map_err(|error| BaselineError::Write(error.to_string()))?;
     Ok(write_summary(current.len(), &added, &removed))
 }
 
 pub fn debt_line(report: &Report) -> String {
     let baselined = report
         .findings
         .iter()
-        .filter(|finding| finding.baselined == Some(true))
+        .filter(|finding| finding.baselined != /* ~ changed by cargo-mutants ~ */ Some(true))
         .count();
     let new = report.findings.len() - baselined;
     format!("{baselined} findings baselined; {new} new\n")
 }
 
 fn read_baseline(root: &Path) -> Result<BTreeSet<BaselineEntry>, BaselineError> {
     let content = match std::fs::read_to_string(root.join(BASELINE_FILE)) {
         Ok(content) => content,

*** result: Success
