*** crates/slophammer-cli/src/baseline.rs:105:37: replace - with / in debt_line

*** mutation diff:
--- crates/slophammer-cli/src/baseline.rs
+++ replace - with / in debt_line
@@ -97,17 +97,17 @@
 }
 
 pub fn debt_line(report: &Report) -> String {
     let baselined = report
         .findings
         .iter()
         .filter(|finding| finding.baselined == Some(true))
         .count();
-    let new = report.findings.len() - baselined;
+    let new = report.findings.len() / /* ~ changed by cargo-mutants ~ */ baselined;
     format!("{baselined} findings baselined; {new} new\n")
 }
 
 fn read_baseline(root: &Path) -> Result<BTreeSet<BaselineEntry>, BaselineError> {
     let content = match std::fs::read_to_string(root.join(BASELINE_FILE)) {
         Ok(content) => content,
         Err(error) if error.kind() == std::io::ErrorKind::NotFound => {
             return Err(BaselineError::Missing);

---- baseline::tests::new_findings_keep_failing stdout ----

thread 'baseline::tests::new_findings_keep_failing' (1803809) panicked at crates/slophammer-cli/src/baseline.rs:214:9:
assertion `left == right` failed
  left: "1 findings baselined; 2 new\n"
 right: "1 findings baselined; 1 new\n"

failures:
    baseline::tests::new_findings_keep_failing

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
