*** crates/slophammer-cli/src/baseline.rs:110:5: replace read_baseline -> Result<BTreeSet<BaselineEntry>, BaselineError> with Ok(BTreeSet::new())

*** mutation diff:
--- crates/slophammer-cli/src/baseline.rs
+++ replace read_baseline -> Result<BTreeSet<BaselineEntry>, BaselineError> with Ok(BTreeSet::new())
@@ -102,29 +102,17 @@
         .iter()
         .filter(|finding| finding.baselined == Some(true))
         .count();
     let new = report.findings.len() - baselined;
     format!("{baselined} findings baselined; {new} new\n")
 }
 
 fn read_baseline(root: &Path) -> Result<BTreeSet<BaselineEntry>, BaselineError> {
-    let content = match std::fs::read_to_string(root.join(BASELINE_FILE)) {
-        Ok(content) => content,
-        Err(error) if error.kind() == std::io::ErrorKind::NotFound => {
-            return Err(BaselineError::Missing);
-        }
-        Err(error) => return Err(BaselineError::Read(error.to_string())),
-    };
-    let file: BaselineFile =
-        serde_json::from_str(&content).map_err(|error| BaselineError::Parse(error.to_string()))?;
-    if file.version != 1 {
-        return Err(BaselineError::Version);
-    }
-    Ok(file.findings.into_iter().collect())
+    Ok(BTreeSet::new()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn entry_of(finding: &Finding) -> BaselineEntry {
     BaselineEntry {
         rule_id: finding.rule_id.clone(),
         path: finding.path.clone(),
     }
 }

---- baseline::tests::baselined_findings_stop_affecting_ok stdout ----

thread 'baseline::tests::baselined_findings_stop_affecting_ok' (1804566) panicked at crates/slophammer-cli/src/baseline.rs:186:9:
assertion failed: report.ok

---- baseline::tests::write_records_and_shrinks stdout ----

thread 'baseline::tests::write_records_and_shrinks' (1804569) panicked at crates/slophammer-cli/src/baseline.rs:253:9:
assertion failed: summary.contains("removed: repo.readme-required at README.md")

---- baseline::tests::write_refuses_malformed_existing_baseline stdout ----

thread 'baseline::tests::write_refuses_malformed_existing_baseline' (1804572) panicked at crates/slophammer-cli/src/baseline.rs:236:48:
malformed baseline: "baseline written: 1 finding(s)\nadded: repo.readme-required at README.md\n"

failures:
    baseline::tests::baselined_findings_stop_affecting_ok
    baseline::tests::new_findings_keep_failing
    baseline::tests::stale_entries_are_an_error
    baseline::tests::write_records_and_shrinks
    baseline::tests::write_refuses_malformed_existing_baseline
    baseline::tests::write_refuses_supersets

test result: FAILED. 57 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
