*** crates/slophammer-cli/src/baseline.rs:112:23: replace match guard error.kind() == std::io::ErrorKind::NotFound with true in read_baseline

*** mutation diff:
--- crates/slophammer-cli/src/baseline.rs
+++ replace match guard error.kind() == std::io::ErrorKind::NotFound with true in read_baseline
@@ -104,17 +104,17 @@
         .count();
     let new = report.findings.len() - baselined;
     format!("{baselined} findings baselined; {new} new\n")
 }
 
 fn read_baseline(root: &Path) -> Result<BTreeSet<BaselineEntry>, BaselineError> {
     let content = match std::fs::read_to_string(root.join(BASELINE_FILE)) {
         Ok(content) => content,
-        Err(error) if error.kind() == std::io::ErrorKind::NotFound => {
+        Err(error) if true /* ~ changed by cargo-mutants ~ */ => {
             return Err(BaselineError::Missing);
         }
         Err(error) => return Err(BaselineError::Read(error.to_string())),
     };
     let file: BaselineFile =
         serde_json::from_str(&content).map_err(|error| BaselineError::Parse(error.to_string()))?;
     if file.version != 1 {
         return Err(BaselineError::Version);

*** result: Success
