*** crates/slophammer-cli/src/baseline.rs:112:23: replace match guard error.kind() == std::io::ErrorKind::NotFound with false in read_baseline

*** mutation diff:
--- crates/slophammer-cli/src/baseline.rs
+++ replace match guard error.kind() == std::io::ErrorKind::NotFound with false in read_baseline
@@ -104,17 +104,17 @@
         .count();
     let new = report.findings.len() - baselined;
     format!("{baselined} findings baselined; {new} new\n")
 }
 
 fn read_baseline(root: &Path) -> Result<BTreeSet<BaselineEntry>, BaselineError> {
     let content = match std::fs::read_to_string(root.join(BASELINE_FILE)) {
         Ok(content) => content,
-        Err(error) if error.kind() == std::io::ErrorKind::NotFound => {
+        Err(error) if false /* ~ changed by cargo-mutants ~ */ => {
             return Err(BaselineError::Missing);
         }
         Err(error) => return Err(BaselineError::Read(error.to_string())),
     };
     let file: BaselineFile =
         serde_json::from_str(&content).map_err(|error| BaselineError::Parse(error.to_string()))?;
     if file.version != 1 {
         return Err(BaselineError::Version);

---- baseline::tests::write_records_and_shrinks stdout ----

thread 'baseline::tests::write_records_and_shrinks' (1806302) panicked at crates/slophammer-cli/src/baseline.rs:260:49:
initial write: Read("No such file or directory (os error 2)")

failures:
    baseline::tests::write_records_and_shrinks

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
