*** crates/slophammer-cli/src/baseline.rs:119:21: replace != with == in read_baseline

*** mutation diff:
--- crates/slophammer-cli/src/baseline.rs
+++ replace != with == in read_baseline
@@ -111,17 +111,17 @@
         Ok(content) => content,
         Err(error) if error.kind() == std::io::ErrorKind::NotFound => {
             return Err(BaselineError::Missing);
         }
         Err(error) => return Err(BaselineError::Read(error.to_string())),
     };
     let file: BaselineFile =
         serde_json::from_str(&content).map_err(|error| BaselineError::Parse(error.to_string()))?;
-    if file.version != 1 {
+    if file.version == /* ~ changed by cargo-mutants ~ */ 1 {
         return Err(BaselineError::Version);
     }
     Ok(file.findings.into_iter().collect())
 }
 
 fn entry_of(finding: &Finding) -> BaselineEntry {
     BaselineEntry {
         rule_id: finding.rule_id.clone(),

---- baseline::tests::baselined_findings_stop_affecting_ok stdout ----

thread 'baseline::tests::baselined_findings_stop_affecting_ok' (1807894) panicked at crates/slophammer-cli/src/baseline.rs:196:46:
apply baseline: Version

---- baseline::tests::write_records_and_shrinks stdout ----

thread 'baseline::tests::write_records_and_shrinks' (1807897) panicked at crates/slophammer-cli/src/baseline.rs:264:50:
shrinking write: Version

---- baseline::tests::write_refuses_supersets stdout ----

thread 'baseline::tests::write_refuses_supersets' (1807899) panicked at crates/slophammer-cli/src/baseline.rs:239:9:
assertion failed: error.to_string().contains("grow the baseline")

failures:
    baseline::tests::baselined_findings_stop_affecting_ok
    baseline::tests::new_findings_keep_failing
    baseline::tests::stale_entries_are_an_error
    baseline::tests::write_records_and_shrinks
    baseline::tests::write_refuses_supersets

test result: FAILED. 58 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
