*** crates/slophammer-cli/src/baseline.rs:133:5: replace joined -> String with String::new()

*** mutation diff:
--- crates/slophammer-cli/src/baseline.rs
+++ replace joined -> String with String::new()
@@ -125,21 +125,17 @@
 fn entry_of(finding: &Finding) -> BaselineEntry {
     BaselineEntry {
         rule_id: finding.rule_id.clone(),
         path: finding.path.clone(),
     }
 }
 
 fn joined(entries: &BTreeSet<BaselineEntry>) -> String {
-    entries
-        .iter()
-        .map(|entry| format!("{} at {}", entry.rule_id, entry.path))
-        .collect::<Vec<_>>()
-        .join(", ")
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 fn write_summary(
     total: usize,
     added: &BTreeSet<BaselineEntry>,
     removed: &BTreeSet<BaselineEntry>,
 ) -> String {
     let mut summary = format!("baseline written: {total} finding(s)\n");

*** result: Success
