*** crates/slophammer-cli/src/baseline.rs:145:5: replace write_summary -> String with "xyzzy".into()

*** mutation diff:
--- crates/slophammer-cli/src/baseline.rs
+++ replace write_summary -> String with "xyzzy".into()
@@ -137,24 +137,17 @@
         .join(", ")
 }
 
 fn write_summary(
     total: usize,
     added: &BTreeSet<BaselineEntry>,
     removed: &BTreeSet<BaselineEntry>,
 ) -> String {
-    let mut summary = format!("baseline written: {total} finding(s)\n");
-    for entry in added {
-        summary.push_str(&format!("added: {} at {}\n", entry.rule_id, entry.path));
-    }
-    for entry in removed {
-        summary.push_str(&format!("removed: {} at {}\n", entry.rule_id, entry.path));
-    }
-    summary
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use crate::core::Severity;
     use crate::report::new_report;

---- baseline::tests::write_records_and_shrinks stdout ----

thread 'baseline::tests::write_records_and_shrinks' (1812390) panicked at crates/slophammer-cli/src/baseline.rs:254:9:
assertion failed: summary.contains("baseline written: 2")

failures:
    baseline::tests::write_records_and_shrinks

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
