*** crates/slophammer-cli/src/baseline.rs:53:5: replace apply_check -> Result<(), BaselineError> with Ok(())

*** mutation diff:
--- crates/slophammer-cli/src/baseline.rs
+++ replace apply_check -> Result<(), BaselineError> with Ok(())
@@ -45,32 +45,17 @@
     rule_id: String,
     path: String,
 }
 
 /// Applies a checked-in baseline to a report: matched findings are marked
 /// baselined and stop affecting `ok`; stale entries are an error so the
 /// ratchet can only shrink. Matching is on rule_id plus path, never message.
 pub fn apply_check(root: &Path, report: &mut Report) -> Result<(), BaselineError> {
-    let baseline = read_baseline(root)?;
-    let mut unmatched = baseline.clone();
-    for finding in &mut report.findings {
-        if baseline.contains(&entry_of(finding)) {
-            finding.baselined = Some(true);
-            unmatched.remove(&entry_of(finding));
-        }
-    }
-    if !unmatched.is_empty() {
-        return Err(BaselineError::Stale(joined(&unmatched)));
-    }
-    report.ok = report
-        .findings
-        .iter()
-        .all(|finding| finding.baselined == Some(true));
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Records current findings as the baseline. Refuses to write a superset of
 /// an existing baseline and prints the added and removed entries, so debt is
 /// recorded once, reviewed, and only ever reduced.
 pub fn write(root: &Path, report: &Report) -> Result<String, BaselineError> {
     let current: BTreeSet<BaselineEntry> = report.findings.iter().map(entry_of).collect();
     // Only a missing baseline counts as the initial-write case; a present but

---- baseline::tests::baselined_findings_stop_affecting_ok stdout ----

thread 'baseline::tests::baselined_findings_stop_affecting_ok' (1793661) panicked at crates/slophammer-cli/src/baseline.rs:183:9:
assertion failed: report.ok

---- baseline::tests::new_findings_keep_failing stdout ----

thread 'baseline::tests::new_findings_keep_failing' (1793662) panicked at crates/slophammer-cli/src/baseline.rs:199:9:
assertion `left == right` failed
  left: "0 findings baselined; 2 new\n"
 right: "1 findings baselined; 1 new\n"

---- baseline::tests::stale_entries_are_an_error stdout ----

thread 'baseline::tests::stale_entries_are_an_error' (1793663) panicked at crates/slophammer-cli/src/baseline.rs:208:58:
stale baseline: ()

failures:
    baseline::tests::baselined_findings_stop_affecting_ok
    baseline::tests::new_findings_keep_failing
    baseline::tests::stale_entries_are_an_error

test result: FAILED. 60 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
