*** crates/slophammer-cli/src/baseline.rs:61:8: delete ! in apply_check

*** mutation diff:
--- crates/slophammer-cli/src/baseline.rs
+++ delete ! in apply_check
@@ -53,17 +53,17 @@
     let baseline = read_baseline(root)?;
     let mut unmatched = baseline.clone();
     for finding in &mut report.findings {
         if baseline.contains(&entry_of(finding)) {
             finding.baselined = Some(true);
             unmatched.remove(&entry_of(finding));
         }
     }
-    if !unmatched.is_empty() {
+    if  /* ~ changed by cargo-mutants ~ */unmatched.is_empty() {
         return Err(BaselineError::Stale(joined(&unmatched)));
     }
     report.ok = report
         .findings
         .iter()
         .all(|finding| finding.baselined == Some(true));
     Ok(())
 }

---- baseline::tests::baselined_findings_stop_affecting_ok stdout ----

thread 'baseline::tests::baselined_findings_stop_affecting_ok' (1794496) panicked at crates/slophammer-cli/src/baseline.rs:196:46:
apply baseline: Stale("")

---- baseline::tests::new_findings_keep_failing stdout ----

thread 'baseline::tests::new_findings_keep_failing' (1794497) panicked at crates/slophammer-cli/src/baseline.rs:211:46:
apply baseline: Stale("")

---- baseline::tests::stale_entries_are_an_error stdout ----

thread 'baseline::tests::stale_entries_are_an_error' (1794498) panicked at crates/slophammer-cli/src/baseline.rs:223:58:
stale baseline: ()

failures:
    baseline::tests::baselined_findings_stop_affecting_ok
    baseline::tests::new_findings_keep_failing
    baseline::tests::stale_entries_are_an_error

test result: FAILED. 60 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
