*** crates/slophammer-cli/src/baseline.rs:67:42: replace == with != in apply_check

*** mutation diff:
--- crates/slophammer-cli/src/baseline.rs
+++ replace == with != in apply_check
@@ -59,17 +59,17 @@
         }
     }
     if !unmatched.is_empty() {
         return Err(BaselineError::Stale(joined(&unmatched)));
     }
     report.ok = report
         .findings
         .iter()
-        .all(|finding| finding.baselined == Some(true));
+        .all(|finding| finding.baselined != /* ~ changed by cargo-mutants ~ */ Some(true));
     Ok(())
 }
 
 /// Records current findings as the baseline. Refuses to write a superset of
 /// an existing baseline and prints the added and removed entries, so debt is
 /// recorded once, reviewed, and only ever reduced.
 pub fn write(root: &Path, report: &Report) -> Result<String, BaselineError> {
     let current: BTreeSet<BaselineEntry> = report.findings.iter().map(entry_of).collect();

---- baseline::tests::baselined_findings_stop_affecting_ok stdout ----

thread 'baseline::tests::baselined_findings_stop_affecting_ok' (1795248) panicked at crates/slophammer-cli/src/baseline.rs:198:9:
assertion failed: report.ok

failures:
    baseline::tests::baselined_findings_stop_affecting_ok

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
