*** crates/slophammer-cli/src/baseline.rs:75:5: replace write -> Result<String, BaselineError> with Ok("xyzzy".into())

*** mutation diff:
--- crates/slophammer-cli/src/baseline.rs
+++ replace write -> Result<String, BaselineError> with Ok("xyzzy".into())
@@ -67,38 +67,17 @@
         .all(|finding| finding.baselined == Some(true));
     Ok(())
 }
 
 /// Records current findings as the baseline. Refuses to write a superset of
 /// an existing baseline and prints the added and removed entries, so debt is
 /// recorded once, reviewed, and only ever reduced.
 pub fn write(root: &Path, report: &Report) -> Result<String, BaselineError> {
-    let current: BTreeSet<BaselineEntry> = report.findings.iter().map(entry_of).collect();
-    // Only a missing baseline counts as the initial-write case; a present but
-    // malformed baseline propagates its error instead of being replaced.
-    let previous = match read_baseline(root) {
-        Ok(previous) => previous,
-        Err(BaselineError::Missing) => BTreeSet::new(),
-        Err(error) => return Err(error),
-    };
-    let added: BTreeSet<_> = current.difference(&previous).cloned().collect();
-    let removed: BTreeSet<_> = previous.difference(&current).cloned().collect();
-    if !previous.is_empty() && !added.is_empty() && removed.is_empty() {
-        return Err(BaselineError::Superset(joined(&added)));
-    }
-    let file = BaselineFile {
-        version: 1,
-        findings: current.iter().cloned().collect(),
-    };
-    let serialized = serde_json::to_string_pretty(&file)
-        .map_err(|error| BaselineError::Write(error.to_string()))?;
-    std::fs::write(root.join(BASELINE_FILE), format!("{serialized}\n"))
-        .map_err(|error| BaselineError::Write(error.to_string()))?;
-    Ok(write_summary(current.len(), &added, &removed))
+    Ok("xyzzy".into()) /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn debt_line(report: &Report) -> String {
     let baselined = report
         .findings
         .iter()
         .filter(|finding| finding.baselined == Some(true))
         .count();

---- baseline::tests::write_refuses_malformed_existing_baseline stdout ----

thread 'baseline::tests::write_refuses_malformed_existing_baseline' (1796839) panicked at crates/slophammer-cli/src/baseline.rs:227:48:
malformed baseline: "xyzzy"

---- baseline::tests::write_records_and_shrinks stdout ----

thread 'baseline::tests::write_records_and_shrinks' (1796833) panicked at crates/slophammer-cli/src/baseline.rs:240:9:
assertion failed: summary.contains("baseline written: 2")

---- baseline::tests::write_refuses_supersets stdout ----

thread 'baseline::tests::write_refuses_supersets' (1796840) panicked at crates/slophammer-cli/src/baseline.rs:216:48:
superset write: "xyzzy"

failures:
    baseline::tests::write_records_and_shrinks
    baseline::tests::write_refuses_malformed_existing_baseline
    baseline::tests::write_refuses_supersets

test result: FAILED. 60 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
