*** crates/slophammer-cli/src/baseline.rs:85:32: delete ! in write

*** mutation diff:
--- crates/slophammer-cli/src/baseline.rs
+++ delete ! in write
@@ -77,17 +77,17 @@
     // malformed baseline propagates its error instead of being replaced.
     let previous = match read_baseline(root) {
         Ok(previous) => previous,
         Err(BaselineError::Missing) => BTreeSet::new(),
         Err(error) => return Err(error),
     };
     let added: BTreeSet<_> = current.difference(&previous).cloned().collect();
     let removed: BTreeSet<_> = previous.difference(&current).cloned().collect();
-    if !previous.is_empty() && !added.is_empty() && removed.is_empty() {
+    if !previous.is_empty() &&  /* ~ changed by cargo-mutants ~ */added.is_empty() && removed.is_empty() {
         return Err(BaselineError::Superset(joined(&added)));
     }
     let file = BaselineFile {
         version: 1,
         findings: current.iter().cloned().collect(),
     };
     let serialized = serde_json::to_string_pretty(&file)
         .map_err(|error| BaselineError::Write(error.to_string()))?;

---- baseline::tests::write_refuses_supersets stdout ----

thread 'baseline::tests::write_refuses_supersets' (1800006) panicked at crates/slophammer-cli/src/baseline.rs:237:48:
superset write: "baseline written: 2 finding(s)\nadded: repo.agents-required at AGENTS.md\n"

failures:
    baseline::tests::write_refuses_supersets

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
