*** crates/slophammer-cli/src/config.rs:205:5: replace load -> Result<Config, ConfigError> with Ok(Default::default())

*** mutation diff:
--- crates/slophammer-cli/src/config.rs
+++ replace load -> Result<Config, ConfigError> with Ok(Default::default())
@@ -197,24 +197,17 @@
     typescript: Option<Value>,
     #[serde(default)]
     python: Option<Value>,
     #[serde(default)]
     rust: Option<RustConfig>,
 }
 
 pub fn load(snapshot: &Snapshot) -> Result<Config, ConfigError> {
-    let Some(content) = snapshot
-        .file("slophammer.yml")
-        .or_else(|| snapshot.file("slophammer.yaml"))
-        .map(|file| file.content.as_str())
-    else {
-        return Ok(Config::default());
-    };
-    parse(content)
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn parse(content: &str) -> Result<Config, ConfigError> {
     let root: RootConfig = yaml_serde::from_str(content)?;
     let _known_sections = (&root.go, &root.typescript);
     if let Some(python) = &root.python {
         validate_python_section(python)?;
     }

---- app::tests::check_applies_rule_severity_overrides stdout ----

thread 'app::tests::check_applies_rule_severity_overrides' (1823323) panicked at crates/slophammer-cli/src/app.rs:461:9:
assertion failed: result.stdout.contains("\"severity\": \"warn\"")

---- app::tests::config_error_fixtures_return_error_code stdout ----

thread 'app::tests::config_error_fixtures_return_error_code' (1823325) panicked at crates/slophammer-cli/src/app.rs:475:13:
assertion `left == right` failed: rust-invalid-config
  left: 1
 right: 2

---- app::tests::clean_fixture_has_no_findings stdout ----

thread 'app::tests::clean_fixture_has_no_findings' (1823324) panicked at crates/slophammer-cli/src/app.rs:351:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    app::tests::check_applies_rule_severity_overrides
    app::tests::clean_fixture_has_no_findings
    app::tests::config_error_fixtures_return_error_code

test result: FAILED. 60 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
