*** crates/slophammer-cli/src/config.rs:216:5: replace parse -> Result<Config, ConfigError> with Ok(Default::default())

*** mutation diff:
--- crates/slophammer-cli/src/config.rs
+++ replace parse -> Result<Config, ConfigError> with Ok(Default::default())
@@ -208,27 +208,17 @@
         .map(|file| file.content.as_str())
     else {
         return Ok(Config::default());
     };
     parse(content)
 }
 
 pub fn parse(content: &str) -> Result<Config, ConfigError> {
-    let root: RootConfig = yaml_serde::from_str(content)?;
-    let _known_sections = (&root.go, &root.typescript);
-    if let Some(python) = &root.python {
-        validate_python_section(python)?;
-    }
-    let config = Config {
-        rules: root.rules,
-        rust: root.rust,
-    };
-    validate(&config)?;
-    Ok(config)
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// The shared python section is enforced by the Python checker but
 /// shape-validated by every implementation, so typos in shared config fail
 /// everywhere. Key trees mirror specs/CONFIG.md.
 fn validate_python_section(value: &Value) -> Result<(), ConfigError> {
     let allowed = [
         "coverage",

---- config::tests::rejects_weak_rust_coverage stdout ----

thread 'config::tests::rejects_weak_rust_coverage' (1824494) panicked at crates/slophammer-cli/src/config.rs:547:70:
called `Result::unwrap_err()` on an `Ok` value: Config { rules: {}, rust: None }

---- config::tests::rejects_unknown_rust_keys stdout ----

thread 'config::tests::rejects_unknown_rust_keys' (1824492) panicked at crates/slophammer-cli/src/config.rs:553:56:
called `Result::unwrap_err()` on an `Ok` value: Config { rules: {}, rust: None }

---- config::tests::rejects_malformed_python_shapes stdout ----

thread 'config::tests::rejects_malformed_python_shapes' (1824489) panicked at crates/slophammer-cli/src/config.rs:559:43:
called `Result::unwrap_err()` on an `Ok` value: Config { rules: {}, rust: None }

failures:
    app::tests::check_applies_rule_severity_overrides
    app::tests::clean_fixture_has_no_findings
    app::tests::config_error_fixtures_return_error_code
    config::tests::applies_rule_severity_overrides
    config::tests::disabled_rules_require_a_reason
    config::tests::parses_full_rust_config
    config::tests::rejects_malformed_python_shapes
    config::tests::rejects_unknown_python_keys
    config::tests::rejects_unknown_rule_config_keys
    config::tests::rejects_unknown_rust_keys
    config::tests::rejects_weak_complexity_and_dry_budget
    config::tests::rejects_weak_rust_coverage

test result: FAILED. 48 passed; 15 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.10s

*** result: Failure(101)
