*** crates/slophammer-cli/src/config.rs:292:5: replace validate_value_keys -> Result<(), ConfigError> with Ok(())

*** mutation diff:
--- crates/slophammer-cli/src/config.rs
+++ replace validate_value_keys -> Result<(), ConfigError> with Ok(())
@@ -284,33 +284,17 @@
             "python.typecheck.demotions",
             &["rule", "reason"],
         )?;
     }
     Ok(())
 }
 
 fn validate_value_keys(value: &Value, field: &str, allowed: &[&str]) -> Result<(), ConfigError> {
-    let Some(mapping) = value.as_mapping() else {
-        if matches!(value, Value::Null) {
-            return Ok(());
-        }
-        return Err(ConfigError::Validation(format!(
-            "{field} must be a mapping"
-        )));
-    };
-    for (key, _) in mapping {
-        let name = key.as_str().unwrap_or_default();
-        if !allowed.contains(&name) {
-            return Err(ConfigError::Validation(format!(
-                "{field}.{name} is not supported"
-            )));
-        }
-    }
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn validate_value_entries(
     value: Option<&Value>,
     field: &str,
     allowed: &[&str],
 ) -> Result<(), ConfigError> {
     let entries = match value_sequence(value, field)? {

---- config::tests::rejects_malformed_python_shapes stdout ----

thread 'config::tests::rejects_malformed_python_shapes' (1827966) panicked at crates/slophammer-cli/src/config.rs:553:43:
called `Result::unwrap_err()` on an `Ok` value: Config { rules: {}, rust: None }

---- config::tests::rejects_unknown_python_keys stdout ----

thread 'config::tests::rejects_unknown_python_keys' (1827967) panicked at crates/slophammer-cli/src/config.rs:565:57:
called `Result::unwrap_err()` on an `Ok` value: Config { rules: {}, rust: None }

failures:
    config::tests::rejects_malformed_python_shapes
    config::tests::rejects_unknown_python_keys

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
