*** crates/slophammer-cli/src/config.rs:302:12: delete ! in validate_value_keys

*** mutation diff:
--- crates/slophammer-cli/src/config.rs
+++ delete ! in validate_value_keys
@@ -294,17 +294,17 @@
             return Ok(());
         }
         return Err(ConfigError::Validation(format!(
             "{field} must be a mapping"
         )));
     };
     for (key, _) in mapping {
         let name = key.as_str().unwrap_or_default();
-        if !allowed.contains(&name) {
+        if  /* ~ changed by cargo-mutants ~ */allowed.contains(&name) {
             return Err(ConfigError::Validation(format!(
                 "{field}.{name} is not supported"
             )));
         }
     }
     Ok(())
 }

---- config::tests::rejects_malformed_python_shapes stdout ----

thread 'config::tests::rejects_malformed_python_shapes' (1829530) panicked at crates/slophammer-cli/src/config.rs:572:9:
assertion failed: entries.to_string().contains("python.typecheck.demotions must be a sequence")

---- config::tests::parses_full_rust_config stdout ----

thread 'config::tests::parses_full_rust_config' (1829529) panicked at crates/slophammer-cli/src/config.rs:647:10:
config: Validation("python.complexity is not supported")

---- config::tests::rejects_unknown_python_keys stdout ----

thread 'config::tests::rejects_unknown_python_keys' (1829531) panicked at crates/slophammer-cli/src/config.rs:581:57:
called `Result::unwrap_err()` on an `Ok` value: Config { rules: {}, rust: None }

failures:
    config::tests::parses_full_rust_config
    config::tests::rejects_malformed_python_shapes
    config::tests::rejects_unknown_python_keys

test result: FAILED. 60 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
