*** crates/slophammer-cli/src/config.rs:316:5: replace validate_value_entries -> Result<(), ConfigError> with Ok(())

*** mutation diff:
--- crates/slophammer-cli/src/config.rs
+++ replace validate_value_entries -> Result<(), ConfigError> with Ok(())
@@ -308,24 +308,17 @@
     Ok(())
 }
 
 fn validate_value_entries(
     value: Option<&Value>,
     field: &str,
     allowed: &[&str],
 ) -> Result<(), ConfigError> {
-    let entries = match value_sequence(value, field)? {
-        Some(entries) => entries,
-        None => return Ok(()),
-    };
-    for (index, entry) in entries.iter().enumerate() {
-        validate_value_keys(entry, &format!("{field}[{index}]"), allowed)?;
-    }
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// A present but non-sequence value is a shape error, matching the other
 /// implementations; absent and null values are fine.
 fn value_sequence<'a>(
     value: Option<&'a Value>,
     field: &str,
 ) -> Result<Option<&'a Vec<Value>>, ConfigError> {

---- config::tests::rejects_malformed_python_shapes stdout ----

thread 'config::tests::rejects_malformed_python_shapes' (1830687) panicked at crates/slophammer-cli/src/config.rs:564:76:
called `Result::unwrap_err()` on an `Ok` value: Config { rules: {}, rust: None }

---- config::tests::rejects_unknown_python_keys stdout ----

thread 'config::tests::rejects_unknown_python_keys' (1830688) panicked at crates/slophammer-cli/src/config.rs:581:14:
called `Result::unwrap_err()` on an `Ok` value: Config { rules: {}, rust: None }

failures:
    config::tests::rejects_malformed_python_shapes
    config::tests::rejects_unknown_python_keys

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
