*** crates/slophammer-cli/src/config.rs:332:5: replace value_sequence -> Result<Option<&'a Vec<Value>>, ConfigError> with Ok(Some(Box::leak(Box::new(vec![Default::default()]))))

*** mutation diff:
--- crates/slophammer-cli/src/config.rs
+++ replace value_sequence -> Result<Option<&'a Vec<Value>>, ConfigError> with Ok(Some(Box::leak(Box::new(vec![Default::default()]))))
@@ -324,26 +324,17 @@
 }
 
 /// A present but non-sequence value is a shape error, matching the other
 /// implementations; absent and null values are fine.
 fn value_sequence<'a>(
     value: Option<&'a Value>,
     field: &str,
 ) -> Result<Option<&'a Vec<Value>>, ConfigError> {
-    let Some(value) = value else {
-        return Ok(None);
-    };
-    if matches!(value, Value::Null) {
-        return Ok(None);
-    }
-    value
-        .as_sequence()
-        .map(Some)
-        .ok_or_else(|| ConfigError::Validation(format!("{field} must be a sequence")))
+    Ok(Some(Box::leak(Box::new(vec![Default::default()])))) /* ~ changed by cargo-mutants ~ */
 }
 
 fn validate_value_excludes(value: Option<&Value>, field: &str) -> Result<(), ConfigError> {
     let entries = match value_sequence(value, field)? {
         Some(entries) => entries,
         None => return Ok(()),
     };
     for (index, entry) in entries.iter().enumerate() {

---- config::tests::rejects_malformed_python_shapes stdout ----

thread 'config::tests::rejects_malformed_python_shapes' (1835548) panicked at crates/slophammer-cli/src/config.rs:562:76:
called `Result::unwrap_err()` on an `Ok` value: Config { rules: {}, rust: None }

---- config::tests::rejects_unknown_python_keys stdout ----

thread 'config::tests::rejects_unknown_python_keys' (1835549) panicked at crates/slophammer-cli/src/config.rs:579:14:
called `Result::unwrap_err()` on an `Ok` value: Config { rules: {}, rust: None }

failures:
    config::tests::rejects_malformed_python_shapes
    config::tests::rejects_unknown_python_keys

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
