*** crates/slophammer-cli/src/config.rs:359:5: replace validate -> Result<(), ConfigError> with Ok(())

*** mutation diff:
--- crates/slophammer-cli/src/config.rs
+++ replace validate -> Result<(), ConfigError> with Ok(())
@@ -351,73 +351,17 @@
             continue;
         }
         validate_value_keys(entry, &format!("{field}[{index}]"), &["pattern", "reason"])?;
     }
     Ok(())
 }
 
 fn validate(config: &Config) -> Result<(), ConfigError> {
-    for (rule_id, rule) in &config.rules {
-        if rule.disabled && rule.reason.as_deref().unwrap_or("").trim().is_empty() {
-            return Err(ConfigError::Validation(format!(
-                "rules.{rule_id}.reason is required when disabled is true"
-            )));
-        }
-    }
-    let Some(rust) = &config.rust else {
-        return Ok(());
-    };
-    validate_excludes(rust)?;
-    let coverage_threshold = rust.coverage.as_ref().map(|coverage| coverage.threshold);
-    if let Some(threshold) = coverage_threshold {
-        if threshold < 85 {
-            return Err(ConfigError::Validation(
-                "rust coverage threshold must be at least 85".to_owned(),
-            ));
-        }
-    }
-    if let Some(complexity) = &rust.complexity {
-        if complexity.cognitive_max > 8 {
-            return Err(ConfigError::Validation(
-                "rust complexity cognitive_max must be at most 8".to_owned(),
-            ));
-        }
-    }
-    if let Some(dry) = &rust.dry {
-        if dry.max_findings != 0 {
-            return Err(ConfigError::Validation(
-                "rust dry max_findings must be 0 for production code".to_owned(),
-            ));
-        }
-        if let Some(copied_blocks) = &dry.copied_blocks {
-            if copied_blocks.min_tokens == 0 {
-                return Err(ConfigError::Validation(
-                    "rust dry copied_blocks min_tokens must be positive".to_owned(),
-                ));
-            }
-        }
-    }
-    if let Some(unsafe_policy) = &rust.unsafe_policy {
-        for allow in &unsafe_policy.allow {
-            if allow.path.trim().is_empty() || allow.reason.trim().is_empty() {
-                return Err(ConfigError::Validation(
-                    "rust unsafe allow entries require path and reason".to_owned(),
-                ));
-            }
-        }
-    }
-    for boundary in &rust.dependency_boundaries {
-        if boundary.from.trim().is_empty() {
-            return Err(ConfigError::Validation(
-                "rust dependency boundaries require from".to_owned(),
-            ));
-        }
-    }
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// A string exclude may only name conventional non-production patterns;
 /// excludes that carve out production files must carry a reason.
 fn validate_excludes(rust: &RustConfig) -> Result<(), ConfigError> {
     let sections: [(&str, &[ExcludeEntry]); 4] = [
         ("rust.exclude", &rust.exclude),
         (

---- config::tests::disabled_rules_require_a_reason stdout ----

thread 'config::tests::disabled_rules_require_a_reason' (1838954) panicked at crates/slophammer-cli/src/config.rs:636:10:
called `Result::unwrap_err()` on an `Ok` value: Config { rules: {"repo.readme-required": RuleConfig { severity: None, disabled: true, reason: None, threshold: None, max: None }}, rust: None }

---- app::tests::config_error_fixtures_return_error_code stdout ----

thread 'app::tests::config_error_fixtures_return_error_code' (1838940) panicked at crates/slophammer-cli/src/app.rs:475:13:
assertion `left == right` failed: rust-invalid-config
  left: 1
 right: 2

---- config::tests::rejects_weak_rust_coverage stdout ----

thread 'config::tests::rejects_weak_rust_coverage' (1838962) panicked at crates/slophammer-cli/src/config.rs:501:70:
called `Result::unwrap_err()` on an `Ok` value: Config { rules: {}, rust: Some(RustConfig { coverage: Some(RustCoverage { threshold: 40, paths: [], exclude: [] }), complexity: None, targets: [], exclude: [], dry: None, unsafe_policy: None, mutation: None, dependency_boundaries: [] }) }

failures:
    app::tests::config_error_fixtures_return_error_code
    config::tests::disabled_rules_require_a_reason
    config::tests::rejects_weak_complexity_and_dry_budget
    config::tests::rejects_weak_rust_coverage

test result: FAILED. 59 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
