*** crates/slophammer-cli/src/config.rs:360:26: replace && with || in validate

*** mutation diff:
--- crates/slophammer-cli/src/config.rs
+++ replace && with || in validate
@@ -352,17 +352,17 @@
         }
         validate_value_keys(entry, &format!("{field}[{index}]"), &["pattern", "reason"])?;
     }
     Ok(())
 }
 
 fn validate(config: &Config) -> Result<(), ConfigError> {
     for (rule_id, rule) in &config.rules {
-        if rule.disabled && rule.reason.as_deref().unwrap_or("").trim().is_empty() {
+        if rule.disabled || /* ~ changed by cargo-mutants ~ */ rule.reason.as_deref().unwrap_or("").trim().is_empty() {
             return Err(ConfigError::Validation(format!(
                 "rules.{rule_id}.reason is required when disabled is true"
             )));
         }
     }
     let Some(rust) = &config.rust else {
         return Ok(());
     };

---- app::tests::check_applies_rule_severity_overrides stdout ----

thread 'app::tests::check_applies_rule_severity_overrides' (1840521) panicked at crates/slophammer-cli/src/app.rs:455:9:
assertion `left == right` failed
  left: 2
 right: 1

---- config::tests::applies_rule_severity_overrides stdout ----

thread 'config::tests::applies_rule_severity_overrides' (1840550) panicked at crates/slophammer-cli/src/config.rs:705:10:
config: Validation("rules.repo.readme-required.reason is required when disabled is true")

---- config::tests::parses_full_rust_config stdout ----

thread 'config::tests::parses_full_rust_config' (1840552) panicked at crates/slophammer-cli/src/config.rs:647:10:
config: Validation("rules.repo.readme-required.reason is required when disabled is true")

failures:
    app::tests::check_applies_rule_severity_overrides
    config::tests::applies_rule_severity_overrides
    config::tests::parses_full_rust_config

test result: FAILED. 60 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
