*** crates/slophammer-cli/src/config.rs:372:22: replace < with == in validate

*** mutation diff:
--- crates/slophammer-cli/src/config.rs
+++ replace < with == in validate
@@ -364,17 +364,17 @@
         }
     }
     let Some(rust) = &config.rust else {
         return Ok(());
     };
     validate_excludes(rust)?;
     let coverage_threshold = rust.coverage.as_ref().map(|coverage| coverage.threshold);
     if let Some(threshold) = coverage_threshold {
-        if threshold < 85 {
+        if threshold == /* ~ changed by cargo-mutants ~ */ 85 {
             return Err(ConfigError::Validation(
                 "rust coverage threshold must be at least 85".to_owned(),
             ));
         }
     }
     if let Some(complexity) = &rust.complexity {
         if complexity.cognitive_max > 8 {
             return Err(ConfigError::Validation(

---- app::tests::only_rules_accept_comma_separated_ids stdout ----

thread 'app::tests::only_rules_accept_comma_separated_ids' (1841792) panicked at crates/slophammer-cli/src/app.rs:325:9:
assertion `left == right` failed: check failed: config failed: rust coverage threshold must be at least 85

  left: 2
 right: 0

---- app::tests::config_error_fixtures_return_error_code stdout ----

thread 'app::tests::config_error_fixtures_return_error_code' (1841789) panicked at crates/slophammer-cli/src/app.rs:475:13:
assertion `left == right` failed: rust-invalid-config
  left: 1
 right: 2

---- config::tests::rejects_weak_rust_coverage stdout ----

thread 'config::tests::rejects_weak_rust_coverage' (1841812) panicked at crates/slophammer-cli/src/config.rs:557:70:
called `Result::unwrap_err()` on an `Ok` value: Config { rules: {}, rust: Some(RustConfig { coverage: Some(RustCoverage { threshold: 40, paths: [], exclude: [] }), complexity: None, targets: [], exclude: [], dry: None, unsafe_policy: None, mutation: None, dependency_boundaries: [] }) }

failures:
    app::tests::clean_fixture_has_no_findings
    app::tests::config_error_fixtures_return_error_code
    app::tests::direct_commands_use_report_contract
    app::tests::only_rules_accept_comma_separated_ids
    app::tests::rust_failure_fixtures_report_findings
    config::tests::rejects_weak_rust_coverage
    rust_rules::tests::accepts_stricter_coverage_thresholds

test result: FAILED. 56 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
