*** crates/slophammer-cli/src/config.rs:372:22: replace < with > in validate

*** mutation diff:
--- crates/slophammer-cli/src/config.rs
+++ replace < with > in validate
@@ -364,17 +364,17 @@
         }
     }
     let Some(rust) = &config.rust else {
         return Ok(());
     };
     validate_excludes(rust)?;
     let coverage_threshold = rust.coverage.as_ref().map(|coverage| coverage.threshold);
     if let Some(threshold) = coverage_threshold {
-        if threshold < 85 {
+        if threshold > /* ~ changed by cargo-mutants ~ */ 85 {
             return Err(ConfigError::Validation(
                 "rust coverage threshold must be at least 85".to_owned(),
             ));
         }
     }
     if let Some(complexity) = &rust.complexity {
         if complexity.cognitive_max > 8 {
             return Err(ConfigError::Validation(

---- app::tests::config_error_fixtures_return_error_code stdout ----

thread 'app::tests::config_error_fixtures_return_error_code' (1843185) panicked at crates/slophammer-cli/src/app.rs:475:13:
assertion `left == right` failed: rust-invalid-config
  left: 1
 right: 2

---- config::tests::parses_full_rust_config stdout ----

thread 'config::tests::parses_full_rust_config' (1843202) panicked at crates/slophammer-cli/src/config.rs:647:10:
config: Validation("rust coverage threshold must be at least 85")

---- config::tests::rejects_weak_rust_coverage stdout ----

thread 'config::tests::rejects_weak_rust_coverage' (1843208) panicked at crates/slophammer-cli/src/config.rs:557:70:
called `Result::unwrap_err()` on an `Ok` value: Config { rules: {}, rust: Some(RustConfig { coverage: Some(RustCoverage { threshold: 40, paths: [], exclude: [] }), complexity: None, targets: [], exclude: [], dry: None, unsafe_policy: None, mutation: None, dependency_boundaries: [] }) }

failures:
    app::tests::config_error_fixtures_return_error_code
    config::tests::parses_full_rust_config
    config::tests::rejects_weak_rust_coverage

test result: FAILED. 60 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.10s

*** result: Failure(101)
