*** crates/slophammer-cli/src/config.rs:372:22: replace < with <= in validate

*** mutation diff:
--- crates/slophammer-cli/src/config.rs
+++ replace < with <= in validate
@@ -364,17 +364,17 @@
         }
     }
     let Some(rust) = &config.rust else {
         return Ok(());
     };
     validate_excludes(rust)?;
     let coverage_threshold = rust.coverage.as_ref().map(|coverage| coverage.threshold);
     if let Some(threshold) = coverage_threshold {
-        if threshold < 85 {
+        if threshold <= /* ~ changed by cargo-mutants ~ */ 85 {
             return Err(ConfigError::Validation(
                 "rust coverage threshold must be at least 85".to_owned(),
             ));
         }
     }
     if let Some(complexity) = &rust.complexity {
         if complexity.cognitive_max > 8 {
             return Err(ConfigError::Validation(

---- app::tests::clean_fixture_has_no_findings stdout ----

thread 'app::tests::clean_fixture_has_no_findings' (1844721) panicked at crates/slophammer-cli/src/app.rs:351:9:
assertion `left == right` failed
  left: 2
 right: 0

---- app::tests::direct_commands_use_report_contract stdout ----

thread 'app::tests::direct_commands_use_report_contract' (1844724) panicked at crates/slophammer-cli/src/app.rs:391:9:
assertion `left == right` failed
  left: 2
 right: 0

---- app::tests::only_rules_accept_comma_separated_ids stdout ----

thread 'app::tests::only_rules_accept_comma_separated_ids' (1844726) panicked at crates/slophammer-cli/src/app.rs:325:9:
assertion `left == right` failed: check failed: config failed: rust coverage threshold must be at least 85

  left: 2
 right: 0

failures:
    app::tests::clean_fixture_has_no_findings
    app::tests::direct_commands_use_report_contract
    app::tests::only_rules_accept_comma_separated_ids
    app::tests::rust_failure_fixtures_report_findings
    rust_rules::tests::accepts_stricter_coverage_thresholds

test result: FAILED. 58 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
