*** crates/slophammer-cli/src/config.rs:379:37: replace > with < in validate

*** mutation diff:
--- crates/slophammer-cli/src/config.rs
+++ replace > with < in validate
@@ -371,17 +371,17 @@
     if let Some(threshold) = coverage_threshold {
         if threshold < 85 {
             return Err(ConfigError::Validation(
                 "rust coverage threshold must be at least 85".to_owned(),
             ));
         }
     }
     if let Some(complexity) = &rust.complexity {
-        if complexity.cognitive_max > 8 {
+        if complexity.cognitive_max < /* ~ changed by cargo-mutants ~ */ 8 {
             return Err(ConfigError::Validation(
                 "rust complexity cognitive_max must be at most 8".to_owned(),
             ));
         }
     }
     if let Some(dry) = &rust.dry {
         if dry.max_findings != 0 {
             return Err(ConfigError::Validation(

---- config::tests::rejects_weak_complexity_and_dry_budget stdout ----

thread 'config::tests::rejects_weak_complexity_and_dry_budget' (1847505) panicked at crates/slophammer-cli/src/config.rs:663:80:
called `Result::unwrap_err()` on an `Ok` value: Config { rules: {}, rust: Some(RustConfig { coverage: None, complexity: Some(RustComplexity { cognitive_max: 9 }), targets: [], exclude: [], dry: None, unsafe_policy: None, mutation: None, dependency_boundaries: [] }) }

---- config::tests::parses_full_rust_config stdout ----

thread 'config::tests::parses_full_rust_config' (1847500) panicked at crates/slophammer-cli/src/config.rs:647:10:
config: Validation("rust complexity cognitive_max must be at most 8")

failures:
    config::tests::parses_full_rust_config
    config::tests::rejects_weak_complexity_and_dry_budget

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
