*** crates/slophammer-cli/src/config.rs:379:37: replace > with >= in validate

*** mutation diff:
--- crates/slophammer-cli/src/config.rs
+++ replace > with >= in validate
@@ -371,17 +371,17 @@
     if let Some(threshold) = coverage_threshold {
         if threshold < 85 {
             return Err(ConfigError::Validation(
                 "rust coverage threshold must be at least 85".to_owned(),
             ));
         }
     }
     if let Some(complexity) = &rust.complexity {
-        if complexity.cognitive_max > 8 {
+        if complexity.cognitive_max >= /* ~ changed by cargo-mutants ~ */ 8 {
             return Err(ConfigError::Validation(
                 "rust complexity cognitive_max must be at most 8".to_owned(),
             ));
         }
     }
     if let Some(dry) = &rust.dry {
         if dry.max_findings != 0 {
             return Err(ConfigError::Validation(

---- app::tests::clean_fixture_has_no_findings stdout ----

thread 'app::tests::clean_fixture_has_no_findings' (1848844) panicked at crates/slophammer-cli/src/app.rs:351:9:
assertion `left == right` failed
  left: 2
 right: 0

---- app::tests::direct_commands_use_report_contract stdout ----

thread 'app::tests::direct_commands_use_report_contract' (1848846) panicked at crates/slophammer-cli/src/app.rs:391:9:
assertion `left == right` failed
  left: 2
 right: 0

---- app::tests::only_rules_accept_comma_separated_ids stdout ----

thread 'app::tests::only_rules_accept_comma_separated_ids' (1848848) panicked at crates/slophammer-cli/src/app.rs:325:9:
assertion `left == right` failed: check failed: config failed: rust complexity cognitive_max must be at most 8

  left: 2
 right: 0

failures:
    app::tests::clean_fixture_has_no_findings
    app::tests::direct_commands_use_report_contract
    app::tests::only_rules_accept_comma_separated_ids
    app::tests::rust_failure_fixtures_report_findings
    rust_rules::tests::configured_complexity_policy_satisfies_complexity_rule

test result: FAILED. 58 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
