*** crates/slophammer-cli/src/config.rs:386:29: replace != with == in validate

*** mutation diff:
--- crates/slophammer-cli/src/config.rs
+++ replace != with == in validate
@@ -378,17 +378,17 @@
     if let Some(complexity) = &rust.complexity {
         if complexity.cognitive_max > 8 {
             return Err(ConfigError::Validation(
                 "rust complexity cognitive_max must be at most 8".to_owned(),
             ));
         }
     }
     if let Some(dry) = &rust.dry {
-        if dry.max_findings != 0 {
+        if dry.max_findings == /* ~ changed by cargo-mutants ~ */ 0 {
             return Err(ConfigError::Validation(
                 "rust dry max_findings must be 0 for production code".to_owned(),
             ));
         }
         if let Some(copied_blocks) = &dry.copied_blocks {
             if copied_blocks.min_tokens == 0 {
                 return Err(ConfigError::Validation(
                     "rust dry copied_blocks min_tokens must be positive".to_owned(),

---- config::tests::parses_full_rust_config stdout ----

thread 'config::tests::parses_full_rust_config' (1850067) panicked at crates/slophammer-cli/src/config.rs:647:10:
config: Validation("rust dry max_findings must be 0 for production code")

---- app::tests::direct_commands_use_report_contract stdout ----

thread 'app::tests::direct_commands_use_report_contract' (1850052) panicked at crates/slophammer-cli/src/app.rs:391:9:
assertion `left == right` failed
  left: 2
 right: 0

---- app::tests::only_rules_accept_comma_separated_ids stdout ----

thread 'app::tests::only_rules_accept_comma_separated_ids' (1850054) panicked at crates/slophammer-cli/src/app.rs:325:9:
assertion `left == right` failed: check failed: config failed: rust dry max_findings must be 0 for production code

  left: 2
 right: 0

failures:
    app::tests::clean_fixture_has_no_findings
    app::tests::direct_commands_use_report_contract
    app::tests::only_rules_accept_comma_separated_ids
    app::tests::rust_failure_fixtures_report_findings
    config::tests::parses_full_rust_config
    config::tests::rejects_weak_complexity_and_dry_budget

test result: FAILED. 57 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
