*** crates/slophammer-cli/src/config.rs:392:41: replace == with != in validate

*** mutation diff:
--- crates/slophammer-cli/src/config.rs
+++ replace == with != in validate
@@ -384,17 +384,17 @@
     }
     if let Some(dry) = &rust.dry {
         if dry.max_findings != 0 {
             return Err(ConfigError::Validation(
                 "rust dry max_findings must be 0 for production code".to_owned(),
             ));
         }
         if let Some(copied_blocks) = &dry.copied_blocks {
-            if copied_blocks.min_tokens == 0 {
+            if copied_blocks.min_tokens != /* ~ changed by cargo-mutants ~ */ 0 {
                 return Err(ConfigError::Validation(
                     "rust dry copied_blocks min_tokens must be positive".to_owned(),
                 ));
             }
         }
     }
     if let Some(unsafe_policy) = &rust.unsafe_policy {
         for allow in &unsafe_policy.allow {

---- config::tests::parses_full_rust_config stdout ----

thread 'config::tests::parses_full_rust_config' (1851670) panicked at crates/slophammer-cli/src/config.rs:647:10:
config: Validation("rust dry copied_blocks min_tokens must be positive")

---- app::tests::only_rules_accept_comma_separated_ids stdout ----

thread 'app::tests::only_rules_accept_comma_separated_ids' (1851658) panicked at crates/slophammer-cli/src/app.rs:325:9:
assertion `left == right` failed: check failed: config failed: rust dry copied_blocks min_tokens must be positive

  left: 2
 right: 0

---- app::tests::rust_failure_fixtures_report_findings stdout ----

thread 'app::tests::rust_failure_fixtures_report_findings' (1851660) panicked at crates/slophammer-cli/src/app.rs:378:13:
assertion `left == right` failed: rust-bad-dependency
  left: 2
 right: 1

failures:
    app::tests::clean_fixture_has_no_findings
    app::tests::direct_commands_use_report_contract
    app::tests::only_rules_accept_comma_separated_ids
    app::tests::rust_failure_fixtures_report_findings
    config::tests::parses_full_rust_config

test result: FAILED. 58 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
