*** crates/slophammer-cli/src/config.rs:401:45: replace || with && in validate

*** mutation diff:
--- crates/slophammer-cli/src/config.rs
+++ replace || with && in validate
@@ -393,17 +393,17 @@
                 return Err(ConfigError::Validation(
                     "rust dry copied_blocks min_tokens must be positive".to_owned(),
                 ));
             }
         }
     }
     if let Some(unsafe_policy) = &rust.unsafe_policy {
         for allow in &unsafe_policy.allow {
-            if allow.path.trim().is_empty() || allow.reason.trim().is_empty() {
+            if allow.path.trim().is_empty() && /* ~ changed by cargo-mutants ~ */ allow.reason.trim().is_empty() {
                 return Err(ConfigError::Validation(
                     "rust unsafe allow entries require path and reason".to_owned(),
                 ));
             }
         }
     }
     for boundary in &rust.dependency_boundaries {
         if boundary.from.trim().is_empty() {

*** result: Success
