*** crates/slophammer-cli/src/config.rs:421:5: replace validate_excludes -> Result<(), ConfigError> with Ok(())

*** mutation diff:
--- crates/slophammer-cli/src/config.rs
+++ replace validate_excludes -> Result<(), ConfigError> with Ok(())
@@ -413,35 +413,17 @@
         }
     }
     Ok(())
 }
 
 /// A string exclude may only name conventional non-production patterns;
 /// excludes that carve out production files must carry a reason.
 fn validate_excludes(rust: &RustConfig) -> Result<(), ConfigError> {
-    let sections: [(&str, &[ExcludeEntry]); 4] = [
-        ("rust.exclude", &rust.exclude),
-        (
-            "rust.coverage.exclude",
-            rust.coverage.as_ref().map_or(&[], |c| &c.exclude),
-        ),
-        (
-            "rust.dry.exclude",
-            rust.dry.as_ref().map_or(&[], |d| &d.exclude),
-        ),
-        (
-            "rust.mutation.exclude",
-            rust.mutation.as_ref().map_or(&[], |m| &m.exclude),
-        ),
-    ];
-    for (section, entries) in sections {
-        validate_exclude_entries(section, entries)?;
-    }
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn validate_exclude_entries(section: &str, entries: &[ExcludeEntry]) -> Result<(), ConfigError> {
     for entry in entries {
         if entry.needs_reason() {
             return Err(ConfigError::Validation(format!(
                 "{section} requires a reason for production paths"
             )));

*** result: Success
