*** crates/slophammer-cli/src/config.rs:443:5: replace validate_exclude_entries -> Result<(), ConfigError> with Ok(())

*** mutation diff:
--- crates/slophammer-cli/src/config.rs
+++ replace validate_exclude_entries -> Result<(), ConfigError> with Ok(())
@@ -435,29 +435,17 @@
     ];
     for (section, entries) in sections {
         validate_exclude_entries(section, entries)?;
     }
     Ok(())
 }
 
 fn validate_exclude_entries(section: &str, entries: &[ExcludeEntry]) -> Result<(), ConfigError> {
-    for entry in entries {
-        if entry.needs_reason() {
-            return Err(ConfigError::Validation(format!(
-                "{section} requires a reason for production paths"
-            )));
-        }
-        if entry.empty_reason() {
-            return Err(ConfigError::Validation(format!(
-                "{section} reasons must not be empty"
-            )));
-        }
-    }
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn apply_rule_config(config: &Config, findings: &mut [Finding]) {
     for finding in findings {
         if let Some(severity) = rule_severity(config, &finding.rule_id) {
             finding.severity = severity.into();
         }
     }

*** result: Success
