*** crates/slophammer-cli/src/config.rs:459:5: replace apply_rule_config with ()

*** mutation diff:
--- crates/slophammer-cli/src/config.rs
+++ replace apply_rule_config with ()
@@ -451,21 +451,17 @@
                 "{section} reasons must not be empty"
             )));
         }
     }
     Ok(())
 }
 
 pub fn apply_rule_config(config: &Config, findings: &mut [Finding]) {
-    for finding in findings {
-        if let Some(severity) = rule_severity(config, &finding.rule_id) {
-            finding.severity = severity.into();
-        }
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn rule_severity(config: &Config, rule_id: &str) -> Option<RuleSeverity> {
     config.rules.get(rule_id).and_then(|rule| rule.severity)
 }
 
 pub fn rust_targets(config: &Config) -> Vec<String> {
     config

---- config::tests::applies_rule_severity_overrides stdout ----

thread 'config::tests::applies_rule_severity_overrides' (1858152) panicked at crates/slophammer-cli/src/config.rs:712:9:
assertion `left == right` failed
  left: Error
 right: Warn

---- app::tests::check_applies_rule_severity_overrides stdout ----

thread 'app::tests::check_applies_rule_severity_overrides' (1858137) panicked at crates/slophammer-cli/src/app.rs:461:9:
assertion failed: result.stdout.contains("\"severity\": \"warn\"")

failures:
    app::tests::check_applies_rule_severity_overrides
    config::tests::applies_rule_severity_overrides

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.14s

*** result: Failure(101)
