*** crates/slophammer-cli/src/config.rs:467:5: replace rule_severity -> Option<RuleSeverity> with None

*** mutation diff:
--- crates/slophammer-cli/src/config.rs
+++ replace rule_severity -> Option<RuleSeverity> with None
@@ -459,17 +459,17 @@
     for finding in findings {
         if let Some(severity) = rule_severity(config, &finding.rule_id) {
             finding.severity = severity.into();
         }
     }
 }
 
 pub fn rule_severity(config: &Config, rule_id: &str) -> Option<RuleSeverity> {
-    config.rules.get(rule_id).and_then(|rule| rule.severity)
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn rust_targets(config: &Config) -> Vec<String> {
     config
         .rust
         .as_ref()
         .map(|rust| {
             if rust.targets.is_empty() {

---- app::tests::check_applies_rule_severity_overrides stdout ----

thread 'app::tests::check_applies_rule_severity_overrides' (1859648) panicked at crates/slophammer-cli/src/app.rs:461:9:
assertion failed: result.stdout.contains("\"severity\": \"warn\"")

---- config::tests::parses_full_rust_config stdout ----

thread 'config::tests::parses_full_rust_config' (1859666) panicked at crates/slophammer-cli/src/config.rs:655:9:
assertion `left == right` failed
  left: None
 right: Some(Warn)

---- config::tests::applies_rule_severity_overrides stdout ----

thread 'config::tests::applies_rule_severity_overrides' (1859664) panicked at crates/slophammer-cli/src/config.rs:716:9:
assertion `left == right` failed
  left: Error
 right: Warn

failures:
    app::tests::check_applies_rule_severity_overrides
    config::tests::applies_rule_severity_overrides
    config::tests::parses_full_rust_config

test result: FAILED. 60 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
