*** crates/slophammer-cli/src/config.rs:471:5: replace rust_targets -> Vec<String> with vec![]

*** mutation diff:
--- crates/slophammer-cli/src/config.rs
+++ replace rust_targets -> Vec<String> with vec![]
@@ -463,27 +463,17 @@
     }
 }
 
 pub fn rule_severity(config: &Config, rule_id: &str) -> Option<RuleSeverity> {
     config.rules.get(rule_id).and_then(|rule| rule.severity)
 }
 
 pub fn rust_targets(config: &Config) -> Vec<String> {
-    config
-        .rust
-        .as_ref()
-        .map(|rust| {
-            if rust.targets.is_empty() {
-                vec![".".to_owned()]
-            } else {
-                rust.targets.clone()
-            }
-        })
-        .unwrap_or_else(|| vec![".".to_owned()])
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn rust_exclude(config: &Config) -> Vec<String> {
     config
         .rust
         .as_ref()
         .map(|rust| exclude_patterns(&rust.exclude))
         .unwrap_or_default()

---- config::tests::parses_full_rust_config stdout ----

thread 'config::tests::parses_full_rust_config' (1861278) panicked at crates/slophammer-cli/src/config.rs:639:9:
assertion `left == right` failed
  left: []
 right: ["crates"]

failures:
    config::tests::parses_full_rust_config

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
