*** crates/slophammer-cli/src/config.rs:471:5: replace rust_targets -> Vec<String> with vec![String::new()]

*** mutation diff:
--- crates/slophammer-cli/src/config.rs
+++ replace rust_targets -> Vec<String> with vec![String::new()]
@@ -463,27 +463,17 @@
     }
 }
 
 pub fn rule_severity(config: &Config, rule_id: &str) -> Option<RuleSeverity> {
     config.rules.get(rule_id).and_then(|rule| rule.severity)
 }
 
 pub fn rust_targets(config: &Config) -> Vec<String> {
-    config
-        .rust
-        .as_ref()
-        .map(|rust| {
-            if rust.targets.is_empty() {
-                vec![".".to_owned()]
-            } else {
-                rust.targets.clone()
-            }
-        })
-        .unwrap_or_else(|| vec![".".to_owned()])
+    vec![String::new()] /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn rust_exclude(config: &Config) -> Vec<String> {
     config
         .rust
         .as_ref()
         .map(|rust| exclude_patterns(&rust.exclude))
         .unwrap_or_default()

---- config::tests::parses_full_rust_config stdout ----

thread 'config::tests::parses_full_rust_config' (1862523) panicked at crates/slophammer-cli/src/config.rs:639:9:
assertion `left == right` failed
  left: [""]
 right: ["crates"]

---- app::tests::direct_commands_use_report_contract stdout ----

thread 'app::tests::direct_commands_use_report_contract' (1862506) panicked at crates/slophammer-cli/src/app.rs:413:9:
assertion `left == right` failed
  left: 0
 right: 1

---- rust_rules::unsafe_policy::tests::allow_documented_requires_allow_entry stdout ----

thread 'rust_rules::unsafe_policy::tests::allow_documented_requires_allow_entry' (1862571) panicked at crates/slophammer-cli/src/rust_rules/unsafe_policy.rs:183:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    app::tests::direct_commands_use_report_contract
    app::tests::rust_failure_fixtures_report_findings
    config::tests::parses_full_rust_config
    rust_rules::unsafe_policy::tests::allow_documented_requires_allow_entry

test result: FAILED. 59 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
