*** crates/slophammer-cli/src/config.rs:493:5: replace exclude_patterns -> Vec<String> with vec!["xyzzy".into()]

*** mutation diff:
--- crates/slophammer-cli/src/config.rs
+++ replace exclude_patterns -> Vec<String> with vec!["xyzzy".into()]
@@ -485,20 +485,17 @@
     config
         .rust
         .as_ref()
         .map(|rust| exclude_patterns(&rust.exclude))
         .unwrap_or_default()
 }
 
 pub fn exclude_patterns(entries: &[ExcludeEntry]) -> Vec<String> {
-    entries
-        .iter()
-        .map(|entry| entry.pattern().to_owned())
-        .collect()
+    vec!["xyzzy".into()] /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn rust_coverage_threshold(config: &Config) -> u32 {
     config
         .rust
         .as_ref()
         .and_then(|rust| rust.coverage.as_ref().map(|coverage| coverage.threshold))
         .unwrap_or(85)

---- rust_rules::scope::tests::mutation_excludes_cover_out_of_scope_production_files stdout ----

thread 'rust_rules::scope::tests::mutation_excludes_cover_out_of_scope_production_files' (1872797) panicked at crates/slophammer-cli/src/rust_rules/scope.rs:239:9:
assertion failed: scope_findings(&repo, &covered).is_empty()

failures:
    rust_rules::scope::tests::mutation_excludes_cover_out_of_scope_production_files

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
