*** crates/slophammer-cli/src/config.rs:500:5: replace rust_coverage_threshold -> u32 with 0

*** mutation diff:
--- crates/slophammer-cli/src/config.rs
+++ replace rust_coverage_threshold -> u32 with 0
@@ -492,21 +492,17 @@
 pub fn exclude_patterns(entries: &[ExcludeEntry]) -> Vec<String> {
     entries
         .iter()
         .map(|entry| entry.pattern().to_owned())
         .collect()
 }
 
 pub fn rust_coverage_threshold(config: &Config) -> u32 {
-    config
-        .rust
-        .as_ref()
-        .and_then(|rust| rust.coverage.as_ref().map(|coverage| coverage.threshold))
-        .unwrap_or(85)
+    0 /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn rust_dry_paths(config: &Config) -> Vec<String> {
     config
         .rust
         .as_ref()
         .and_then(|rust| rust.dry.as_ref())
         .map(|dry| {

---- config::tests::parses_full_rust_config stdout ----

thread 'config::tests::parses_full_rust_config' (1874306) panicked at crates/slophammer-cli/src/config.rs:644:9:
assertion `left == right` failed
  left: 0
 right: 90

failures:
    config::tests::parses_full_rust_config

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
