*** crates/slophammer-cli/src/config.rs:508:5: replace rust_dry_paths -> Vec<String> with vec!["xyzzy".into()]

*** mutation diff:
--- crates/slophammer-cli/src/config.rs
+++ replace rust_dry_paths -> Vec<String> with vec!["xyzzy".into()]
@@ -500,28 +500,17 @@
     config
         .rust
         .as_ref()
         .and_then(|rust| rust.coverage.as_ref().map(|coverage| coverage.threshold))
         .unwrap_or(85)
 }
 
 pub fn rust_dry_paths(config: &Config) -> Vec<String> {
-    config
-        .rust
-        .as_ref()
-        .and_then(|rust| rust.dry.as_ref())
-        .map(|dry| {
-            if dry.paths.is_empty() {
-                rust_targets(config)
-            } else {
-                dry.paths.clone()
-            }
-        })
-        .unwrap_or_else(|| rust_targets(config))
+    vec!["xyzzy".into()] /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn rust_dry_exclude(config: &Config) -> Vec<String> {
     config
         .rust
         .as_ref()
         .and_then(|rust| rust.dry.as_ref())
         .map(|dry| exclude_patterns(&dry.exclude))

---- config::tests::parses_full_rust_config stdout ----

thread 'config::tests::parses_full_rust_config' (1879835) panicked at crates/slophammer-cli/src/config.rs:639:9:
assertion `left == right` failed
  left: ["xyzzy"]
 right: ["crates/slophammer-cli/src/rust_rules"]

---- rust_rules::dry::tests::detects_same_file_copied_blocks stdout ----

thread 'rust_rules::dry::tests::detects_same_file_copied_blocks' (1879852) panicked at crates/slophammer-cli/src/rust_rules/dry.rs:148:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    config::tests::parses_full_rust_config
    rust_rules::dry::tests::detects_same_file_copied_blocks

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
