*** crates/slophammer-cli/src/config.rs:523:5: replace rust_dry_exclude -> Vec<String> with vec!["xyzzy".into()]

*** mutation diff:
--- crates/slophammer-cli/src/config.rs
+++ replace rust_dry_exclude -> Vec<String> with vec!["xyzzy".into()]
@@ -515,22 +515,17 @@
             } else {
                 dry.paths.clone()
             }
         })
         .unwrap_or_else(|| rust_targets(config))
 }
 
 pub fn rust_dry_exclude(config: &Config) -> Vec<String> {
-    config
-        .rust
-        .as_ref()
-        .and_then(|rust| rust.dry.as_ref())
-        .map(|dry| exclude_patterns(&dry.exclude))
-        .unwrap_or_else(|| rust_exclude(config))
+    vec!["xyzzy".into()] /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn rust_dry_min_tokens(config: &Config) -> usize {
     config
         .rust
         .as_ref()
         .and_then(|rust| rust.dry.as_ref())
         .and_then(|dry| dry.copied_blocks.as_ref())

*** result: Success
