*** crates/slophammer-cli/src/config.rs:532:5: replace rust_dry_min_tokens -> usize with 1

*** mutation diff:
--- crates/slophammer-cli/src/config.rs
+++ replace rust_dry_min_tokens -> usize with 1
@@ -524,23 +524,17 @@
         .rust
         .as_ref()
         .and_then(|rust| rust.dry.as_ref())
         .map(|dry| exclude_patterns(&dry.exclude))
         .unwrap_or_else(|| rust_exclude(config))
 }
 
 pub fn rust_dry_min_tokens(config: &Config) -> usize {
-    config
-        .rust
-        .as_ref()
-        .and_then(|rust| rust.dry.as_ref())
-        .and_then(|dry| dry.copied_blocks.as_ref())
-        .map(|copied_blocks| copied_blocks.min_tokens)
-        .unwrap_or(100)
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn rust_dry_copied_blocks_enabled(config: &Config) -> bool {
     config
         .rust
         .as_ref()
         .and_then(|rust| rust.dry.as_ref())
         .and_then(|dry| dry.copied_blocks.as_ref())

---- config::tests::parses_full_rust_config stdout ----

thread 'config::tests::parses_full_rust_config' (1885019) panicked at crates/slophammer-cli/src/config.rs:648:9:
assertion `left == right` failed
  left: 1
 right: 50

failures:
    config::tests::parses_full_rust_config

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
