*** crates/slophammer-cli/src/config.rs:542:5: replace rust_dry_copied_blocks_enabled -> bool with true

*** mutation diff:
--- crates/slophammer-cli/src/config.rs
+++ replace rust_dry_copied_blocks_enabled -> bool with true
@@ -534,23 +534,17 @@
         .as_ref()
         .and_then(|rust| rust.dry.as_ref())
         .and_then(|dry| dry.copied_blocks.as_ref())
         .map(|copied_blocks| copied_blocks.min_tokens)
         .unwrap_or(100)
 }
 
 pub fn rust_dry_copied_blocks_enabled(config: &Config) -> bool {
-    config
-        .rust
-        .as_ref()
-        .and_then(|rust| rust.dry.as_ref())
-        .and_then(|dry| dry.copied_blocks.as_ref())
-        .map(|copied_blocks| copied_blocks.enabled)
-        .unwrap_or(true)
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]
     fn rejects_weak_rust_coverage() {

---- rust_rules::dry::tests::disabled_copied_blocks_suppresses_findings stdout ----

thread 'rust_rules::dry::tests::disabled_copied_blocks_suppresses_findings' (1885908) panicked at crates/slophammer-cli/src/rust_rules/dry.rs:125:9:
assertion failed: findings.is_empty()

failures:
    rust_rules::dry::tests::disabled_copied_blocks_suppresses_findings

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
