*** crates/slophammer-cli/src/config.rs:542:5: replace rust_dry_copied_blocks_enabled -> bool with false

*** mutation diff:
--- crates/slophammer-cli/src/config.rs
+++ replace rust_dry_copied_blocks_enabled -> bool with false
@@ -534,23 +534,17 @@
         .as_ref()
         .and_then(|rust| rust.dry.as_ref())
         .and_then(|dry| dry.copied_blocks.as_ref())
         .map(|copied_blocks| copied_blocks.min_tokens)
         .unwrap_or(100)
 }
 
 pub fn rust_dry_copied_blocks_enabled(config: &Config) -> bool {
-    config
-        .rust
-        .as_ref()
-        .and_then(|rust| rust.dry.as_ref())
-        .and_then(|dry| dry.copied_blocks.as_ref())
-        .map(|copied_blocks| copied_blocks.enabled)
-        .unwrap_or(true)
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]
     fn rejects_weak_rust_coverage() {

---- rust_rules::dry::tests::detects_same_file_copied_blocks stdout ----

thread 'rust_rules::dry::tests::detects_same_file_copied_blocks' (1886974) panicked at crates/slophammer-cli/src/rust_rules/dry.rs:148:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    rust_rules::dry::tests::detects_same_file_copied_blocks

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
