*** crates/slophammer-cli/src/config.rs:70:9: replace ExcludeEntry::pattern -> &str with ""

*** mutation diff:
--- crates/slophammer-cli/src/config.rs
+++ replace ExcludeEntry::pattern -> &str with ""
@@ -62,20 +62,17 @@
 #[serde(untagged)]
 pub enum ExcludeEntry {
     Pattern(String),
     Reasoned { pattern: String, reason: String },
 }
 
 impl ExcludeEntry {
     pub fn pattern(&self) -> &str {
-        match self {
-            Self::Pattern(pattern) => pattern,
-            Self::Reasoned { pattern, .. } => pattern,
-        }
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     fn needs_reason(&self) -> bool {
         matches!(self, Self::Pattern(pattern) if !conventional_exclude_pattern(pattern))
     }
 
     fn empty_reason(&self) -> bool {
         matches!(self, Self::Reasoned { reason, .. } if reason.trim().is_empty())

---- rust_rules::scope::tests::mutation_excludes_cover_out_of_scope_production_files stdout ----

thread 'rust_rules::scope::tests::mutation_excludes_cover_out_of_scope_production_files' (1813930) panicked at crates/slophammer-cli/src/rust_rules/scope.rs:239:9:
assertion failed: scope_findings(&repo, &covered).is_empty()

failures:
    rust_rules::scope::tests::mutation_excludes_cover_out_of_scope_production_files

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
