*** crates/slophammer-cli/src/config.rs:77:9: replace ExcludeEntry::needs_reason -> bool with true

*** mutation diff:
--- crates/slophammer-cli/src/config.rs
+++ replace ExcludeEntry::needs_reason -> bool with true
@@ -69,17 +69,17 @@
     pub fn pattern(&self) -> &str {
         match self {
             Self::Pattern(pattern) => pattern,
             Self::Reasoned { pattern, .. } => pattern,
         }
     }
 
     fn needs_reason(&self) -> bool {
-        matches!(self, Self::Pattern(pattern) if !conventional_exclude_pattern(pattern))
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     fn empty_reason(&self) -> bool {
         matches!(self, Self::Reasoned { reason, .. } if reason.trim().is_empty())
     }
 }
 
 /// The conventional non-production list from specs/CONFIG.md: patterns that

---- config::tests::parses_full_rust_config stdout ----

thread 'config::tests::parses_full_rust_config' (1816312) panicked at crates/slophammer-cli/src/config.rs:647:10:
config: Validation("rust.exclude requires a reason for production paths")

---- rust_rules::scope::tests::mutation_excludes_cover_out_of_scope_production_files stdout ----

thread 'rust_rules::scope::tests::mutation_excludes_cover_out_of_scope_production_files' (1816336) panicked at crates/slophammer-cli/src/rust_rules/scope.rs:223:36:
config parses: Validation("rust.mutation.exclude requires a reason for production paths")

failures:
    config::tests::parses_full_rust_config
    rust_rules::scope::tests::mutation_excludes_cover_out_of_scope_production_files

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
