*** crates/slophammer-cli/src/config.rs:81:9: replace ExcludeEntry::empty_reason -> bool with true

*** mutation diff:
--- crates/slophammer-cli/src/config.rs
+++ replace ExcludeEntry::empty_reason -> bool with true
@@ -73,17 +73,17 @@
         }
     }
 
     fn needs_reason(&self) -> bool {
         matches!(self, Self::Pattern(pattern) if !conventional_exclude_pattern(pattern))
     }
 
     fn empty_reason(&self) -> bool {
-        matches!(self, Self::Reasoned { reason, .. } if reason.trim().is_empty())
+        true /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// The conventional non-production list from specs/CONFIG.md: patterns that
 /// scope may exclude without a reason.
 pub fn conventional_exclude_pattern(pattern: &str) -> bool {
     const CONVENTIONAL: [&str; 15] = [
         "_test.",

---- config::tests::parses_full_rust_config stdout ----

thread 'config::tests::parses_full_rust_config' (1818620) panicked at crates/slophammer-cli/src/config.rs:647:10:
config: Validation("rust.exclude reasons must not be empty")

---- rust_rules::scope::tests::mutation_excludes_cover_out_of_scope_production_files stdout ----

thread 'rust_rules::scope::tests::mutation_excludes_cover_out_of_scope_production_files' (1818644) panicked at crates/slophammer-cli/src/rust_rules/scope.rs:223:36:
config parses: Validation("rust.mutation.exclude reasons must not be empty")

failures:
    config::tests::parses_full_rust_config
    rust_rules::scope::tests::mutation_excludes_cover_out_of_scope_production_files

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
