*** crates/slophammer-cli/src/config.rs:88:5: replace conventional_exclude_pattern -> bool with false

*** mutation diff:
--- crates/slophammer-cli/src/config.rs
+++ replace conventional_exclude_pattern -> bool with false
@@ -80,34 +80,17 @@
     fn empty_reason(&self) -> bool {
         matches!(self, Self::Reasoned { reason, .. } if reason.trim().is_empty())
     }
 }
 
 /// The conventional non-production list from specs/CONFIG.md: patterns that
 /// scope may exclude without a reason.
 pub fn conventional_exclude_pattern(pattern: &str) -> bool {
-    const CONVENTIONAL: [&str; 15] = [
-        "_test.",
-        ".test.",
-        ".spec.",
-        "tests/",
-        "fixtures/",
-        "templates/",
-        "testdata/",
-        "dist/",
-        "build/",
-        "coverage/",
-        "target/",
-        "node_modules/",
-        "vendor/",
-        "generated",
-        "scripts/",
-    ];
-    CONVENTIONAL.iter().any(|marker| pattern.contains(marker))
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 #[derive(Clone, Debug, Deserialize, Eq, PartialEq)]
 #[serde(deny_unknown_fields)]
 pub struct RustCoverage {
     pub threshold: u32,
     #[serde(default)]
     pub paths: Vec<String>,

---- config::tests::parses_full_rust_config stdout ----

thread 'config::tests::parses_full_rust_config' (1822046) panicked at crates/slophammer-cli/src/config.rs:630:10:
config: Validation("rust.exclude requires a reason for production paths")

failures:
    config::tests::parses_full_rust_config

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
