*** crates/slophammer-cli/src/core.rs:101:42: replace == with != in find_definition

*** mutation diff:
--- crates/slophammer-cli/src/core.rs
+++ replace == with != in find_definition
@@ -93,10 +93,10 @@
 }
 
 pub fn find_definition<'a>(
     definitions: &'a [RuleDefinition],
     rule_id: &str,
 ) -> Option<&'a RuleDefinition> {
     definitions
         .iter()
-        .find(|definition| definition.id == rule_id)
+        .find(|definition| definition.id != /* ~ changed by cargo-mutants ~ */ rule_id)
 }

---- app::tests::rules_and_explain_are_available stdout ----

thread 'app::tests::rules_and_explain_are_available' (1893162) panicked at crates/slophammer-cli/src/app.rs:425:9:
assertion failed: explanation.stdout.contains("Rust projects should declare cargo check")

---- app::tests::unknown_only_rule_is_error stdout ----

thread 'app::tests::unknown_only_rule_is_error' (1893164) panicked at crates/slophammer-cli/src/app.rs:307:9:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    app::tests::rules_and_explain_are_available
    app::tests::unknown_only_rule_is_error

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
