*** crates/slophammer-cli/src/core.rs:17:9: replace <impl fmt::Display for Severity>::fmt -> fmt::Result with Ok(Default::default())

*** mutation diff:
--- crates/slophammer-cli/src/core.rs
+++ replace <impl fmt::Display for Severity>::fmt -> fmt::Result with Ok(Default::default())
@@ -9,20 +9,17 @@
 #[serde(rename_all = "lowercase")]
 pub enum Severity {
     Error,
     Warn,
 }
 
 impl fmt::Display for Severity {
     fn fmt(&self, formatter: &mut fmt::Formatter<'_>) -> fmt::Result {
-        match self {
-            Self::Error => formatter.write_str("error"),
-            Self::Warn => formatter.write_str("warn"),
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Clone, Debug, Deserialize, Eq, PartialEq, Serialize)]
 pub struct Finding {
     pub rule_id: String,
     pub severity: Severity,
     pub path: String,

---- report::tests::writes_text_reports stdout ----

thread 'report::tests::writes_text_reports' (1887966) panicked at crates/slophammer-cli/src/report.rs:254:9:
assertion failed: text.contains("error rust.check-required .github/workflows: missing")

failures:
    report::tests::writes_text_reports

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
