*** crates/slophammer-cli/src/core.rs:59:13: delete field message from struct Self expression in Finding::with_message

*** mutation diff:
--- crates/slophammer-cli/src/core.rs
+++ delete field message from struct Self expression in Finding::with_message
@@ -51,17 +51,17 @@
 
     pub fn with_message(
         definition: &RuleDefinition,
         path: impl Into<String>,
         message: impl Into<String>,
     ) -> Self {
         Self {
             path: path.into(),
-            message: message.into(),
+             /* ~ changed by cargo-mutants ~ */
             ..Self::new(definition)
         }
     }
 }
 
 #[derive(Clone, Debug, Deserialize, Eq, PartialEq, Serialize)]
 pub struct Report {
     pub ok: bool,

---- rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked stdout ----

thread 'rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked' (1891102) panicked at crates/slophammer-cli/src/rust_rules/boundaries.rs:302:9:
assertion failed: findings[0].message.contains("crates/b")

---- rust_rules::suppressions::tests::bare_allow_in_production_code_is_a_finding stdout ----

thread 'rust_rules::suppressions::tests::bare_allow_in_production_code_is_a_finding' (1891113) panicked at crates/slophammer-cli/src/rust_rules/suppressions.rs:90:9:
assertion failed: findings[0].message.contains("line 1")

---- rust_rules::unsafe_policy::tests::allow_documented_requires_allow_entry stdout ----

thread 'rust_rules::unsafe_policy::tests::allow_documented_requires_allow_entry' (1891120) panicked at crates/slophammer-cli/src/rust_rules/unsafe_policy.rs:184:9:
assertion failed: findings[0].message.contains("documented")

failures:
    rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked
    rust_rules::suppressions::tests::bare_allow_in_production_code_is_a_finding
    rust_rules::unsafe_policy::tests::allow_documented_requires_allow_entry

test result: FAILED. 60 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
