*** crates/slophammer-cli/src/core.rs:99:5: replace find_definition -> Option<&'a RuleDefinition> with None

*** mutation diff:
--- crates/slophammer-cli/src/core.rs
+++ replace find_definition -> Option<&'a RuleDefinition> with None
@@ -91,12 +91,10 @@
     pub tool: Option<&'static str>,
     pub status: &'static str,
 }
 
 pub fn find_definition<'a>(
     definitions: &'a [RuleDefinition],
     rule_id: &str,
 ) -> Option<&'a RuleDefinition> {
-    definitions
-        .iter()
-        .find(|definition| definition.id == rule_id)
+    None /* ~ changed by cargo-mutants ~ */
 }

---- app::tests::rules_and_explain_are_available stdout ----

thread 'app::tests::rules_and_explain_are_available' (1892006) panicked at crates/slophammer-cli/src/app.rs:424:9:
assertion `left == right` failed
  left: 2
 right: 0

---- app::tests::check_applies_rule_severity_overrides stdout ----

thread 'app::tests::check_applies_rule_severity_overrides' (1892000) panicked at crates/slophammer-cli/src/app.rs:455:9:
assertion `left == right` failed
  left: 2
 right: 1

---- app::tests::only_rules_accept_comma_separated_ids stdout ----

thread 'app::tests::only_rules_accept_comma_separated_ids' (1892005) panicked at crates/slophammer-cli/src/app.rs:325:9:
assertion `left == right` failed: check failed: unknown rule: repo.readme-required, repo.agents-required

  left: 2
 right: 0

failures:
    app::tests::check_applies_rule_severity_overrides
    app::tests::only_rules_accept_comma_separated_ids
    app::tests::rules_and_explain_are_available

test result: FAILED. 60 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
