*** crates/slophammer-cli/src/exec.rs:112:33: delete ! in execute_workspace

*** mutation diff:
--- crates/slophammer-cli/src/exec.rs
+++ delete ! in execute_workspace
@@ -104,17 +104,17 @@
             args: vec!["audit"],
             message: "cargo audit failed",
         },
     ];
     if config
         .rust
         .as_ref()
         .and_then(|rust| rust.mutation.as_ref())
-        .is_some_and(|mutation| !mutation.targets.is_empty())
+        .is_some_and(|mutation|  /* ~ changed by cargo-mutants ~ */mutation.targets.is_empty())
     {
         checks.push(ExecutableCheck {
             rule_id: "rust.mutation-required",
             path: ".github/workflows",
             command: "cargo",
             args: vec!["mutants", "--workspace"],
             message: "cargo mutants failed",
         });

*** result: Success
