*** crates/slophammer-cli/src/exec.rs:125:38: replace || with && in execute_workspace

*** mutation diff:
--- crates/slophammer-cli/src/exec.rs
+++ replace || with && in execute_workspace
@@ -117,17 +117,17 @@
             command: "cargo",
             args: vec!["mutants", "--workspace"],
             message: "cargo mutants failed",
         });
     }
     checks
         .into_iter()
         .filter(|check| {
-            only_rule_ids.is_empty() || only_rule_ids.iter().any(|id| id == check.rule_id)
+            only_rule_ids.is_empty() && /* ~ changed by cargo-mutants ~ */ only_rule_ids.iter().any(|id| id == check.rule_id)
         })
         .filter_map(|check| run_check(&cwd, &workspace_root, runner, check))
         .collect()
 }
 
 fn run_check(
     cwd: &Path,
     workspace_root: &str,

---- exec::tests::only_rule_filter_limits_execute_checks stdout ----

thread 'exec::tests::only_rule_filter_limits_execute_checks' (1897722) panicked at crates/slophammer-cli/src/exec.rs:306:9:
assertion `left == right` failed
  left: 0
 right: 1

---- exec::tests::execute_failures_become_findings stdout ----

thread 'exec::tests::execute_failures_become_findings' (1897721) panicked at crates/slophammer-cli/src/exec.rs:265:9:
assertion failed: findings.iter().any(|finding| finding.rule_id == "rust.test-required")

failures:
    exec::tests::execute_failures_become_findings
    exec::tests::only_rule_filter_limits_execute_checks

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
