*** crates/slophammer-cli/src/exec.rs:125:74: replace == with != in execute_workspace

*** mutation diff:
--- crates/slophammer-cli/src/exec.rs
+++ replace == with != in execute_workspace
@@ -117,17 +117,17 @@
             command: "cargo",
             args: vec!["mutants", "--workspace"],
             message: "cargo mutants failed",
         });
     }
     checks
         .into_iter()
         .filter(|check| {
-            only_rule_ids.is_empty() || only_rule_ids.iter().any(|id| id == check.rule_id)
+            only_rule_ids.is_empty() || only_rule_ids.iter().any(|id| id != /* ~ changed by cargo-mutants ~ */ check.rule_id)
         })
         .filter_map(|check| run_check(&cwd, &workspace_root, runner, check))
         .collect()
 }
 
 fn run_check(
     cwd: &Path,
     workspace_root: &str,

---- exec::tests::only_rule_filter_limits_execute_checks stdout ----

thread 'exec::tests::only_rule_filter_limits_execute_checks' (1898815) panicked at crates/slophammer-cli/src/exec.rs:306:9:
assertion `left == right` failed
  left: 4
 right: 1

failures:
    exec::tests::only_rule_filter_limits_execute_checks

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
