*** crates/slophammer-cli/src/exec.rs:137:5: replace run_check -> Option<Finding> with None

*** mutation diff:
--- crates/slophammer-cli/src/exec.rs
+++ replace run_check -> Option<Finding> with None
@@ -129,33 +129,17 @@
 }
 
 fn run_check(
     cwd: &Path,
     workspace_root: &str,
     runner: &impl Runner,
     check: ExecutableCheck<'_>,
 ) -> Option<Finding> {
-    match runner.run(cwd, check.command, &check.args) {
-        Ok(output) if output.status == 0 => None,
-        Ok(output) => Some(Finding {
-            rule_id: check.rule_id.to_owned(),
-            severity: Severity::Error,
-            path: prefixed_path(workspace_root, check.path),
-            message: format!("{}: {}", check.message, compact_output(&output)),
-            baselined: None,
-        }),
-        Err(error) => Some(Finding {
-            rule_id: check.rule_id.to_owned(),
-            severity: Severity::Error,
-            path: prefixed_path(workspace_root, check.path),
-            message: format!("{}: {error}", check.message),
-            baselined: None,
-        }),
-    }
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn compact_output(output: &CommandOutput) -> String {
     let combined = format!("{}{}", output.stderr, output.stdout);
     combined
         .lines()
         .map(str::trim)
         .find(|line| !line.is_empty())

---- exec::tests::execute_failures_become_findings stdout ----

thread 'exec::tests::execute_failures_become_findings' (1899835) panicked at crates/slophammer-cli/src/exec.rs:249:9:
assertion failed: findings.iter().any(|finding| finding.rule_id == "rust.test-required")

---- exec::tests::only_rule_filter_limits_execute_checks stdout ----

thread 'exec::tests::only_rule_filter_limits_execute_checks' (1899836) panicked at crates/slophammer-cli/src/exec.rs:290:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    exec::tests::execute_failures_become_findings
    exec::tests::only_rule_filter_limits_execute_checks

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
