*** crates/slophammer-cli/src/exec.rs:138:23: replace match guard output.status == 0 with true in run_check

*** mutation diff:
--- crates/slophammer-cli/src/exec.rs
+++ replace match guard output.status == 0 with true in run_check
@@ -130,17 +130,17 @@
 
 fn run_check(
     cwd: &Path,
     workspace_root: &str,
     runner: &impl Runner,
     check: ExecutableCheck<'_>,
 ) -> Option<Finding> {
     match runner.run(cwd, check.command, &check.args) {
-        Ok(output) if output.status == 0 => None,
+        Ok(output) if true /* ~ changed by cargo-mutants ~ */ => None,
         Ok(output) => Some(Finding {
             rule_id: check.rule_id.to_owned(),
             severity: Severity::Error,
             path: prefixed_path(workspace_root, check.path),
             message: format!("{}: {}", check.message, compact_output(&output)),
             baselined: None,
         }),
         Err(error) => Some(Finding {

---- exec::tests::only_rule_filter_limits_execute_checks stdout ----

thread 'exec::tests::only_rule_filter_limits_execute_checks' (1901099) panicked at crates/slophammer-cli/src/exec.rs:306:9:
assertion `left == right` failed
  left: 0
 right: 1

---- exec::tests::execute_failures_become_findings stdout ----

thread 'exec::tests::execute_failures_become_findings' (1901098) panicked at crates/slophammer-cli/src/exec.rs:265:9:
assertion failed: findings.iter().any(|finding| finding.rule_id == "rust.test-required")

failures:
    exec::tests::execute_failures_become_findings
    exec::tests::only_rule_filter_limits_execute_checks

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
