*** crates/slophammer-cli/src/exec.rs:138:23: replace match guard output.status == 0 with false in run_check

*** mutation diff:
--- crates/slophammer-cli/src/exec.rs
+++ replace match guard output.status == 0 with false in run_check
@@ -130,17 +130,17 @@
 
 fn run_check(
     cwd: &Path,
     workspace_root: &str,
     runner: &impl Runner,
     check: ExecutableCheck<'_>,
 ) -> Option<Finding> {
     match runner.run(cwd, check.command, &check.args) {
-        Ok(output) if output.status == 0 => None,
+        Ok(output) if false /* ~ changed by cargo-mutants ~ */ => None,
         Ok(output) => Some(Finding {
             rule_id: check.rule_id.to_owned(),
             severity: Severity::Error,
             path: prefixed_path(workspace_root, check.path),
             message: format!("{}: {}", check.message, compact_output(&output)),
             baselined: None,
         }),
         Err(error) => Some(Finding {

---- exec::tests::passing_execute_checks_are_clean stdout ----

thread 'exec::tests::passing_execute_checks_are_clean' (1902136) panicked at crates/slophammer-cli/src/exec.rs:285:9:
assertion failed: findings.is_empty()

failures:
    exec::tests::passing_execute_checks_are_clean

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
