*** crates/slophammer-cli/src/exec.rs:157:5: replace compact_output -> String with "xyzzy".into()

*** mutation diff:
--- crates/slophammer-cli/src/exec.rs
+++ replace compact_output -> String with "xyzzy".into()
@@ -149,25 +149,17 @@
             path: prefixed_path(workspace_root, check.path),
             message: format!("{}: {error}", check.message),
             baselined: None,
         }),
     }
 }
 
 fn compact_output(output: &CommandOutput) -> String {
-    let combined = format!("{}{}", output.stderr, output.stdout);
-    combined
-        .lines()
-        .map(str::trim)
-        .find(|line| !line.is_empty())
-        .unwrap_or("command exited non-zero")
-        .chars()
-        .take(240)
-        .collect()
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 fn rust_workspace_roots(snapshot: &Snapshot) -> Vec<String> {
     let mut roots: Vec<String> = snapshot
         .files
         .keys()
         .filter(|path| path.ends_with("Cargo.toml"))
         .filter(|path| !path.starts_with("fixtures/") && !path.starts_with("templates/"))

*** result: Success
