*** crates/slophammer-cli/src/exec.rs:169:5: replace rust_workspace_roots -> Vec<String> with vec![]

*** mutation diff:
--- crates/slophammer-cli/src/exec.rs
+++ replace rust_workspace_roots -> Vec<String> with vec![]
@@ -161,33 +161,17 @@
         .find(|line| !line.is_empty())
         .unwrap_or("command exited non-zero")
         .chars()
         .take(240)
         .collect()
 }
 
 fn rust_workspace_roots(snapshot: &Snapshot) -> Vec<String> {
-    let mut roots: Vec<String> = snapshot
-        .files
-        .keys()
-        .filter(|path| path.ends_with("Cargo.toml"))
-        .filter(|path| !path.starts_with("fixtures/") && !path.starts_with("templates/"))
-        .filter_map(|path| {
-            path.strip_suffix("/Cargo.toml")
-                .or_else(|| (path == "Cargo.toml").then_some(""))
-        })
-        .map(str::to_owned)
-        .collect();
-    roots.sort();
-    roots
-        .iter()
-        .filter(|root| !has_parent_root(root, &roots))
-        .cloned()
-        .collect()
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 fn has_parent_root(root: &str, roots: &[String]) -> bool {
     !root.is_empty()
         && roots.iter().any(|candidate| {
             candidate != root
                 && (candidate.is_empty() || root.starts_with(&format!("{candidate}/")))
         })

---- exec::tests::execute_failures_become_findings stdout ----

thread 'exec::tests::execute_failures_become_findings' (1907570) panicked at crates/slophammer-cli/src/exec.rs:249:9:
assertion failed: findings.iter().any(|finding| finding.rule_id == "rust.test-required")

---- exec::tests::only_rule_filter_limits_execute_checks stdout ----

thread 'exec::tests::only_rule_filter_limits_execute_checks' (1907571) panicked at crates/slophammer-cli/src/exec.rs:290:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    exec::tests::execute_failures_become_findings
    exec::tests::only_rule_filter_limits_execute_checks

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
