*** crates/slophammer-cli/src/exec.rs:173:24: delete ! in rust_workspace_roots

*** mutation diff:
--- crates/slophammer-cli/src/exec.rs
+++ delete ! in rust_workspace_roots
@@ -165,17 +165,17 @@
         .collect()
 }
 
 fn rust_workspace_roots(snapshot: &Snapshot) -> Vec<String> {
     let mut roots: Vec<String> = snapshot
         .files
         .keys()
         .filter(|path| path.ends_with("Cargo.toml"))
-        .filter(|path| !path.starts_with("fixtures/") && !path.starts_with("templates/"))
+        .filter(|path|  /* ~ changed by cargo-mutants ~ */path.starts_with("fixtures/") && !path.starts_with("templates/"))
         .filter_map(|path| {
             path.strip_suffix("/Cargo.toml")
                 .or_else(|| (path == "Cargo.toml").then_some(""))
         })
         .map(str::to_owned)
         .collect();
     roots.sort();
     roots

---- exec::tests::execute_failures_become_findings stdout ----

thread 'exec::tests::execute_failures_become_findings' (1911700) panicked at crates/slophammer-cli/src/exec.rs:265:9:
assertion failed: findings.iter().any(|finding| finding.rule_id == "rust.test-required")

---- exec::tests::only_rule_filter_limits_execute_checks stdout ----

thread 'exec::tests::only_rule_filter_limits_execute_checks' (1911701) panicked at crates/slophammer-cli/src/exec.rs:306:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    exec::tests::execute_failures_become_findings
    exec::tests::only_rule_filter_limits_execute_checks

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
