*** crates/slophammer-cli/src/exec.rs:173:55: replace && with || in rust_workspace_roots

*** mutation diff:
--- crates/slophammer-cli/src/exec.rs
+++ replace && with || in rust_workspace_roots
@@ -165,17 +165,17 @@
         .collect()
 }
 
 fn rust_workspace_roots(snapshot: &Snapshot) -> Vec<String> {
     let mut roots: Vec<String> = snapshot
         .files
         .keys()
         .filter(|path| path.ends_with("Cargo.toml"))
-        .filter(|path| !path.starts_with("fixtures/") && !path.starts_with("templates/"))
+        .filter(|path| !path.starts_with("fixtures/") || /* ~ changed by cargo-mutants ~ */ !path.starts_with("templates/"))
         .filter_map(|path| {
             path.strip_suffix("/Cargo.toml")
                 .or_else(|| (path == "Cargo.toml").then_some(""))
         })
         .map(str::to_owned)
         .collect();
     roots.sort();
     roots

*** result: Success
