*** crates/slophammer-cli/src/exec.rs:176:35: replace == with != in rust_workspace_roots

*** mutation diff:
--- crates/slophammer-cli/src/exec.rs
+++ replace == with != in rust_workspace_roots
@@ -168,17 +168,17 @@
 fn rust_workspace_roots(snapshot: &Snapshot) -> Vec<String> {
     let mut roots: Vec<String> = snapshot
         .files
         .keys()
         .filter(|path| path.ends_with("Cargo.toml"))
         .filter(|path| !path.starts_with("fixtures/") && !path.starts_with("templates/"))
         .filter_map(|path| {
             path.strip_suffix("/Cargo.toml")
-                .or_else(|| (path == "Cargo.toml").then_some(""))
+                .or_else(|| (path != /* ~ changed by cargo-mutants ~ */ "Cargo.toml").then_some(""))
         })
         .map(str::to_owned)
         .collect();
     roots.sort();
     roots
         .iter()
         .filter(|root| !has_parent_root(root, &roots))
         .cloned()

---- exec::tests::execute_failures_become_findings stdout ----

thread 'exec::tests::execute_failures_become_findings' (1913697) panicked at crates/slophammer-cli/src/exec.rs:265:9:
assertion failed: findings.iter().any(|finding| finding.rule_id == "rust.test-required")

---- exec::tests::only_rule_filter_limits_execute_checks stdout ----

thread 'exec::tests::only_rule_filter_limits_execute_checks' (1913698) panicked at crates/slophammer-cli/src/exec.rs:306:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    exec::tests::execute_failures_become_findings
    exec::tests::only_rule_filter_limits_execute_checks

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
