*** crates/slophammer-cli/src/exec.rs:183:24: delete ! in rust_workspace_roots

*** mutation diff:
--- crates/slophammer-cli/src/exec.rs
+++ delete ! in rust_workspace_roots
@@ -175,17 +175,17 @@
             path.strip_suffix("/Cargo.toml")
                 .or_else(|| (path == "Cargo.toml").then_some(""))
         })
         .map(str::to_owned)
         .collect();
     roots.sort();
     roots
         .iter()
-        .filter(|root| !has_parent_root(root, &roots))
+        .filter(|root|  /* ~ changed by cargo-mutants ~ */has_parent_root(root, &roots))
         .cloned()
         .collect()
 }
 
 fn has_parent_root(root: &str, roots: &[String]) -> bool {
     !root.is_empty()
         && roots.iter().any(|candidate| {
             candidate != root

---- exec::tests::execute_failures_become_findings stdout ----

thread 'exec::tests::execute_failures_become_findings' (1914542) panicked at crates/slophammer-cli/src/exec.rs:265:9:
assertion failed: findings.iter().any(|finding| finding.rule_id == "rust.test-required")

---- exec::tests::only_rule_filter_limits_execute_checks stdout ----

thread 'exec::tests::only_rule_filter_limits_execute_checks' (1914543) panicked at crates/slophammer-cli/src/exec.rs:306:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    exec::tests::execute_failures_become_findings
    exec::tests::only_rule_filter_limits_execute_checks

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
