*** crates/slophammer-cli/src/exec.rs:189:5: replace has_parent_root -> bool with true

*** mutation diff:
--- crates/slophammer-cli/src/exec.rs
+++ replace has_parent_root -> bool with true
@@ -181,21 +181,17 @@
     roots
         .iter()
         .filter(|root| !has_parent_root(root, &roots))
         .cloned()
         .collect()
 }
 
 fn has_parent_root(root: &str, roots: &[String]) -> bool {
-    !root.is_empty()
-        && roots.iter().any(|candidate| {
-            candidate != root
-                && (candidate.is_empty() || root.starts_with(&format!("{candidate}/")))
-        })
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 fn prefixed_path(root: &str, path: &str) -> String {
     if root.is_empty() {
         path.to_owned()
     } else {
         format!("{root}/{path}")
     }

---- exec::tests::only_rule_filter_limits_execute_checks stdout ----

thread 'exec::tests::only_rule_filter_limits_execute_checks' (1915697) panicked at crates/slophammer-cli/src/exec.rs:302:9:
assertion `left == right` failed
  left: 0
 right: 1

---- exec::tests::execute_failures_become_findings stdout ----

thread 'exec::tests::execute_failures_become_findings' (1915696) panicked at crates/slophammer-cli/src/exec.rs:261:9:
assertion failed: findings.iter().any(|finding| finding.rule_id == "rust.test-required")

failures:
    exec::tests::execute_failures_become_findings
    exec::tests::only_rule_filter_limits_execute_checks

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
