*** crates/slophammer-cli/src/exec.rs:189:5: delete ! in has_parent_root

*** mutation diff:
--- crates/slophammer-cli/src/exec.rs
+++ delete ! in has_parent_root
@@ -181,17 +181,17 @@
     roots
         .iter()
         .filter(|root| !has_parent_root(root, &roots))
         .cloned()
         .collect()
 }
 
 fn has_parent_root(root: &str, roots: &[String]) -> bool {
-    !root.is_empty()
+     /* ~ changed by cargo-mutants ~ */root.is_empty()
         && roots.iter().any(|candidate| {
             candidate != root
                 && (candidate.is_empty() || root.starts_with(&format!("{candidate}/")))
         })
 }
 
 fn prefixed_path(root: &str, path: &str) -> String {
     if root.is_empty() {

*** result: Success
