*** crates/slophammer-cli/src/exec.rs:191:23: replace != with == in has_parent_root

*** mutation diff:
--- crates/slophammer-cli/src/exec.rs
+++ replace != with == in has_parent_root
@@ -183,17 +183,17 @@
         .filter(|root| !has_parent_root(root, &roots))
         .cloned()
         .collect()
 }
 
 fn has_parent_root(root: &str, roots: &[String]) -> bool {
     !root.is_empty()
         && roots.iter().any(|candidate| {
-            candidate != root
+            candidate == /* ~ changed by cargo-mutants ~ */ root
                 && (candidate.is_empty() || root.starts_with(&format!("{candidate}/")))
         })
 }
 
 fn prefixed_path(root: &str, path: &str) -> String {
     if root.is_empty() {
         path.to_owned()
     } else {

*** result: Success
