*** crates/slophammer-cli/src/exec.rs:192:17: replace && with || in has_parent_root

*** mutation diff:
--- crates/slophammer-cli/src/exec.rs
+++ replace && with || in has_parent_root
@@ -184,17 +184,17 @@
         .cloned()
         .collect()
 }
 
 fn has_parent_root(root: &str, roots: &[String]) -> bool {
     !root.is_empty()
         && roots.iter().any(|candidate| {
             candidate != root
-                && (candidate.is_empty() || root.starts_with(&format!("{candidate}/")))
+                || /* ~ changed by cargo-mutants ~ */ (candidate.is_empty() || root.starts_with(&format!("{candidate}/")))
         })
 }
 
 fn prefixed_path(root: &str, path: &str) -> String {
     if root.is_empty() {
         path.to_owned()
     } else {
         format!("{root}/{path}")

*** result: Success
