*** crates/slophammer-cli/src/exec.rs:49:5: replace execute_rust_checks -> Vec<Finding> with vec![]

*** mutation diff:
--- crates/slophammer-cli/src/exec.rs
+++ replace execute_rust_checks -> Vec<Finding> with vec![]
@@ -41,20 +41,17 @@
 }
 
 pub fn execute_rust_checks(
     snapshot: &Snapshot,
     config: &Config,
     only_rule_ids: &[String],
     runner: &impl Runner,
 ) -> Vec<Finding> {
-    rust_workspace_roots(snapshot)
-        .into_iter()
-        .flat_map(|root| execute_workspace(snapshot, config, only_rule_ids, runner, root))
-        .collect()
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 fn execute_workspace(
     snapshot: &Snapshot,
     config: &Config,
     only_rule_ids: &[String],
     runner: &impl Runner,
     workspace_root: String,

---- exec::tests::execute_failures_become_findings stdout ----

thread 'exec::tests::execute_failures_become_findings' (1894303) panicked at crates/slophammer-cli/src/exec.rs:262:9:
assertion failed: findings.iter().any(|finding| finding.rule_id == "rust.test-required")

---- exec::tests::only_rule_filter_limits_execute_checks stdout ----

thread 'exec::tests::only_rule_filter_limits_execute_checks' (1894304) panicked at crates/slophammer-cli/src/exec.rs:303:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    exec::tests::execute_failures_become_findings
    exec::tests::only_rule_filter_limits_execute_checks

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
