*** crates/slophammer-cli/src/exec.rs:62:5: replace execute_workspace -> Vec<Finding> with vec![]

*** mutation diff:
--- crates/slophammer-cli/src/exec.rs
+++ replace execute_workspace -> Vec<Finding> with vec![]
@@ -54,83 +54,17 @@
 
 fn execute_workspace(
     snapshot: &Snapshot,
     config: &Config,
     only_rule_ids: &[String],
     runner: &impl Runner,
     workspace_root: String,
 ) -> Vec<Finding> {
-    let cwd = snapshot.root.join(&workspace_root);
-    let threshold = crate::config::rust_coverage_threshold(config).to_string();
-    let mut checks = vec![
-        ExecutableCheck {
-            rule_id: "rust.fmt-required",
-            path: ".github/workflows",
-            command: "cargo",
-            args: vec!["fmt", "--check"],
-            message: "cargo fmt --check failed",
-        },
-        ExecutableCheck {
-            rule_id: "rust.clippy-required",
-            path: ".github/workflows",
-            command: "cargo",
-            args: vec![
-                "clippy",
-                "--workspace",
-                "--all-targets",
-                "--",
-                "-D",
-                "warnings",
-            ],
-            message: "cargo clippy failed",
-        },
-        ExecutableCheck {
-            rule_id: "rust.test-required",
-            path: ".github/workflows",
-            command: "cargo",
-            args: vec!["test", "--workspace", "--all-targets"],
-            message: "cargo test failed",
-        },
-        ExecutableCheck {
-            rule_id: "rust.coverage-required",
-            path: ".github/workflows",
-            command: "cargo",
-            args: vec!["llvm-cov", "--workspace", "--fail-under-lines", &threshold],
-            message: "cargo llvm-cov failed",
-        },
-        ExecutableCheck {
-            rule_id: "rust.dependency-audit-required",
-            path: ".github/workflows",
-            command: "cargo",
-            args: vec!["audit"],
-            message: "cargo audit failed",
-        },
-    ];
-    if config
-        .rust
-        .as_ref()
-        .and_then(|rust| rust.mutation.as_ref())
-        .is_some_and(|mutation| !mutation.targets.is_empty())
-    {
-        checks.push(ExecutableCheck {
-            rule_id: "rust.mutation-required",
-            path: ".github/workflows",
-            command: "cargo",
-            args: vec!["mutants", "--workspace"],
-            message: "cargo mutants failed",
-        });
-    }
-    checks
-        .into_iter()
-        .filter(|check| {
-            only_rule_ids.is_empty() || only_rule_ids.iter().any(|id| id == check.rule_id)
-        })
-        .filter_map(|check| run_check(&cwd, &workspace_root, runner, check))
-        .collect()
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 fn run_check(
     cwd: &Path,
     workspace_root: &str,
     runner: &impl Runner,
     check: ExecutableCheck<'_>,
 ) -> Option<Finding> {

---- exec::tests::execute_failures_become_findings stdout ----

thread 'exec::tests::execute_failures_become_findings' (1895441) panicked at crates/slophammer-cli/src/exec.rs:199:9:
assertion failed: findings.iter().any(|finding| finding.rule_id == "rust.test-required")

---- exec::tests::only_rule_filter_limits_execute_checks stdout ----

thread 'exec::tests::only_rule_filter_limits_execute_checks' (1895442) panicked at crates/slophammer-cli/src/exec.rs:240:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    exec::tests::execute_failures_become_findings
    exec::tests::only_rule_filter_limits_execute_checks

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
