*** crates/slophammer-cli/src/main.rs:121:5: replace baseline_mode -> baseline::BaselineMode with Default::default()

*** mutation diff:
--- crates/slophammer-cli/src/main.rs
+++ replace baseline_mode -> baseline::BaselineMode with Default::default()
@@ -113,23 +113,17 @@
             root: path,
             format: format.into(),
             max_findings: None,
         }),
     }
 }
 
 fn baseline_mode(baseline: bool, baseline_write: bool) -> baseline::BaselineMode {
-    if baseline_write {
-        baseline::BaselineMode::Write
-    } else if baseline {
-        baseline::BaselineMode::Check
-    } else {
-        baseline::BaselineMode::Off
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 fn exit(result: AppResult) -> ExitCode {
     let mut stdout = io::stdout();
     let mut stderr = io::stderr();
     let _ = stdout.write_all(result.stdout.as_bytes());
     let _ = stderr.write_all(result.stderr.as_bytes());
     ExitCode::from(u8::try_from(result.code).unwrap_or(2))

*** result: Success
