*** crates/slophammer-cli/src/main.rs:131:5: replace exit -> ExitCode with Default::default()

*** mutation diff:
--- crates/slophammer-cli/src/main.rs
+++ replace exit -> ExitCode with Default::default()
@@ -123,21 +123,17 @@
     } else if baseline {
         baseline::BaselineMode::Check
     } else {
         baseline::BaselineMode::Off
     }
 }
 
 fn exit(result: AppResult) -> ExitCode {
-    let mut stdout = io::stdout();
-    let mut stderr = io::stderr();
-    let _ = stdout.write_all(result.stdout.as_bytes());
-    let _ = stderr.write_all(result.stderr.as_bytes());
-    ExitCode::from(u8::try_from(result.code).unwrap_or(2))
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 impl From<FormatArg> for OutputFormat {
     fn from(value: FormatArg) -> Self {
         match value {
             FormatArg::Text => Self::Text,
             FormatArg::Json => Self::Json,
             FormatArg::Sarif => Self::Sarif,

---- cli_exposes_direct_commands_and_rules stdout ----

thread 'cli_exposes_direct_commands_and_rules' (1776004) panicked at crates/slophammer-cli/tests/cli.rs:63:5:
assertion failed: stdout(&rules).contains("rust.check-required")

---- cli_checks_clean_fixture stdout ----

thread 'cli_checks_clean_fixture' (1776003) panicked at crates/slophammer-cli/tests/cli.rs:29:5:
assertion failed: stdout(&output).contains("\"ok\": true")

---- cli_reports_config_errors stdout ----

thread 'cli_reports_config_errors' (1776006) panicked at crates/slophammer-cli/tests/cli.rs:52:5:
assertion `left == right` failed
  left: Some(0)
 right: Some(2)

failures:
    cli_checks_clean_fixture
    cli_exposes_direct_commands_and_rules
    cli_reports_config_errors
    cli_reports_findings_exit_code

test result: FAILED. 1 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
