*** crates/slophammer-cli/src/main.rs:76:5: replace main -> ExitCode with Default::default()

*** mutation diff:
--- crates/slophammer-cli/src/main.rs
+++ replace main -> ExitCode with Default::default()
@@ -68,18 +68,17 @@
 #[derive(Clone, Copy, Debug, ValueEnum)]
 enum FormatArg {
     Text,
     Json,
     Sarif,
 }
 
 fn main() -> ExitCode {
-    let cli = Cli::parse();
-    exit(run(cli.command))
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 fn run(command: Command) -> AppResult {
     match command {
         Command::Check {
             path,
             format,
             execute,

---- cli_exposes_direct_commands_and_rules stdout ----

thread 'cli_exposes_direct_commands_and_rules' (1773477) panicked at crates/slophammer-cli/tests/cli.rs:63:5:
assertion failed: stdout(&rules).contains("rust.check-required")

---- cli_exposes_version stdout ----

thread 'cli_exposes_version' (1773478) panicked at crates/slophammer-cli/tests/cli.rs:14:5:
assertion `left == right` failed
  left: ""
 right: "slophammer-rs 0.3.0"

---- cli_checks_clean_fixture stdout ----

thread 'cli_checks_clean_fixture' (1773475) panicked at crates/slophammer-cli/tests/cli.rs:29:5:
assertion failed: stdout(&output).contains("\"ok\": true")

failures:
    cli_checks_clean_fixture
    cli_exposes_direct_commands_and_rules
    cli_exposes_version
    cli_reports_config_errors
    cli_reports_findings_exit_code

test result: FAILED. 0 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
