*** crates/slophammer-cli/src/report.rs:158:5: replace sarif_rules -> Vec<SarifRule> with vec![]

*** mutation diff:
--- crates/slophammer-cli/src/report.rs
+++ replace sarif_rules -> Vec<SarifRule> with vec![]
@@ -150,29 +150,17 @@
                 },
             },
             results: sarif_results(&report.findings),
         }],
     }
 }
 
 fn sarif_rules(findings: &[Finding]) -> Vec<SarifRule> {
-    let mut seen = std::collections::BTreeSet::new();
-    let mut rules = Vec::new();
-    for finding in findings {
-        if seen.insert(finding.rule_id.clone()) {
-            rules.push(SarifRule {
-                id: finding.rule_id.clone(),
-                short_description: SarifMessage {
-                    text: finding.message.clone(),
-                },
-            });
-        }
-    }
-    rules
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 fn sarif_results(findings: &[Finding]) -> Vec<SarifResult> {
     findings
         .iter()
         .map(|finding| SarifResult {
             rule_id: finding.rule_id.clone(),
             level: sarif_level(finding.severity),

*** result: Success
