*** crates/slophammer-cli/src/report.rs:174:5: replace sarif_results -> Vec<SarifResult> with vec![]

*** mutation diff:
--- crates/slophammer-cli/src/report.rs
+++ replace sarif_results -> Vec<SarifResult> with vec![]
@@ -166,28 +166,17 @@
                 },
             });
         }
     }
     rules
 }
 
 fn sarif_results(findings: &[Finding]) -> Vec<SarifResult> {
-    findings
-        .iter()
-        .map(|finding| SarifResult {
-            rule_id: finding.rule_id.clone(),
-            level: sarif_level(finding.severity),
-            message: SarifMessage {
-                text: finding.message.clone(),
-            },
-            locations: sarif_locations(&finding.path),
-            suppressions: sarif_suppressions(finding),
-        })
-        .collect()
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 fn sarif_suppressions(finding: &Finding) -> Vec<SarifSuppression> {
     if finding.baselined == Some(true) {
         vec![SarifSuppression { kind: "external" }]
     } else {
         Vec::new()
     }

---- report::tests::writes_sarif_reports stdout ----

thread 'report::tests::writes_sarif_reports' (1935136) panicked at crates/slophammer-cli/src/report.rs:281:9:
assertion failed: sarif.contains("\"level\": \"warning\"")

failures:
    report::tests::writes_sarif_reports

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
