*** crates/slophammer-cli/src/report.rs:189:5: replace sarif_suppressions -> Vec<SarifSuppression> with vec![]

*** mutation diff:
--- crates/slophammer-cli/src/report.rs
+++ replace sarif_suppressions -> Vec<SarifSuppression> with vec![]
@@ -181,21 +181,17 @@
             },
             locations: sarif_locations(&finding.path),
             suppressions: sarif_suppressions(finding),
         })
         .collect()
 }
 
 fn sarif_suppressions(finding: &Finding) -> Vec<SarifSuppression> {
-    if finding.baselined == Some(true) {
-        vec![SarifSuppression { kind: "external" }]
-    } else {
-        Vec::new()
-    }
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 fn sarif_level(severity: Severity) -> &'static str {
     match severity {
         Severity::Warn => "warning",
         Severity::Error => "error",
     }
 }

*** result: Success
