*** crates/slophammer-cli/src/report.rs:197:5: replace sarif_level -> &'static str with ""

*** mutation diff:
--- crates/slophammer-cli/src/report.rs
+++ replace sarif_level -> &'static str with ""
@@ -189,20 +189,17 @@
     if finding.baselined == Some(true) {
         vec![SarifSuppression { kind: "external" }]
     } else {
         Vec::new()
     }
 }
 
 fn sarif_level(severity: Severity) -> &'static str {
-    match severity {
-        Severity::Warn => "warning",
-        Severity::Error => "error",
-    }
+    "" /* ~ changed by cargo-mutants ~ */
 }
 
 fn sarif_locations(path: &str) -> Vec<SarifLocation> {
     if path.is_empty() {
         return Vec::new();
     }
     vec![SarifLocation {
         physical_location: SarifPhysicalLocation {

---- report::tests::writes_sarif_reports stdout ----

thread 'report::tests::writes_sarif_reports' (1938341) panicked at crates/slophammer-cli/src/report.rs:289:9:
assertion failed: sarif.contains("\"level\": \"warning\"")

failures:
    report::tests::writes_sarif_reports

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
