*** crates/slophammer-cli/src/report.rs:204:5: replace sarif_locations -> Vec<SarifLocation> with vec![]

*** mutation diff:
--- crates/slophammer-cli/src/report.rs
+++ replace sarif_locations -> Vec<SarifLocation> with vec![]
@@ -196,27 +196,17 @@
 fn sarif_level(severity: Severity) -> &'static str {
     match severity {
         Severity::Warn => "warning",
         Severity::Error => "error",
     }
 }
 
 fn sarif_locations(path: &str) -> Vec<SarifLocation> {
-    if path.is_empty() {
-        return Vec::new();
-    }
-    vec![SarifLocation {
-        physical_location: SarifPhysicalLocation {
-            artifact_location: SarifArtifactLocation {
-                uri: path.to_owned(),
-            },
-            region: SarifRegion { start_line: 1 },
-        },
-    }]
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use crate::core::{Finding, Severity};
 
     #[test]

---- report::tests::writes_sarif_reports stdout ----

thread 'report::tests::writes_sarif_reports' (1940312) panicked at crates/slophammer-cli/src/report.rs:283:9:
assertion failed: sarif.contains("\"uri\": \".github/workflows\"")

failures:
    report::tests::writes_sarif_reports

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
