*** crates/slophammer-cli/src/report.rs:26:5: replace write_json -> Result<String, ReportError> with Ok(String::new())

*** mutation diff:
--- crates/slophammer-cli/src/report.rs
+++ replace write_json -> Result<String, ReportError> with Ok(String::new())
@@ -18,17 +18,17 @@
     Report {
         ok: findings.is_empty(),
         findings,
         scope: None,
     }
 }
 
 pub fn write_json(report: &Report) -> Result<String, ReportError> {
-    Ok(format!("{}\n", serde_json::to_string_pretty(report)?))
+    Ok(String::new()) /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn write_text(report: &Report) -> String {
     if report.ok {
         return format!("OK: no findings\n{}", scope_line(report));
     }
     let mut output = String::new();
     for finding in &report.findings {

---- report::tests::writes_json_reports stdout ----

thread 'report::tests::writes_json_reports' (1925330) panicked at crates/slophammer-cli/src/report.rs:268:9:
assertion failed: json.contains("\"ok\": false")

---- app::tests::check_applies_rule_severity_overrides stdout ----

thread 'app::tests::check_applies_rule_severity_overrides' (1925302) panicked at crates/slophammer-cli/src/app.rs:456:9:
assertion failed: result.stdout.contains("\"rule_id\": \"repo.readme-required\"")

---- app::tests::rust_failure_fixtures_report_findings stdout ----

thread 'app::tests::rust_failure_fixtures_report_findings' (1925309) panicked at crates/slophammer-cli/src/app.rs:379:13:
rust-bad-dependency

failures:
    app::tests::check_applies_rule_severity_overrides
    app::tests::clean_fixture_has_no_findings
    app::tests::direct_commands_use_report_contract
    app::tests::rust_failure_fixtures_report_findings
    report::tests::writes_json_reports

test result: FAILED. 58 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
