*** crates/slophammer-cli/src/report.rs:30:5: replace write_text -> String with String::new()

*** mutation diff:
--- crates/slophammer-cli/src/report.rs
+++ replace write_text -> String with String::new()
@@ -22,29 +22,17 @@
     }
 }
 
 pub fn write_json(report: &Report) -> Result<String, ReportError> {
     Ok(format!("{}\n", serde_json::to_string_pretty(report)?))
 }
 
 pub fn write_text(report: &Report) -> String {
-    if report.ok {
-        return format!("OK: no findings\n{}", scope_line(report));
-    }
-    let mut output = String::new();
-    for finding in &report.findings {
-        output.push_str(&format!(
-            "{} {} {}: {}\n",
-            finding.severity, finding.rule_id, finding.path, finding.message
-        ));
-    }
-    output.push_str(&format!("\n{} finding(s)\n", report.findings.len()));
-    output.push_str(&scope_line(report));
-    output
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 fn scope_line(report: &Report) -> String {
     match report.scope {
         Some(scope) => format!(
             "scope: scanned {} of {} production files\n",
             scope.scanned, scope.production_files
         ),

---- report::tests::writes_text_reports stdout ----

thread 'report::tests::writes_text_reports' (1927512) panicked at crates/slophammer-cli/src/report.rs:233:9:
assertion `left == right` failed
  left: ""
 right: "OK: no findings\n"

---- app::tests::direct_commands_use_report_contract stdout ----

thread 'app::tests::direct_commands_use_report_contract' (1927485) panicked at crates/slophammer-cli/src/app.rs:392:9:
assertion failed: dry.stdout.contains("OK: no findings")

failures:
    app::tests::direct_commands_use_report_contract
    report::tests::writes_text_reports

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
