*** crates/slophammer-cli/src/report.rs:46:5: replace scope_line -> String with "xyzzy".into()

*** mutation diff:
--- crates/slophammer-cli/src/report.rs
+++ replace scope_line -> String with "xyzzy".into()
@@ -38,23 +38,17 @@
         ));
     }
     output.push_str(&format!("\n{} finding(s)\n", report.findings.len()));
     output.push_str(&scope_line(report));
     output
 }
 
 fn scope_line(report: &Report) -> String {
-    match report.scope {
-        Some(scope) => format!(
-            "scope: scanned {} of {} production files\n",
-            scope.scanned, scope.production_files
-        ),
-        None => String::new(),
-    }
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn write_sarif(report: &Report) -> Result<String, ReportError> {
     Ok(format!(
         "{}\n",
         serde_json::to_string_pretty(&sarif_report(report))?
     ))
 }

---- report::tests::writes_text_reports stdout ----

thread 'report::tests::writes_text_reports' (1930493) panicked at crates/slophammer-cli/src/report.rs:239:9:
assertion `left == right` failed
  left: "OK: no findings\nxyzzy"
 right: "OK: no findings\n"

failures:
    report::tests::writes_text_reports

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
