*** crates/slophammer-cli/src/report.rs:56:5: replace write_sarif -> Result<String, ReportError> with Ok("xyzzy".into())

*** mutation diff:
--- crates/slophammer-cli/src/report.rs
+++ replace write_sarif -> Result<String, ReportError> with Ok("xyzzy".into())
@@ -48,20 +48,17 @@
             "scope: scanned {} of {} production files\n",
             scope.scanned, scope.production_files
         ),
         None => String::new(),
     }
 }
 
 pub fn write_sarif(report: &Report) -> Result<String, ReportError> {
-    Ok(format!(
-        "{}\n",
-        serde_json::to_string_pretty(&sarif_report(report))?
-    ))
+    Ok("xyzzy".into()) /* ~ changed by cargo-mutants ~ */
 }
 
 #[derive(Serialize)]
 struct SarifLog {
     #[serde(rename = "$schema")]
     schema: &'static str,
     version: &'static str,
     runs: Vec<SarifRun>,

---- report::tests::writes_sarif_reports stdout ----

thread 'report::tests::writes_sarif_reports' (1932539) panicked at crates/slophammer-cli/src/report.rs:288:9:
assertion failed: sarif.contains("\"version\": \"2.1.0\"")

---- app::tests::direct_commands_use_report_contract stdout ----

thread 'app::tests::direct_commands_use_report_contract' (1932513) panicked at crates/slophammer-cli/src/app.rs:401:9:
assertion failed: boundaries.stdout.contains("rust.dependency-boundaries-required")

failures:
    app::tests::direct_commands_use_report_contract
    report::tests::writes_sarif_reports

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
