*** crates/slophammer-cli/src/rust_rules/boundaries.rs:10:8: delete ! in boundary_findings

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/boundaries.rs
+++ delete ! in boundary_findings
@@ -2,17 +2,17 @@
 use crate::config::{Config, DependencyBoundary};
 use crate::core::Finding;
 use crate::scan::Snapshot;
 use std::collections::BTreeMap;
 use std::path::{Component, Path, PathBuf};
 use toml_edit::{DocumentMut, Item};
 
 pub fn boundary_findings(snapshot: &Snapshot, config: &Config) -> Vec<Finding> {
-    if !super::is_rust_project(snapshot) {
+    if  /* ~ changed by cargo-mutants ~ */super::is_rust_project(snapshot) {
         return Vec::new();
     }
     let Some(rust) = &config.rust else {
         return vec![Finding::new(definition(
             rule_ids::RUST_DEPENDENCY_BOUNDARIES_REQUIRED,
         ))];
     };
     if rust.dependency_boundaries.is_empty() {

---- rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked stdout ----

thread 'rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked' (2023552) panicked at crates/slophammer-cli/src/rust_rules/boundaries.rs:301:9:
assertion `left == right` failed
  left: 0
 right: 1

---- app::tests::direct_commands_use_report_contract stdout ----

thread 'app::tests::direct_commands_use_report_contract' (2023523) panicked at crates/slophammer-cli/src/app.rs:400:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    app::tests::direct_commands_use_report_contract
    rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
