*** crates/slophammer-cli/src/rust_rules/boundaries.rs:111:5: replace direct_dependency_path -> Option<String> with Some(String::new())

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/boundaries.rs
+++ replace direct_dependency_path -> Option<String> with Some(String::new())
@@ -103,28 +103,17 @@
     }
     if dependency_is_workspace(item) {
         return workspace_paths.get(name).cloned();
     }
     None
 }
 
 fn direct_dependency_path(item: &Item) -> Option<String> {
-    if let Some(value) = item.as_value() {
-        if let Some(inline) = value.as_inline_table() {
-            return inline
-                .get("path")
-                .and_then(|path| path.as_str())
-                .map(str::to_owned);
-        }
-    }
-    item.as_table()
-        .and_then(|table| table.get("path"))
-        .and_then(Item::as_str)
-        .map(str::to_owned)
+    Some(String::new()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn dependency_is_workspace(item: &Item) -> bool {
     if let Some(value) = item.as_value() {
         if let Some(inline) = value.as_inline_table() {
             return inline
                 .get("workspace")
                 .and_then(|workspace| workspace.as_bool())

---- rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked stdout ----

thread 'rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked' (2027024) panicked at crates/slophammer-cli/src/rust_rules/boundaries.rs:291:9:
assertion failed: findings[0].message.contains("crates/b")

---- rust_rules::boundaries::tests::allowed_inherited_workspace_path_dependencies_pass stdout ----

thread 'rust_rules::boundaries::tests::allowed_inherited_workspace_path_dependencies_pass' (2027023) panicked at crates/slophammer-cli/src/rust_rules/boundaries.rs:309:9:
assertion failed: findings.is_empty()

failures:
    rust_rules::boundaries::tests::allowed_inherited_workspace_path_dependencies_pass
    rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
