*** crates/slophammer-cli/src/rust_rules/boundaries.rs:111:5: replace direct_dependency_path -> Option<String> with Some("xyzzy".into())

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/boundaries.rs
+++ replace direct_dependency_path -> Option<String> with Some("xyzzy".into())
@@ -103,28 +103,17 @@
     }
     if dependency_is_workspace(item) {
         return workspace_paths.get(name).cloned();
     }
     None
 }
 
 fn direct_dependency_path(item: &Item) -> Option<String> {
-    if let Some(value) = item.as_value() {
-        if let Some(inline) = value.as_inline_table() {
-            return inline
-                .get("path")
-                .and_then(|path| path.as_str())
-                .map(str::to_owned);
-        }
-    }
-    item.as_table()
-        .and_then(|table| table.get("path"))
-        .and_then(Item::as_str)
-        .map(str::to_owned)
+    Some("xyzzy".into()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn dependency_is_workspace(item: &Item) -> bool {
     if let Some(value) = item.as_value() {
         if let Some(inline) = value.as_inline_table() {
             return inline
                 .get("workspace")
                 .and_then(|workspace| workspace.as_bool())

---- rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked stdout ----

thread 'rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked' (2027509) panicked at crates/slophammer-cli/src/rust_rules/boundaries.rs:290:9:
assertion `left == right` failed
  left: 0
 right: 1

---- app::tests::direct_commands_use_report_contract stdout ----

thread 'app::tests::direct_commands_use_report_contract' (2027480) panicked at crates/slophammer-cli/src/app.rs:400:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    app::tests::direct_commands_use_report_contract
    rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
