*** crates/slophammer-cli/src/rust_rules/boundaries.rs:126:5: replace dependency_is_workspace -> bool with true

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/boundaries.rs
+++ replace dependency_is_workspace -> bool with true
@@ -118,28 +118,17 @@
     }
     item.as_table()
         .and_then(|table| table.get("path"))
         .and_then(Item::as_str)
         .map(str::to_owned)
 }
 
 fn dependency_is_workspace(item: &Item) -> bool {
-    if let Some(value) = item.as_value() {
-        if let Some(inline) = value.as_inline_table() {
-            return inline
-                .get("workspace")
-                .and_then(|workspace| workspace.as_bool())
-                .unwrap_or(false);
-        }
-    }
-    item.as_table()
-        .and_then(|table| table.get("workspace"))
-        .and_then(Item::as_bool)
-        .unwrap_or(false)
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 fn workspace_dependency_paths(snapshot: &Snapshot, from: &str) -> BTreeMap<String, DependencyPath> {
     let Some((manifest_path, document)) = workspace_manifest(snapshot, from) else {
         return BTreeMap::new();
     };
     let base = manifest_dir(&manifest_path);
     let Some(dependencies) = document

*** result: Success
