*** crates/slophammer-cli/src/rust_rules/boundaries.rs:126:5: replace dependency_is_workspace -> bool with false

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/boundaries.rs
+++ replace dependency_is_workspace -> bool with false
@@ -118,28 +118,17 @@
     }
     item.as_table()
         .and_then(|table| table.get("path"))
         .and_then(Item::as_str)
         .map(str::to_owned)
 }
 
 fn dependency_is_workspace(item: &Item) -> bool {
-    if let Some(value) = item.as_value() {
-        if let Some(inline) = value.as_inline_table() {
-            return inline
-                .get("workspace")
-                .and_then(|workspace| workspace.as_bool())
-                .unwrap_or(false);
-        }
-    }
-    item.as_table()
-        .and_then(|table| table.get("workspace"))
-        .and_then(Item::as_bool)
-        .unwrap_or(false)
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 fn workspace_dependency_paths(snapshot: &Snapshot, from: &str) -> BTreeMap<String, DependencyPath> {
     let Some((manifest_path, document)) = workspace_manifest(snapshot, from) else {
         return BTreeMap::new();
     };
     let base = manifest_dir(&manifest_path);
     let Some(dependencies) = document

---- rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked stdout ----

thread 'rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked' (2028520) panicked at crates/slophammer-cli/src/rust_rules/boundaries.rs:290:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
