*** crates/slophammer-cli/src/rust_rules/boundaries.rs:156:5: replace workspace_manifest -> Option<(String, DocumentMut)> with None

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/boundaries.rs
+++ replace workspace_manifest -> Option<(String, DocumentMut)> with None
@@ -148,25 +148,17 @@
         .and_then(|workspace| workspace.get("dependencies"))
     else {
         return BTreeMap::new();
     };
     workspace_dependency_paths_in_item(Some(dependencies), &base)
 }
 
 fn workspace_manifest(snapshot: &Snapshot, from: &str) -> Option<(String, DocumentMut)> {
-    ancestor_manifest_paths(from)
-        .into_iter()
-        .filter_map(|path| {
-            let file = snapshot.file(&path)?;
-            let document = file.content.parse::<DocumentMut>().ok()?;
-            document.get("workspace")?;
-            Some((path, document))
-        })
-        .next()
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn ancestor_manifest_paths(from: &str) -> Vec<String> {
     let mut paths = Vec::new();
     let mut current = repo_dir(from);
     loop {
         paths.push(manifest_path(&current));
         if current == "." {

---- rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked stdout ----

thread 'rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked' (2029522) panicked at crates/slophammer-cli/src/rust_rules/boundaries.rs:293:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
