*** crates/slophammer-cli/src/rust_rules/boundaries.rs:168:5: replace ancestor_manifest_paths -> Vec<String> with vec![]

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/boundaries.rs
+++ replace ancestor_manifest_paths -> Vec<String> with vec![]
@@ -160,29 +160,17 @@
             let document = file.content.parse::<DocumentMut>().ok()?;
             document.get("workspace")?;
             Some((path, document))
         })
         .next()
 }
 
 fn ancestor_manifest_paths(from: &str) -> Vec<String> {
-    let mut paths = Vec::new();
-    let mut current = repo_dir(from);
-    loop {
-        paths.push(manifest_path(&current));
-        if current == "." {
-            break;
-        }
-        current = current
-            .rsplit_once('/')
-            .map(|(parent, _)| parent.to_owned())
-            .unwrap_or_else(|| ".".to_owned());
-    }
-    paths
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 fn manifest_dir(manifest_path: &str) -> String {
     manifest_path
         .strip_suffix("/Cargo.toml")
         .filter(|path| !path.is_empty())
         .map(str::to_owned)
         .unwrap_or_else(|| ".".to_owned())

---- rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked stdout ----

thread 'rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked' (2030987) panicked at crates/slophammer-cli/src/rust_rules/boundaries.rs:289:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
