*** crates/slophammer-cli/src/rust_rules/boundaries.rs:172:20: replace == with != in ancestor_manifest_paths

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/boundaries.rs
+++ replace == with != in ancestor_manifest_paths
@@ -164,17 +164,17 @@
         .next()
 }
 
 fn ancestor_manifest_paths(from: &str) -> Vec<String> {
     let mut paths = Vec::new();
     let mut current = repo_dir(from);
     loop {
         paths.push(manifest_path(&current));
-        if current == "." {
+        if current != /* ~ changed by cargo-mutants ~ */ "." {
             break;
         }
         current = current
             .rsplit_once('/')
             .map(|(parent, _)| parent.to_owned())
             .unwrap_or_else(|| ".".to_owned());
     }
     paths

*** result: Timeout
