*** crates/slophammer-cli/src/rust_rules/boundaries.rs:184:5: replace manifest_dir -> String with String::new()

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/boundaries.rs
+++ replace manifest_dir -> String with String::new()
@@ -176,21 +176,17 @@
             .rsplit_once('/')
             .map(|(parent, _)| parent.to_owned())
             .unwrap_or_else(|| ".".to_owned());
     }
     paths
 }
 
 fn manifest_dir(manifest_path: &str) -> String {
-    manifest_path
-        .strip_suffix("/Cargo.toml")
-        .filter(|path| !path.is_empty())
-        .map(str::to_owned)
-        .unwrap_or_else(|| ".".to_owned())
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 fn workspace_dependency_paths_in_item(
     item: Option<&Item>,
     base: &str,
 ) -> BTreeMap<String, DependencyPath> {
     let Some(table) = item.and_then(Item::as_table) else {
         return BTreeMap::new();

*** result: Success
