*** crates/slophammer-cli/src/rust_rules/boundaries.rs:184:5: replace manifest_dir -> String with "xyzzy".into()

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/boundaries.rs
+++ replace manifest_dir -> String with "xyzzy".into()
@@ -176,21 +176,17 @@
             .rsplit_once('/')
             .map(|(parent, _)| parent.to_owned())
             .unwrap_or_else(|| ".".to_owned());
     }
     paths
 }
 
 fn manifest_dir(manifest_path: &str) -> String {
-    manifest_path
-        .strip_suffix("/Cargo.toml")
-        .filter(|path| !path.is_empty())
-        .map(str::to_owned)
-        .unwrap_or_else(|| ".".to_owned())
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 fn workspace_dependency_paths_in_item(
     item: Option<&Item>,
     base: &str,
 ) -> BTreeMap<String, DependencyPath> {
     let Some(table) = item.and_then(Item::as_table) else {
         return BTreeMap::new();

---- rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked stdout ----

thread 'rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked' (2033761) panicked at crates/slophammer-cli/src/rust_rules/boundaries.rs:297:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
