*** crates/slophammer-cli/src/rust_rules/boundaries.rs:195:5: replace workspace_dependency_paths_in_item -> BTreeMap<String, DependencyPath> with BTreeMap::new()

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/boundaries.rs
+++ replace workspace_dependency_paths_in_item -> BTreeMap<String, DependencyPath> with BTreeMap::new()
@@ -187,33 +187,17 @@
         .map(str::to_owned)
         .unwrap_or_else(|| ".".to_owned())
 }
 
 fn workspace_dependency_paths_in_item(
     item: Option<&Item>,
     base: &str,
 ) -> BTreeMap<String, DependencyPath> {
-    let Some(table) = item.and_then(Item::as_table) else {
-        return BTreeMap::new();
-    };
-    table
-        .iter()
-        .filter_map(|(name, item)| {
-            direct_dependency_path(item).map(|path| {
-                (
-                    name.to_owned(),
-                    DependencyPath {
-                        base: repo_dir(base),
-                        path,
-                    },
-                )
-            })
-        })
-        .collect()
+    BTreeMap::new() /* ~ changed by cargo-mutants ~ */
 }
 
 fn manifest_path(from: &str) -> String {
     let dir = repo_dir(from);
     if dir == "." {
         "Cargo.toml".to_owned()
     } else {
         format!("{dir}/Cargo.toml")

---- rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked stdout ----

thread 'rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked' (2034750) panicked at crates/slophammer-cli/src/rust_rules/boundaries.rs:285:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
