*** crates/slophammer-cli/src/rust_rules/boundaries.rs:215:5: replace manifest_path -> String with String::new()

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/boundaries.rs
+++ replace manifest_path -> String with String::new()
@@ -207,22 +207,17 @@
                     },
                 )
             })
         })
         .collect()
 }
 
 fn manifest_path(from: &str) -> String {
-    let dir = repo_dir(from);
-    if dir == "." {
-        "Cargo.toml".to_owned()
-    } else {
-        format!("{dir}/Cargo.toml")
-    }
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 fn resolve_dependency_path(from: &str, dependency_path: &str) -> Option<String> {
     let base = repo_dir(from);
     let base = if base == "." { "" } else { base.as_str() };
     let path = normalize_path(Path::new(base).join(dependency_path));
     path.to_str().map(|path| match path.replace('\\', "/") {
         path if path.is_empty() => ".".to_owned(),

---- rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked stdout ----

thread 'rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked' (2035262) panicked at crates/slophammer-cli/src/rust_rules/boundaries.rs:297:9:
assertion failed: findings[0].message.contains("crates/b")

---- rust_rules::boundaries::tests::allowed_inherited_workspace_path_dependencies_pass stdout ----

thread 'rust_rules::boundaries::tests::allowed_inherited_workspace_path_dependencies_pass' (2035261) panicked at crates/slophammer-cli/src/rust_rules/boundaries.rs:315:9:
assertion failed: findings.is_empty()

---- app::tests::clean_fixture_has_no_findings stdout ----

thread 'app::tests::clean_fixture_has_no_findings' (2035231) panicked at crates/slophammer-cli/src/app.rs:351:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    app::tests::clean_fixture_has_no_findings
    rust_rules::boundaries::tests::allowed_inherited_workspace_path_dependencies_pass
    rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked

test result: FAILED. 60 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
