*** crates/slophammer-cli/src/rust_rules/boundaries.rs:216:12: replace == with != in manifest_path

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/boundaries.rs
+++ replace == with != in manifest_path
@@ -208,17 +208,17 @@
                 )
             })
         })
         .collect()
 }
 
 fn manifest_path(from: &str) -> String {
     let dir = repo_dir(from);
-    if dir == "." {
+    if dir != /* ~ changed by cargo-mutants ~ */ "." {
         "Cargo.toml".to_owned()
     } else {
         format!("{dir}/Cargo.toml")
     }
 }
 
 fn resolve_dependency_path(from: &str, dependency_path: &str) -> Option<String> {
     let base = repo_dir(from);

---- rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked stdout ----

thread 'rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked' (2036254) panicked at crates/slophammer-cli/src/rust_rules/boundaries.rs:301:9:
assertion `left == right` failed
  left: 0
 right: 1

---- app::tests::clean_fixture_has_no_findings stdout ----

thread 'app::tests::clean_fixture_has_no_findings' (2036223) panicked at crates/slophammer-cli/src/app.rs:351:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    app::tests::clean_fixture_has_no_findings
    rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
