*** crates/slophammer-cli/src/rust_rules/boundaries.rs:224:5: replace resolve_dependency_path -> Option<String> with Some(String::new())

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/boundaries.rs
+++ replace resolve_dependency_path -> Option<String> with Some(String::new())
@@ -216,23 +216,17 @@
     if dir == "." {
         "Cargo.toml".to_owned()
     } else {
         format!("{dir}/Cargo.toml")
     }
 }
 
 fn resolve_dependency_path(from: &str, dependency_path: &str) -> Option<String> {
-    let base = repo_dir(from);
-    let base = if base == "." { "" } else { base.as_str() };
-    let path = normalize_path(Path::new(base).join(dependency_path));
-    path.to_str().map(|path| match path.replace('\\', "/") {
-        path if path.is_empty() => ".".to_owned(),
-        path => path,
-    })
+    Some(String::new()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn repo_dir(path: &str) -> String {
     let mut trimmed = path.trim().trim_end_matches('/');
     while let Some(path) = trimmed.strip_prefix("./") {
         trimmed = path;
     }
     if trimmed.is_empty() || trimmed == "." {

---- rust_rules::boundaries::tests::allowed_inherited_workspace_path_dependencies_pass stdout ----

thread 'rust_rules::boundaries::tests::allowed_inherited_workspace_path_dependencies_pass' (2037229) panicked at crates/slophammer-cli/src/rust_rules/boundaries.rs:314:9:
assertion failed: findings.is_empty()

---- rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked stdout ----

thread 'rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked' (2037230) panicked at crates/slophammer-cli/src/rust_rules/boundaries.rs:296:9:
assertion failed: findings[0].message.contains("crates/b")

---- rust_rules::boundaries::tests::resolves_parent_paths stdout ----

thread 'rust_rules::boundaries::tests::resolves_parent_paths' (2037231) panicked at crates/slophammer-cli/src/rust_rules/boundaries.rs:274:9:
assertion `left == right` failed
  left: Some("")
 right: Some("rust/crates/b")

failures:
    rust_rules::boundaries::tests::allowed_inherited_workspace_path_dependencies_pass
    rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked
    rust_rules::boundaries::tests::resolves_parent_paths

test result: FAILED. 60 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
