*** crates/slophammer-cli/src/rust_rules/boundaries.rs:224:5: replace resolve_dependency_path -> Option<String> with Some("xyzzy".into())

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/boundaries.rs
+++ replace resolve_dependency_path -> Option<String> with Some("xyzzy".into())
@@ -216,23 +216,17 @@
     if dir == "." {
         "Cargo.toml".to_owned()
     } else {
         format!("{dir}/Cargo.toml")
     }
 }
 
 fn resolve_dependency_path(from: &str, dependency_path: &str) -> Option<String> {
-    let base = repo_dir(from);
-    let base = if base == "." { "" } else { base.as_str() };
-    let path = normalize_path(Path::new(base).join(dependency_path));
-    path.to_str().map(|path| match path.replace('\\', "/") {
-        path if path.is_empty() => ".".to_owned(),
-        path => path,
-    })
+    Some("xyzzy".into()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn repo_dir(path: &str) -> String {
     let mut trimmed = path.trim().trim_end_matches('/');
     while let Some(path) = trimmed.strip_prefix("./") {
         trimmed = path;
     }
     if trimmed.is_empty() || trimmed == "." {

---- rust_rules::boundaries::tests::resolves_parent_paths stdout ----

thread 'rust_rules::boundaries::tests::resolves_parent_paths' (2037719) panicked at crates/slophammer-cli/src/rust_rules/boundaries.rs:274:9:
assertion `left == right` failed
  left: Some("xyzzy")
 right: Some("rust/crates/b")

---- rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked stdout ----

thread 'rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked' (2037718) panicked at crates/slophammer-cli/src/rust_rules/boundaries.rs:295:9:
assertion `left == right` failed
  left: 0
 right: 1

---- app::tests::direct_commands_use_report_contract stdout ----

thread 'app::tests::direct_commands_use_report_contract' (2037689) panicked at crates/slophammer-cli/src/app.rs:400:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    app::tests::direct_commands_use_report_contract
    rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked
    rust_rules::boundaries::tests::resolves_parent_paths

test result: FAILED. 60 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
