*** crates/slophammer-cli/src/rust_rules/boundaries.rs:225:24: replace == with != in resolve_dependency_path

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/boundaries.rs
+++ replace == with != in resolve_dependency_path
@@ -217,17 +217,17 @@
         "Cargo.toml".to_owned()
     } else {
         format!("{dir}/Cargo.toml")
     }
 }
 
 fn resolve_dependency_path(from: &str, dependency_path: &str) -> Option<String> {
     let base = repo_dir(from);
-    let base = if base == "." { "" } else { base.as_str() };
+    let base = if base != /* ~ changed by cargo-mutants ~ */ "." { "" } else { base.as_str() };
     let path = normalize_path(Path::new(base).join(dependency_path));
     path.to_str().map(|path| match path.replace('\\', "/") {
         path if path.is_empty() => ".".to_owned(),
         path => path,
     })
 }
 
 fn repo_dir(path: &str) -> String {

---- rust_rules::boundaries::tests::resolves_parent_paths stdout ----

thread 'rust_rules::boundaries::tests::resolves_parent_paths' (2038202) panicked at crates/slophammer-cli/src/rust_rules/boundaries.rs:280:9:
assertion `left == right` failed
  left: Some("b")
 right: Some("rust/crates/b")

failures:
    rust_rules::boundaries::tests::resolves_parent_paths

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
