*** crates/slophammer-cli/src/rust_rules/boundaries.rs:228:17: replace match guard path.is_empty() with true in resolve_dependency_path

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/boundaries.rs
+++ replace match guard path.is_empty() with true in resolve_dependency_path
@@ -220,17 +220,17 @@
     }
 }
 
 fn resolve_dependency_path(from: &str, dependency_path: &str) -> Option<String> {
     let base = repo_dir(from);
     let base = if base == "." { "" } else { base.as_str() };
     let path = normalize_path(Path::new(base).join(dependency_path));
     path.to_str().map(|path| match path.replace('\\', "/") {
-        path if path.is_empty() => ".".to_owned(),
+        path if true /* ~ changed by cargo-mutants ~ */ => ".".to_owned(),
         path => path,
     })
 }
 
 fn repo_dir(path: &str) -> String {
     let mut trimmed = path.trim().trim_end_matches('/');
     while let Some(path) = trimmed.strip_prefix("./") {
         trimmed = path;

---- rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked stdout ----

thread 'rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked' (2038690) panicked at crates/slophammer-cli/src/rust_rules/boundaries.rs:302:9:
assertion failed: findings[0].message.contains("crates/b")

---- rust_rules::boundaries::tests::resolves_parent_paths stdout ----

thread 'rust_rules::boundaries::tests::resolves_parent_paths' (2038691) panicked at crates/slophammer-cli/src/rust_rules/boundaries.rs:280:9:
assertion `left == right` failed
  left: Some(".")
 right: Some("rust/crates/b")

---- rust_rules::boundaries::tests::allowed_inherited_workspace_path_dependencies_pass stdout ----

thread 'rust_rules::boundaries::tests::allowed_inherited_workspace_path_dependencies_pass' (2038689) panicked at crates/slophammer-cli/src/rust_rules/boundaries.rs:320:9:
assertion failed: findings.is_empty()

failures:
    rust_rules::boundaries::tests::allowed_inherited_workspace_path_dependencies_pass
    rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked
    rust_rules::boundaries::tests::resolves_parent_paths

test result: FAILED. 60 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
