*** crates/slophammer-cli/src/rust_rules/boundaries.rs:228:17: replace match guard path.is_empty() with false in resolve_dependency_path

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/boundaries.rs
+++ replace match guard path.is_empty() with false in resolve_dependency_path
@@ -220,17 +220,17 @@
     }
 }
 
 fn resolve_dependency_path(from: &str, dependency_path: &str) -> Option<String> {
     let base = repo_dir(from);
     let base = if base == "." { "" } else { base.as_str() };
     let path = normalize_path(Path::new(base).join(dependency_path));
     path.to_str().map(|path| match path.replace('\\', "/") {
-        path if path.is_empty() => ".".to_owned(),
+        path if false /* ~ changed by cargo-mutants ~ */ => ".".to_owned(),
         path => path,
     })
 }
 
 fn repo_dir(path: &str) -> String {
     let mut trimmed = path.trim().trim_end_matches('/');
     while let Some(path) = trimmed.strip_prefix("./") {
         trimmed = path;

*** result: Success
