*** crates/slophammer-cli/src/rust_rules/boundaries.rs:234:5: replace repo_dir -> String with String::new()

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/boundaries.rs
+++ replace repo_dir -> String with String::new()
@@ -226,25 +226,17 @@
     let path = normalize_path(Path::new(base).join(dependency_path));
     path.to_str().map(|path| match path.replace('\\', "/") {
         path if path.is_empty() => ".".to_owned(),
         path => path,
     })
 }
 
 fn repo_dir(path: &str) -> String {
-    let mut trimmed = path.trim().trim_end_matches('/');
-    while let Some(path) = trimmed.strip_prefix("./") {
-        trimmed = path;
-    }
-    if trimmed.is_empty() || trimmed == "." {
-        ".".to_owned()
-    } else {
-        trimmed.to_owned()
-    }
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 fn normalize_path(path: PathBuf) -> PathBuf {
     let mut normalized = PathBuf::new();
     for component in path.components() {
         match component {
             Component::ParentDir => {
                 normalized.pop();

---- rust_rules::boundaries::tests::allowed_inherited_workspace_path_dependencies_pass stdout ----

thread 'rust_rules::boundaries::tests::allowed_inherited_workspace_path_dependencies_pass' (2039679) panicked at crates/slophammer-cli/src/rust_rules/boundaries.rs:312:9:
assertion failed: findings.is_empty()

---- rust_rules::boundaries::tests::resolves_parent_paths stdout ----

thread 'rust_rules::boundaries::tests::resolves_parent_paths' (2039681) panicked at crates/slophammer-cli/src/rust_rules/boundaries.rs:272:9:
assertion `left == right` failed
  left: Some("b")
 right: Some("rust/crates/b")

---- rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked stdout ----

thread 'rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked' (2039680) panicked at crates/slophammer-cli/src/rust_rules/boundaries.rs:294:9:
assertion failed: findings[0].message.contains("crates/b")

failures:
    app::tests::clean_fixture_has_no_findings
    rust_rules::boundaries::tests::allowed_inherited_workspace_path_dependencies_pass
    rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked
    rust_rules::boundaries::tests::resolves_parent_paths

test result: FAILED. 59 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
