*** crates/slophammer-cli/src/rust_rules/boundaries.rs:238:27: replace || with && in repo_dir

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/boundaries.rs
+++ replace || with && in repo_dir
@@ -230,17 +230,17 @@
     })
 }
 
 fn repo_dir(path: &str) -> String {
     let mut trimmed = path.trim().trim_end_matches('/');
     while let Some(path) = trimmed.strip_prefix("./") {
         trimmed = path;
     }
-    if trimmed.is_empty() || trimmed == "." {
+    if trimmed.is_empty() && /* ~ changed by cargo-mutants ~ */ trimmed == "." {
         ".".to_owned()
     } else {
         trimmed.to_owned()
     }
 }
 
 fn normalize_path(path: PathBuf) -> PathBuf {
     let mut normalized = PathBuf::new();

*** result: Success
