*** crates/slophammer-cli/src/rust_rules/boundaries.rs:238:38: replace == with != in repo_dir

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/boundaries.rs
+++ replace == with != in repo_dir
@@ -230,17 +230,17 @@
     })
 }
 
 fn repo_dir(path: &str) -> String {
     let mut trimmed = path.trim().trim_end_matches('/');
     while let Some(path) = trimmed.strip_prefix("./") {
         trimmed = path;
     }
-    if trimmed.is_empty() || trimmed == "." {
+    if trimmed.is_empty() || trimmed != /* ~ changed by cargo-mutants ~ */ "." {
         ".".to_owned()
     } else {
         trimmed.to_owned()
     }
 }
 
 fn normalize_path(path: PathBuf) -> PathBuf {
     let mut normalized = PathBuf::new();

---- rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked stdout ----

thread 'rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked' (2041158) panicked at crates/slophammer-cli/src/rust_rules/boundaries.rs:301:9:
assertion `left == right` failed
  left: 0
 right: 1

---- rust_rules::boundaries::tests::resolves_parent_paths stdout ----

thread 'rust_rules::boundaries::tests::resolves_parent_paths' (2041159) panicked at crates/slophammer-cli/src/rust_rules/boundaries.rs:280:9:
assertion `left == right` failed
  left: Some("b")
 right: Some("rust/crates/b")

failures:
    rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked
    rust_rules::boundaries::tests::resolves_parent_paths

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
