*** crates/slophammer-cli/src/rust_rules/boundaries.rs:246:5: replace normalize_path -> PathBuf with Default::default()

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/boundaries.rs
+++ replace normalize_path -> PathBuf with Default::default()
@@ -238,27 +238,17 @@
     if trimmed.is_empty() || trimmed == "." {
         ".".to_owned()
     } else {
         trimmed.to_owned()
     }
 }
 
 fn normalize_path(path: PathBuf) -> PathBuf {
-    let mut normalized = PathBuf::new();
-    for component in path.components() {
-        match component {
-            Component::ParentDir => {
-                normalized.pop();
-            }
-            Component::CurDir => {}
-            other => normalized.push(other.as_os_str()),
-        }
-    }
-    normalized
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 fn local_repo_path(snapshot: &Snapshot, path: &str) -> bool {
     snapshot.files.contains_key(&manifest_path(path))
 }
 
 fn allowed(boundary: &DependencyBoundary, path: &str) -> bool {
     boundary

---- rust_rules::boundaries::tests::resolves_parent_paths stdout ----

thread 'rust_rules::boundaries::tests::resolves_parent_paths' (2041642) panicked at crates/slophammer-cli/src/rust_rules/boundaries.rs:270:9:
assertion `left == right` failed
  left: Some(".")
 right: Some("rust/crates/b")

---- rust_rules::boundaries::tests::allowed_inherited_workspace_path_dependencies_pass stdout ----

thread 'rust_rules::boundaries::tests::allowed_inherited_workspace_path_dependencies_pass' (2041640) panicked at crates/slophammer-cli/src/rust_rules/boundaries.rs:310:9:
assertion failed: findings.is_empty()

---- rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked stdout ----

thread 'rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked' (2041641) panicked at crates/slophammer-cli/src/rust_rules/boundaries.rs:292:9:
assertion failed: findings[0].message.contains("crates/b")

failures:
    rust_rules::boundaries::tests::allowed_inherited_workspace_path_dependencies_pass
    rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked
    rust_rules::boundaries::tests::resolves_parent_paths

test result: FAILED. 60 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
