*** crates/slophammer-cli/src/rust_rules/boundaries.rs:260:5: replace local_repo_path -> bool with true

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/boundaries.rs
+++ replace local_repo_path -> bool with true
@@ -252,17 +252,17 @@
             Component::CurDir => {}
             other => normalized.push(other.as_os_str()),
         }
     }
     normalized
 }
 
 fn local_repo_path(snapshot: &Snapshot, path: &str) -> bool {
-    snapshot.files.contains_key(&manifest_path(path))
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 fn allowed(boundary: &DependencyBoundary, path: &str) -> bool {
     boundary
         .allow
         .iter()
         .any(|allowed| path == allowed || path.starts_with(&format!("{allowed}/")))
 }

*** result: Success
