*** crates/slophammer-cli/src/rust_rules/boundaries.rs:260:5: replace local_repo_path -> bool with false

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/boundaries.rs
+++ replace local_repo_path -> bool with false
@@ -252,17 +252,17 @@
             Component::CurDir => {}
             other => normalized.push(other.as_os_str()),
         }
     }
     normalized
 }
 
 fn local_repo_path(snapshot: &Snapshot, path: &str) -> bool {
-    snapshot.files.contains_key(&manifest_path(path))
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 fn allowed(boundary: &DependencyBoundary, path: &str) -> bool {
     boundary
         .allow
         .iter()
         .any(|allowed| path == allowed || path.starts_with(&format!("{allowed}/")))
 }

---- rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked stdout ----

thread 'rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked' (2042631) panicked at crates/slophammer-cli/src/rust_rules/boundaries.rs:301:9:
assertion `left == right` failed
  left: 0
 right: 1

---- app::tests::direct_commands_use_report_contract stdout ----

thread 'app::tests::direct_commands_use_report_contract' (2042602) panicked at crates/slophammer-cli/src/app.rs:400:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    app::tests::direct_commands_use_report_contract
    rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
