*** crates/slophammer-cli/src/rust_rules/boundaries.rs:264:5: replace allowed -> bool with true

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/boundaries.rs
+++ replace allowed -> bool with true
@@ -256,20 +256,17 @@
     normalized
 }
 
 fn local_repo_path(snapshot: &Snapshot, path: &str) -> bool {
     snapshot.files.contains_key(&manifest_path(path))
 }
 
 fn allowed(boundary: &DependencyBoundary, path: &str) -> bool {
-    boundary
-        .allow
-        .iter()
-        .any(|allowed| path == allowed || path.starts_with(&format!("{allowed}/")))
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use crate::config::{Config, RustConfig};
     use crate::scan::{RepoFile, Snapshot};
     use std::collections::BTreeMap;

---- rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked stdout ----

thread 'rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked' (2043119) panicked at crates/slophammer-cli/src/rust_rules/boundaries.rs:298:9:
assertion `left == right` failed
  left: 0
 right: 1

---- app::tests::direct_commands_use_report_contract stdout ----

thread 'app::tests::direct_commands_use_report_contract' (2043090) panicked at crates/slophammer-cli/src/app.rs:400:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    app::tests::direct_commands_use_report_contract
    rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
