*** crates/slophammer-cli/src/rust_rules/boundaries.rs:264:5: replace allowed -> bool with false

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/boundaries.rs
+++ replace allowed -> bool with false
@@ -256,20 +256,17 @@
     normalized
 }
 
 fn local_repo_path(snapshot: &Snapshot, path: &str) -> bool {
     snapshot.files.contains_key(&manifest_path(path))
 }
 
 fn allowed(boundary: &DependencyBoundary, path: &str) -> bool {
-    boundary
-        .allow
-        .iter()
-        .any(|allowed| path == allowed || path.starts_with(&format!("{allowed}/")))
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use crate::config::{Config, RustConfig};
     use crate::scan::{RepoFile, Snapshot};
     use std::collections::BTreeMap;

---- rust_rules::boundaries::tests::allowed_inherited_workspace_path_dependencies_pass stdout ----

thread 'rust_rules::boundaries::tests::allowed_inherited_workspace_path_dependencies_pass' (2043606) panicked at crates/slophammer-cli/src/rust_rules/boundaries.rs:317:9:
assertion failed: findings.is_empty()

failures:
    rust_rules::boundaries::tests::allowed_inherited_workspace_path_dependencies_pass

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
