*** crates/slophammer-cli/src/rust_rules/boundaries.rs:267:29: replace == with != in allowed

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/boundaries.rs
+++ replace == with != in allowed
@@ -259,17 +259,17 @@
 fn local_repo_path(snapshot: &Snapshot, path: &str) -> bool {
     snapshot.files.contains_key(&manifest_path(path))
 }
 
 fn allowed(boundary: &DependencyBoundary, path: &str) -> bool {
     boundary
         .allow
         .iter()
-        .any(|allowed| path == allowed || path.starts_with(&format!("{allowed}/")))
+        .any(|allowed| path != /* ~ changed by cargo-mutants ~ */ allowed || path.starts_with(&format!("{allowed}/")))
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use crate::config::{Config, RustConfig};
     use crate::scan::{RepoFile, Snapshot};
     use std::collections::BTreeMap;

---- rust_rules::boundaries::tests::allowed_inherited_workspace_path_dependencies_pass stdout ----

thread 'rust_rules::boundaries::tests::allowed_inherited_workspace_path_dependencies_pass' (2044585) panicked at crates/slophammer-cli/src/rust_rules/boundaries.rs:320:9:
assertion failed: findings.is_empty()

failures:
    rust_rules::boundaries::tests::allowed_inherited_workspace_path_dependencies_pass

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
