*** crates/slophammer-cli/src/rust_rules/boundaries.rs:30:5: replace check_boundary -> Vec<Finding> with vec![]

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/boundaries.rs
+++ replace check_boundary -> Vec<Finding> with vec![]
@@ -22,43 +22,17 @@
     }
     rust.dependency_boundaries
         .iter()
         .flat_map(|boundary| check_boundary(snapshot, boundary))
         .collect()
 }
 
 fn check_boundary(snapshot: &Snapshot, boundary: &DependencyBoundary) -> Vec<Finding> {
-    let manifest_path = manifest_path(&boundary.from);
-    let Some(file) = snapshot.file(&manifest_path) else {
-        return vec![Finding::at_path(
-            definition(rule_ids::RUST_DEPENDENCY_BOUNDARIES_REQUIRED),
-            manifest_path,
-        )];
-    };
-    let Ok(document) = file.content.parse::<DocumentMut>() else {
-        return vec![Finding::at_path(
-            definition(rule_ids::RUST_DEPENDENCY_BOUNDARIES_REQUIRED),
-            file.path.clone(),
-        )];
-    };
-    let workspace_paths = workspace_dependency_paths(snapshot, &boundary.from);
-    dependency_paths(&document, &boundary.from, &workspace_paths)
-        .into_iter()
-        .filter_map(|dependency| resolve_dependency_path(&dependency.base, &dependency.path))
-        .filter(|path| local_repo_path(snapshot, path))
-        .filter(|path| !allowed(boundary, path))
-        .map(|path| {
-            Finding::with_message(
-                definition(rule_ids::RUST_DEPENDENCY_BOUNDARIES_REQUIRED),
-                file.path.clone(),
-                format!("Rust dependency boundary forbids dependency on {path}"),
-            )
-        })
-        .collect()
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 #[derive(Clone, Debug, Eq, PartialEq)]
 struct DependencyPath {
     base: String,
     path: String,
 }

---- rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked stdout ----

thread 'rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked' (2024041) panicked at crates/slophammer-cli/src/rust_rules/boundaries.rs:275:9:
assertion `left == right` failed
  left: 0
 right: 1

---- app::tests::direct_commands_use_report_contract stdout ----

thread 'app::tests::direct_commands_use_report_contract' (2024012) panicked at crates/slophammer-cli/src/app.rs:400:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    app::tests::direct_commands_use_report_contract
    rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
