*** crates/slophammer-cli/src/rust_rules/boundaries.rs:48:24: delete ! in check_boundary

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/boundaries.rs
+++ delete ! in check_boundary
@@ -40,17 +40,17 @@
             file.path.clone(),
         )];
     };
     let workspace_paths = workspace_dependency_paths(snapshot, &boundary.from);
     dependency_paths(&document, &boundary.from, &workspace_paths)
         .into_iter()
         .filter_map(|dependency| resolve_dependency_path(&dependency.base, &dependency.path))
         .filter(|path| local_repo_path(snapshot, path))
-        .filter(|path| !allowed(boundary, path))
+        .filter(|path|  /* ~ changed by cargo-mutants ~ */allowed(boundary, path))
         .map(|path| {
             Finding::with_message(
                 definition(rule_ids::RUST_DEPENDENCY_BOUNDARIES_REQUIRED),
                 file.path.clone(),
                 format!("Rust dependency boundary forbids dependency on {path}"),
             )
         })
         .collect()

---- rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked stdout ----

thread 'rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked' (2024541) panicked at crates/slophammer-cli/src/rust_rules/boundaries.rs:301:9:
assertion `left == right` failed
  left: 0
 right: 1

---- rust_rules::boundaries::tests::allowed_inherited_workspace_path_dependencies_pass stdout ----

thread 'rust_rules::boundaries::tests::allowed_inherited_workspace_path_dependencies_pass' (2024540) panicked at crates/slophammer-cli/src/rust_rules/boundaries.rs:320:9:
assertion failed: findings.is_empty()

---- app::tests::direct_commands_use_report_contract stdout ----

thread 'app::tests::direct_commands_use_report_contract' (2024512) panicked at crates/slophammer-cli/src/app.rs:400:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    app::tests::direct_commands_use_report_contract
    rust_rules::boundaries::tests::allowed_inherited_workspace_path_dependencies_pass
    rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked

test result: FAILED. 60 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
