*** crates/slophammer-cli/src/rust_rules/boundaries.rs:83:5: replace dependency_paths_in_item -> Vec<DependencyPath> with vec![]

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/boundaries.rs
+++ replace dependency_paths_in_item -> Vec<DependencyPath> with vec![]
@@ -75,23 +75,17 @@
         .collect()
 }
 
 fn dependency_paths_in_item(
     item: Option<&Item>,
     direct_base: &str,
     workspace_paths: &BTreeMap<String, DependencyPath>,
 ) -> Vec<DependencyPath> {
-    let Some(table) = item.and_then(Item::as_table) else {
-        return Vec::new();
-    };
-    table
-        .iter()
-        .filter_map(|(name, item)| dependency_path(name, item, direct_base, workspace_paths))
-        .collect()
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 fn dependency_path(
     name: &str,
     item: &Item,
     direct_base: &str,
     workspace_paths: &BTreeMap<String, DependencyPath>,
 ) -> Option<DependencyPath> {

---- rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked stdout ----

thread 'rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked' (2025529) panicked at crates/slophammer-cli/src/rust_rules/boundaries.rs:295:9:
assertion `left == right` failed
  left: 0
 right: 1

---- app::tests::direct_commands_use_report_contract stdout ----

thread 'app::tests::direct_commands_use_report_contract' (2025500) panicked at crates/slophammer-cli/src/app.rs:400:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    app::tests::direct_commands_use_report_contract
    rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
