*** crates/slophammer-cli/src/rust_rules/boundaries.rs:98:5: replace dependency_path -> Option<DependencyPath> with None

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/boundaries.rs
+++ replace dependency_path -> Option<DependencyPath> with None
@@ -90,26 +90,17 @@
 }
 
 fn dependency_path(
     name: &str,
     item: &Item,
     direct_base: &str,
     workspace_paths: &BTreeMap<String, DependencyPath>,
 ) -> Option<DependencyPath> {
-    if let Some(path) = direct_dependency_path(item) {
-        return Some(DependencyPath {
-            base: repo_dir(direct_base),
-            path,
-        });
-    }
-    if dependency_is_workspace(item) {
-        return workspace_paths.get(name).cloned();
-    }
-    None
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn direct_dependency_path(item: &Item) -> Option<String> {
     if let Some(value) = item.as_value() {
         if let Some(inline) = value.as_inline_table() {
             return inline
                 .get("path")
                 .and_then(|path| path.as_str())

---- rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked stdout ----

thread 'rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked' (2026029) panicked at crates/slophammer-cli/src/rust_rules/boundaries.rs:292:9:
assertion `left == right` failed
  left: 0
 right: 1

---- app::tests::direct_commands_use_report_contract stdout ----

thread 'app::tests::direct_commands_use_report_contract' (2026000) panicked at crates/slophammer-cli/src/app.rs:400:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    app::tests::direct_commands_use_report_contract
    rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
