*** crates/slophammer-cli/src/rust_rules/definitions.rs:204:9: delete match arm rule_ids::RUST_TEST_REQUIRED in definition

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/definitions.rs
+++ delete match arm rule_ids::RUST_TEST_REQUIRED in definition
@@ -196,17 +196,17 @@
         rule_ids::README_REQUIRED => &README_REQUIRED,
         rule_ids::AGENTS_REQUIRED => &AGENTS_REQUIRED,
         rule_ids::CI_REQUIRED => &CI_REQUIRED,
         rule_ids::RUST_MANIFEST_REQUIRED => &RUST_MANIFEST_REQUIRED,
         rule_ids::RUST_MSRV_REQUIRED => &RUST_MSRV_REQUIRED,
         rule_ids::RUST_CHECK_REQUIRED => &RUST_CHECK_REQUIRED,
         rule_ids::RUST_FMT_REQUIRED => &RUST_FMT_REQUIRED,
         rule_ids::RUST_CLIPPY_REQUIRED => &RUST_CLIPPY_REQUIRED,
-        rule_ids::RUST_TEST_REQUIRED => &RUST_TEST_REQUIRED,
+         /* ~ changed by cargo-mutants ~ */
         rule_ids::RUST_COVERAGE_REQUIRED => &RUST_COVERAGE_REQUIRED,
         rule_ids::RUST_COMPLEXITY_REQUIRED => &RUST_COMPLEXITY_REQUIRED,
         rule_ids::RUST_DRY_REQUIRED => &RUST_DRY_REQUIRED,
         rule_ids::RUST_MUTATION_REQUIRED => &RUST_MUTATION_REQUIRED,
         rule_ids::RUST_UNSAFE_POLICY_REQUIRED => &RUST_UNSAFE_POLICY_REQUIRED,
         rule_ids::RUST_DEPENDENCY_AUDIT_REQUIRED => &RUST_DEPENDENCY_AUDIT_REQUIRED,
         rule_ids::RUST_DEPENDENCY_BOUNDARIES_REQUIRED => &RUST_DEPENDENCY_BOUNDARIES_REQUIRED,
         rule_ids::SLOPHAMMER_CI_REQUIRED => &SLOPHAMMER_CI_REQUIRED,

*** result: Success
