*** crates/slophammer-cli/src/rust_rules/definitions.rs:209:9: delete match arm rule_ids::RUST_UNSAFE_POLICY_REQUIRED in definition

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/definitions.rs
+++ delete match arm rule_ids::RUST_UNSAFE_POLICY_REQUIRED in definition
@@ -201,17 +201,17 @@
         rule_ids::RUST_CHECK_REQUIRED => &RUST_CHECK_REQUIRED,
         rule_ids::RUST_FMT_REQUIRED => &RUST_FMT_REQUIRED,
         rule_ids::RUST_CLIPPY_REQUIRED => &RUST_CLIPPY_REQUIRED,
         rule_ids::RUST_TEST_REQUIRED => &RUST_TEST_REQUIRED,
         rule_ids::RUST_COVERAGE_REQUIRED => &RUST_COVERAGE_REQUIRED,
         rule_ids::RUST_COMPLEXITY_REQUIRED => &RUST_COMPLEXITY_REQUIRED,
         rule_ids::RUST_DRY_REQUIRED => &RUST_DRY_REQUIRED,
         rule_ids::RUST_MUTATION_REQUIRED => &RUST_MUTATION_REQUIRED,
-        rule_ids::RUST_UNSAFE_POLICY_REQUIRED => &RUST_UNSAFE_POLICY_REQUIRED,
+         /* ~ changed by cargo-mutants ~ */
         rule_ids::RUST_DEPENDENCY_AUDIT_REQUIRED => &RUST_DEPENDENCY_AUDIT_REQUIRED,
         rule_ids::RUST_DEPENDENCY_BOUNDARIES_REQUIRED => &RUST_DEPENDENCY_BOUNDARIES_REQUIRED,
         rule_ids::SLOPHAMMER_CI_REQUIRED => &SLOPHAMMER_CI_REQUIRED,
         rule_ids::RUST_SCOPE_INCOMPLETE => &RUST_SCOPE_INCOMPLETE,
         rule_ids::RUST_SUPPRESSIONS_JUSTIFIED => &RUST_SUPPRESSIONS_JUSTIFIED,
         _ => &README_REQUIRED,
     }
 }

---- rust_rules::unsafe_policy::tests::missing_policy_is_a_finding stdout ----

thread 'rust_rules::unsafe_policy::tests::missing_policy_is_a_finding' (2052125) panicked at crates/slophammer-cli/src/rust_rules/unsafe_policy.rs:142:9:
assertion `left == right` failed
  left: "README.md"
 right: "slophammer.yml"

---- app::tests::direct_commands_use_report_contract stdout ----

thread 'app::tests::direct_commands_use_report_contract' (2052075) panicked at crates/slophammer-cli/src/app.rs:414:9:
assertion failed: unsafe_result.stdout.contains("rust.unsafe-policy-required")

failures:
    app::tests::direct_commands_use_report_contract
    rust_rules::unsafe_policy::tests::missing_policy_is_a_finding

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
