*** crates/slophammer-cli/src/rust_rules/definitions.rs:212:9: delete match arm rule_ids::SLOPHAMMER_CI_REQUIRED in definition

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/definitions.rs
+++ delete match arm rule_ids::SLOPHAMMER_CI_REQUIRED in definition
@@ -204,17 +204,17 @@
         rule_ids::RUST_TEST_REQUIRED => &RUST_TEST_REQUIRED,
         rule_ids::RUST_COVERAGE_REQUIRED => &RUST_COVERAGE_REQUIRED,
         rule_ids::RUST_COMPLEXITY_REQUIRED => &RUST_COMPLEXITY_REQUIRED,
         rule_ids::RUST_DRY_REQUIRED => &RUST_DRY_REQUIRED,
         rule_ids::RUST_MUTATION_REQUIRED => &RUST_MUTATION_REQUIRED,
         rule_ids::RUST_UNSAFE_POLICY_REQUIRED => &RUST_UNSAFE_POLICY_REQUIRED,
         rule_ids::RUST_DEPENDENCY_AUDIT_REQUIRED => &RUST_DEPENDENCY_AUDIT_REQUIRED,
         rule_ids::RUST_DEPENDENCY_BOUNDARIES_REQUIRED => &RUST_DEPENDENCY_BOUNDARIES_REQUIRED,
-        rule_ids::SLOPHAMMER_CI_REQUIRED => &SLOPHAMMER_CI_REQUIRED,
+         /* ~ changed by cargo-mutants ~ */
         rule_ids::RUST_SCOPE_INCOMPLETE => &RUST_SCOPE_INCOMPLETE,
         rule_ids::RUST_SUPPRESSIONS_JUSTIFIED => &RUST_SUPPRESSIONS_JUSTIFIED,
         _ => &README_REQUIRED,
     }
 }
 
 fn rust_definition(
     id: &'static str,

*** result: Success
