*** crates/slophammer-cli/src/rust_rules/definitions.rs:26:5: replace default_definitions -> Vec<RuleDefinition> with vec![]

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/definitions.rs
+++ replace default_definitions -> Vec<RuleDefinition> with vec![]
@@ -18,182 +18,17 @@
     pub const RUST_UNSAFE_POLICY_REQUIRED: &str = "rust.unsafe-policy-required";
     pub const RUST_DEPENDENCY_AUDIT_REQUIRED: &str = "rust.dependency-audit-required";
     pub const RUST_DEPENDENCY_BOUNDARIES_REQUIRED: &str = "rust.dependency-boundaries-required";
     pub const RUST_SCOPE_INCOMPLETE: &str = "rust.scope-incomplete";
     pub const RUST_SUPPRESSIONS_JUSTIFIED: &str = "rust.suppressions-justified";
 }
 
 pub fn default_definitions() -> Vec<RuleDefinition> {
-    vec![
-        RuleDefinition {
-            id: rule_ids::README_REQUIRED,
-            title: "README required",
-            category: "repo",
-            severity: Severity::Error,
-            path: "README.md",
-            message: "README.md is required",
-            description: "The target repo should have a README.md.",
-            tool: None,
-            status: "implemented",
-        },
-        RuleDefinition {
-            id: rule_ids::AGENTS_REQUIRED,
-            title: "Agent instructions required",
-            category: "repo",
-            severity: Severity::Error,
-            path: "AGENTS.md",
-            message: "AGENTS.md is required",
-            description: "The target repo should have an AGENTS.md.",
-            tool: None,
-            status: "implemented",
-        },
-        RuleDefinition {
-            id: rule_ids::CI_REQUIRED,
-            title: "CI workflow required",
-            category: "repo",
-            severity: Severity::Error,
-            path: ".github/workflows",
-            message: ".github/workflows must contain at least one .yml or .yaml workflow",
-            description: "The target repo should have a CI workflow under .github/workflows.",
-            tool: None,
-            status: "implemented",
-        },
-        RuleDefinition {
-            id: rule_ids::SLOPHAMMER_CI_REQUIRED,
-            title: "Slophammer enforcement required",
-            category: "repo",
-            severity: Severity::Error,
-            path: ".github/workflows",
-            message: "CI must run a Slophammer checker when slophammer.yml is present",
-            description: "A repository that carries slophammer.yml must execute a Slophammer checker from binding CI evidence; config without enforcement is decoration.",
-            tool: None,
-            status: "implemented",
-        },
-        rust_definition(
-            rule_ids::RUST_MANIFEST_REQUIRED,
-            "Rust manifest required",
-            "Cargo.toml",
-            "Rust projects must include Cargo.toml",
-            "Rust projects should include a Cargo manifest.",
-            Some("cargo"),
-        ),
-        rust_definition(
-            rule_ids::RUST_MSRV_REQUIRED,
-            "Rust MSRV required",
-            "Cargo.toml",
-            "Rust projects must declare a minimum supported Rust version",
-            "Rust projects should declare a minimum supported Rust version.",
-            Some("cargo"),
-        ),
-        rust_definition(
-            rule_ids::RUST_CHECK_REQUIRED,
-            "Rust cargo check required",
-            ".github/workflows",
-            "Rust projects must declare cargo check in CI or scripts",
-            "Rust projects should declare cargo check in an inspectable workflow or script.",
-            Some("cargo check"),
-        ),
-        rust_definition(
-            rule_ids::RUST_FMT_REQUIRED,
-            "Rust formatter required",
-            ".github/workflows",
-            "Rust projects must declare cargo fmt --check in CI or scripts",
-            "Rust projects should declare cargo fmt --check in CI or scripts.",
-            Some("cargo fmt"),
-        ),
-        rust_definition(
-            rule_ids::RUST_CLIPPY_REQUIRED,
-            "Rust Clippy required",
-            ".github/workflows",
-            "Rust projects must declare cargo clippy in CI or scripts",
-            "Rust projects should declare cargo clippy with warnings denied.",
-            Some("cargo clippy"),
-        ),
-        rust_definition(
-            rule_ids::RUST_TEST_REQUIRED,
-            "Rust tests required",
-            ".github/workflows",
-            "Rust projects must declare cargo test in CI or scripts",
-            "Rust projects should declare cargo test in CI or scripts.",
-            Some("cargo test"),
-        ),
-        rust_definition(
-            rule_ids::RUST_COVERAGE_REQUIRED,
-            "Rust coverage gate required",
-            ".github/workflows",
-            "Rust projects must declare a coverage gate",
-            "Rust projects should declare an enforceable coverage gate.",
-            Some("cargo llvm-cov"),
-        ),
-        rust_definition(
-            rule_ids::RUST_COMPLEXITY_REQUIRED,
-            "Rust complexity required",
-            ".github/workflows",
-            "Rust projects must enforce complexity limits",
-            "Rust projects should enforce complexity limits through Clippy or Slophammer policy.",
-            Some("clippy"),
-        ),
-        rust_definition(
-            rule_ids::RUST_DRY_REQUIRED,
-            "Rust DRY check required",
-            ".github/workflows",
-            "Rust projects must declare a DRY check",
-            "Rust projects should declare Slophammer's native Rust DRY check.",
-            Some("slophammer-rs dry"),
-        ),
-        rust_definition(
-            rule_ids::RUST_MUTATION_REQUIRED,
-            "Rust mutation check required",
-            ".github/workflows",
-            "Rust projects must declare mutation testing",
-            "Rust projects should declare mutation testing, normally through cargo-mutants.",
-            Some("cargo mutants"),
-        ),
-        rust_definition(
-            rule_ids::RUST_UNSAFE_POLICY_REQUIRED,
-            "Rust unsafe policy required",
-            "slophammer.yml",
-            "Rust projects must declare and respect an unsafe-code policy",
-            "Rust projects should declare and respect an unsafe-code policy in slophammer.yml.",
-            None,
-        ),
-        rust_definition(
-            rule_ids::RUST_DEPENDENCY_AUDIT_REQUIRED,
-            "Rust dependency audit required",
-            ".github/workflows",
-            "Rust projects must declare dependency audit checks",
-            "Rust projects should declare cargo audit or cargo deny.",
-            Some("cargo audit/cargo deny"),
-        ),
-        rust_definition(
-            rule_ids::RUST_DEPENDENCY_BOUNDARIES_REQUIRED,
-            "Rust dependency boundaries required",
-            "slophammer.yml",
-            "Rust projects must respect configured dependency boundaries",
-            "Rust projects should declare dependency boundaries in slophammer.yml and keep local dependencies inside them.",
-            None,
-        ),
-        rust_definition(
-            rule_ids::RUST_SCOPE_INCOMPLETE,
-            "Rust scope completeness",
-            "slophammer.yml",
-            "Configured Rust scope must cover all production files or exclude them with reasons",
-            "Every production Rust file must be in configured scope or covered by a conventional or reasoned exclude, so findings cannot be hidden by narrowing scope.",
-            None,
-        ),
-        rust_definition(
-            rule_ids::RUST_SUPPRESSIONS_JUSTIFIED,
-            "Rust suppressions justified",
-            ".",
-            "allow attributes in production Rust code must carry a reason",
-            "An #[allow(...)] attribute in production scope must carry an adjacent // reason comment or use #[expect(..., reason = \"...\")]; bare suppressions accumulate silently.",
-            None,
-        ),
-    ]
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn definition(rule_id: &str) -> &'static RuleDefinition {
     match rule_id {
         rule_ids::README_REQUIRED => &README_REQUIRED,
         rule_ids::AGENTS_REQUIRED => &AGENTS_REQUIRED,
         rule_ids::CI_REQUIRED => &CI_REQUIRED,
         rule_ids::RUST_MANIFEST_REQUIRED => &RUST_MANIFEST_REQUIRED,

---- app::tests::rules_and_explain_are_available stdout ----

thread 'app::tests::rules_and_explain_are_available' (2045048) panicked at crates/slophammer-cli/src/app.rs:421:9:
assertion failed: catalog.stdout.contains("rust.check-required")

---- app::tests::check_applies_rule_severity_overrides stdout ----

thread 'app::tests::check_applies_rule_severity_overrides' (2045042) panicked at crates/slophammer-cli/src/app.rs:455:9:
assertion `left == right` failed
  left: 2
 right: 1

---- app::tests::only_rules_accept_comma_separated_ids stdout ----

thread 'app::tests::only_rules_accept_comma_separated_ids' (2045047) panicked at crates/slophammer-cli/src/app.rs:325:9:
assertion `left == right` failed: check failed: unknown rule: repo.readme-required, repo.agents-required

  left: 2
 right: 0

failures:
    app::tests::check_applies_rule_severity_overrides
    app::tests::direct_commands_use_report_contract
    app::tests::only_rules_accept_comma_separated_ids
    app::tests::rules_and_explain_are_available
    app::tests::rust_failure_fixtures_report_findings
    rust_rules::tests::missing_rust_checks_are_reported

test result: FAILED. 57 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
