*** crates/slophammer-cli/src/rust_rules/dry.rs:14:25: replace > with < in dry_findings

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/dry.rs
+++ replace > with < in dry_findings
@@ -6,17 +6,17 @@
 use std::collections::BTreeMap;
 
 pub fn dry_findings(snapshot: &Snapshot, config: &Config, max_findings: usize) -> Vec<Finding> {
     if !crate::config::rust_dry_copied_blocks_enabled(config) {
         return Vec::new();
     }
     let min_tokens = crate::config::rust_dry_min_tokens(config);
     let duplicates = copied_block_findings(snapshot, config, min_tokens);
-    if duplicates.len() > max_findings {
+    if duplicates.len() < /* ~ changed by cargo-mutants ~ */ max_findings {
         duplicates
     } else {
         Vec::new()
     }
 }
 
 fn copied_block_findings(snapshot: &Snapshot, config: &Config, min_tokens: usize) -> Vec<Finding> {
     if min_tokens == 0 {

---- rust_rules::dry::tests::detects_same_file_copied_blocks stdout ----

thread 'rust_rules::dry::tests::detects_same_file_copied_blocks' (2056566) panicked at crates/slophammer-cli/src/rust_rules/dry.rs:148:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    rust_rules::dry::tests::detects_same_file_copied_blocks

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
