*** crates/slophammer-cli/src/rust_rules/dry.rs:14:25: replace > with >= in dry_findings

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/dry.rs
+++ replace > with >= in dry_findings
@@ -6,17 +6,17 @@
 use std::collections::BTreeMap;
 
 pub fn dry_findings(snapshot: &Snapshot, config: &Config, max_findings: usize) -> Vec<Finding> {
     if !crate::config::rust_dry_copied_blocks_enabled(config) {
         return Vec::new();
     }
     let min_tokens = crate::config::rust_dry_min_tokens(config);
     let duplicates = copied_block_findings(snapshot, config, min_tokens);
-    if duplicates.len() > max_findings {
+    if duplicates.len() >= /* ~ changed by cargo-mutants ~ */ max_findings {
         duplicates
     } else {
         Vec::new()
     }
 }
 
 fn copied_block_findings(snapshot: &Snapshot, config: &Config, min_tokens: usize) -> Vec<Finding> {
     if min_tokens == 0 {

*** result: Success
