*** crates/slophammer-cli/src/rust_rules/dry.rs:22:19: replace == with != in copied_block_findings

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/dry.rs
+++ replace == with != in copied_block_findings
@@ -14,17 +14,17 @@
     if duplicates.len() > max_findings {
         duplicates
     } else {
         Vec::new()
     }
 }
 
 fn copied_block_findings(snapshot: &Snapshot, config: &Config, min_tokens: usize) -> Vec<Finding> {
-    if min_tokens == 0 {
+    if min_tokens != /* ~ changed by cargo-mutants ~ */ 0 {
         return Vec::new();
     }
     let mut seen: BTreeMap<Vec<String>, Vec<Occurrence>> = BTreeMap::new();
     let mut findings = Vec::new();
     for path in scope::dry_rust_files(snapshot, config) {
         let Some(file) = snapshot.file(&path) else {
             continue;
         };

---- rust_rules::dry::tests::detects_same_file_copied_blocks stdout ----

thread 'rust_rules::dry::tests::detects_same_file_copied_blocks' (2058052) panicked at crates/slophammer-cli/src/rust_rules/dry.rs:148:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    rust_rules::dry::tests::detects_same_file_copied_blocks

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
