*** crates/slophammer-cli/src/rust_rules/dry.rs:22:5: replace copied_block_findings -> Vec<Finding> with vec![]

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/dry.rs
+++ replace copied_block_findings -> Vec<Finding> with vec![]
@@ -14,53 +14,17 @@
     if duplicates.len() > max_findings {
         duplicates
     } else {
         Vec::new()
     }
 }
 
 fn copied_block_findings(snapshot: &Snapshot, config: &Config, min_tokens: usize) -> Vec<Finding> {
-    if min_tokens == 0 {
-        return Vec::new();
-    }
-    let mut seen: BTreeMap<Vec<String>, Vec<Occurrence>> = BTreeMap::new();
-    let mut findings = Vec::new();
-    for path in scope::dry_rust_files(snapshot, config) {
-        let Some(file) = snapshot.file(&path) else {
-            continue;
-        };
-        let tokens = tokens(&file.content);
-        if tokens.len() < min_tokens {
-            continue;
-        }
-        for (start, window) in tokens.windows(min_tokens).enumerate() {
-            let key = window.to_vec();
-            let occurrences = seen.entry(key).or_default();
-            if let Some(first) = occurrences
-                .iter()
-                .find(|occurrence| duplicate_occurrence(occurrence, &path, start, min_tokens))
-            {
-                findings.push(Finding::with_message(
-                    definition(rule_ids::RUST_DRY_REQUIRED),
-                    path.clone(),
-                    format!(
-                        "Rust production code duplicates a copied block from {}",
-                        first.path
-                    ),
-                ));
-                break;
-            }
-            occurrences.push(Occurrence {
-                path: path.clone(),
-                start,
-            });
-        }
-    }
-    findings
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 #[derive(Clone, Debug, Eq, PartialEq)]
 struct Occurrence {
     path: String,
     start: usize,
 }

---- rust_rules::dry::tests::detects_same_file_copied_blocks stdout ----

thread 'rust_rules::dry::tests::detects_same_file_copied_blocks' (2057552) panicked at crates/slophammer-cli/src/rust_rules/dry.rs:112:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    rust_rules::dry::tests::detects_same_file_copied_blocks

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
