*** crates/slophammer-cli/src/rust_rules/dry.rs:32:25: replace < with > in copied_block_findings

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/dry.rs
+++ replace < with > in copied_block_findings
@@ -24,17 +24,17 @@
     }
     let mut seen: BTreeMap<Vec<String>, Vec<Occurrence>> = BTreeMap::new();
     let mut findings = Vec::new();
     for path in scope::dry_rust_files(snapshot, config) {
         let Some(file) = snapshot.file(&path) else {
             continue;
         };
         let tokens = tokens(&file.content);
-        if tokens.len() < min_tokens {
+        if tokens.len() > /* ~ changed by cargo-mutants ~ */ min_tokens {
             continue;
         }
         for (start, window) in tokens.windows(min_tokens).enumerate() {
             let key = window.to_vec();
             let occurrences = seen.entry(key).or_default();
             if let Some(first) = occurrences
                 .iter()
                 .find(|occurrence| duplicate_occurrence(occurrence, &path, start, min_tokens))

---- rust_rules::dry::tests::detects_same_file_copied_blocks stdout ----

thread 'rust_rules::dry::tests::detects_same_file_copied_blocks' (2059041) panicked at crates/slophammer-cli/src/rust_rules/dry.rs:148:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    rust_rules::dry::tests::detects_same_file_copied_blocks

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
