*** crates/slophammer-cli/src/rust_rules/dry.rs:73:27: replace || with && in duplicate_occurrence

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/dry.rs
+++ replace || with && in duplicate_occurrence
@@ -65,17 +65,17 @@
 }
 
 fn duplicate_occurrence(
     previous: &Occurrence,
     path: &str,
     start: usize,
     window_size: usize,
 ) -> bool {
-    previous.path != path || non_overlapping(previous.start, start, window_size)
+    previous.path != path && /* ~ changed by cargo-mutants ~ */ non_overlapping(previous.start, start, window_size)
 }
 
 fn non_overlapping(left: usize, right: usize, window_size: usize) -> bool {
     left + window_size <= right || right + window_size <= left
 }
 
 fn tokens(content: &str) -> Vec<String> {
     content

---- rust_rules::dry::tests::detects_same_file_copied_blocks stdout ----

thread 'rust_rules::dry::tests::detects_same_file_copied_blocks' (2061015) panicked at crates/slophammer-cli/src/rust_rules/dry.rs:148:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    rust_rules::dry::tests::detects_same_file_copied_blocks

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
