*** crates/slophammer-cli/src/rust_rules/dry.rs:73:5: replace duplicate_occurrence -> bool with true

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/dry.rs
+++ replace duplicate_occurrence -> bool with true
@@ -65,17 +65,17 @@
 }
 
 fn duplicate_occurrence(
     previous: &Occurrence,
     path: &str,
     start: usize,
     window_size: usize,
 ) -> bool {
-    previous.path != path || non_overlapping(previous.start, start, window_size)
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 fn non_overlapping(left: usize, right: usize, window_size: usize) -> bool {
     left + window_size <= right || right + window_size <= left
 }
 
 fn tokens(content: &str) -> Vec<String> {
     content

*** result: Success
