*** crates/slophammer-cli/src/rust_rules/dry.rs:77:24: replace <= with > in non_overlapping

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/dry.rs
+++ replace <= with > in non_overlapping
@@ -69,17 +69,17 @@
     path: &str,
     start: usize,
     window_size: usize,
 ) -> bool {
     previous.path != path || non_overlapping(previous.start, start, window_size)
 }
 
 fn non_overlapping(left: usize, right: usize, window_size: usize) -> bool {
-    left + window_size <= right || right + window_size <= left
+    left + window_size > /* ~ changed by cargo-mutants ~ */ right || right + window_size <= left
 }
 
 fn tokens(content: &str) -> Vec<String> {
     content
         .split(|ch: char| !(ch.is_ascii_alphanumeric() || ch == '_'))
         .filter(|part| !part.is_empty())
         .map(str::to_ascii_lowercase)
         .collect()

---- rust_rules::dry::tests::detects_same_file_copied_blocks stdout ----

thread 'rust_rules::dry::tests::detects_same_file_copied_blocks' (2063480) panicked at crates/slophammer-cli/src/rust_rules/dry.rs:148:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    rust_rules::dry::tests::detects_same_file_copied_blocks

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
