*** crates/slophammer-cli/src/rust_rules/dry.rs:77:56: replace <= with > in non_overlapping

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/dry.rs
+++ replace <= with > in non_overlapping
@@ -69,17 +69,17 @@
     path: &str,
     start: usize,
     window_size: usize,
 ) -> bool {
     previous.path != path || non_overlapping(previous.start, start, window_size)
 }
 
 fn non_overlapping(left: usize, right: usize, window_size: usize) -> bool {
-    left + window_size <= right || right + window_size <= left
+    left + window_size <= right || right + window_size > /* ~ changed by cargo-mutants ~ */ left
 }
 
 fn tokens(content: &str) -> Vec<String> {
     content
         .split(|ch: char| !(ch.is_ascii_alphanumeric() || ch == '_'))
         .filter(|part| !part.is_empty())
         .map(str::to_ascii_lowercase)
         .collect()

*** result: Success
