*** crates/slophammer-cli/src/rust_rules/dry.rs:81:5: replace tokens -> Vec<String> with vec![]

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/dry.rs
+++ replace tokens -> Vec<String> with vec![]
@@ -73,21 +73,17 @@
     previous.path != path || non_overlapping(previous.start, start, window_size)
 }
 
 fn non_overlapping(left: usize, right: usize, window_size: usize) -> bool {
     left + window_size <= right || right + window_size <= left
 }
 
 fn tokens(content: &str) -> Vec<String> {
-    content
-        .split(|ch: char| !(ch.is_ascii_alphanumeric() || ch == '_'))
-        .filter(|part| !part.is_empty())
-        .map(str::to_ascii_lowercase)
-        .collect()
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use crate::config::{CopiedBlocks, RustConfig, RustDry};
     use crate::scan::{RepoFile, Snapshot};
     use std::collections::BTreeMap;

---- rust_rules::dry::tests::tokenizes_rust_source stdout ----

thread 'rust_rules::dry::tests::tokenizes_rust_source' (2066473) panicked at crates/slophammer-cli/src/rust_rules/dry.rs:94:9:
assertion `left == right` failed
  left: []
 right: ["fn", "demo_value", "usize", "1"]

---- rust_rules::dry::tests::detects_same_file_copied_blocks stdout ----

thread 'rust_rules::dry::tests::detects_same_file_copied_blocks' (2066471) panicked at crates/slophammer-cli/src/rust_rules/dry.rs:144:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    rust_rules::dry::tests::detects_same_file_copied_blocks
    rust_rules::dry::tests::tokenizes_rust_source

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
