*** crates/slophammer-cli/src/rust_rules/dry.rs:82:62: replace == with != in tokens

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/dry.rs
+++ replace == with != in tokens
@@ -74,17 +74,17 @@
 }
 
 fn non_overlapping(left: usize, right: usize, window_size: usize) -> bool {
     left + window_size <= right || right + window_size <= left
 }
 
 fn tokens(content: &str) -> Vec<String> {
     content
-        .split(|ch: char| !(ch.is_ascii_alphanumeric() || ch == '_'))
+        .split(|ch: char| !(ch.is_ascii_alphanumeric() || ch != /* ~ changed by cargo-mutants ~ */ '_'))
         .filter(|part| !part.is_empty())
         .map(str::to_ascii_lowercase)
         .collect()
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;

---- rust_rules::dry::tests::detects_same_file_copied_blocks stdout ----

thread 'rust_rules::dry::tests::detects_same_file_copied_blocks' (2068911) panicked at crates/slophammer-cli/src/rust_rules/dry.rs:148:9:
assertion `left == right` failed
  left: 0
 right: 1

---- rust_rules::dry::tests::tokenizes_rust_source stdout ----

thread 'rust_rules::dry::tests::tokenizes_rust_source' (2068913) panicked at crates/slophammer-cli/src/rust_rules/dry.rs:98:9:
assertion `left == right` failed
  left: ["fn demo", "value() -> usize { 1 }"]
 right: ["fn", "demo_value", "usize", "1"]

failures:
    rust_rules::dry::tests::detects_same_file_copied_blocks
    rust_rules::dry::tests::tokenizes_rust_source

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
