*** crates/slophammer-cli/src/rust_rules/dry.rs:83:24: delete ! in tokens

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/dry.rs
+++ delete ! in tokens
@@ -75,17 +75,17 @@
 
 fn non_overlapping(left: usize, right: usize, window_size: usize) -> bool {
     left + window_size <= right || right + window_size <= left
 }
 
 fn tokens(content: &str) -> Vec<String> {
     content
         .split(|ch: char| !(ch.is_ascii_alphanumeric() || ch == '_'))
-        .filter(|part| !part.is_empty())
+        .filter(|part|  /* ~ changed by cargo-mutants ~ */part.is_empty())
         .map(str::to_ascii_lowercase)
         .collect()
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use crate::config::{CopiedBlocks, RustConfig, RustDry};

---- rust_rules::dry::tests::tokenizes_rust_source stdout ----

thread 'rust_rules::dry::tests::tokenizes_rust_source' (2069400) panicked at crates/slophammer-cli/src/rust_rules/dry.rs:98:9:
assertion `left == right` failed
  left: ["", "", "", "", "", "", "", "", ""]
 right: ["fn", "demo_value", "usize", "1"]

failures:
    rust_rules::dry::tests::tokenizes_rust_source

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
