*** crates/slophammer-cli/src/rust_rules/dry.rs:9:5: replace dry_findings -> Vec<Finding> with vec![]

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/dry.rs
+++ replace dry_findings -> Vec<Finding> with vec![]
@@ -1,26 +1,17 @@
 use super::definitions::{definition, rule_ids};
 use super::scope;
 use crate::config::Config;
 use crate::core::Finding;
 use crate::scan::Snapshot;
 use std::collections::BTreeMap;
 
 pub fn dry_findings(snapshot: &Snapshot, config: &Config, max_findings: usize) -> Vec<Finding> {
-    if !crate::config::rust_dry_copied_blocks_enabled(config) {
-        return Vec::new();
-    }
-    let min_tokens = crate::config::rust_dry_min_tokens(config);
-    let duplicates = copied_block_findings(snapshot, config, min_tokens);
-    if duplicates.len() > max_findings {
-        duplicates
-    } else {
-        Vec::new()
-    }
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 fn copied_block_findings(snapshot: &Snapshot, config: &Config, min_tokens: usize) -> Vec<Finding> {
     if min_tokens == 0 {
         return Vec::new();
     }
     let mut seen: BTreeMap<Vec<String>, Vec<Occurrence>> = BTreeMap::new();
     let mut findings = Vec::new();

---- rust_rules::dry::tests::detects_same_file_copied_blocks stdout ----

thread 'rust_rules::dry::tests::detects_same_file_copied_blocks' (2055094) panicked at crates/slophammer-cli/src/rust_rules/dry.rs:139:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    rust_rules::dry::tests::detects_same_file_copied_blocks

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
