*** crates/slophammer-cli/src/rust_rules/dry.rs:9:8: delete ! in dry_findings

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/dry.rs
+++ delete ! in dry_findings
@@ -1,17 +1,17 @@
 use super::definitions::{definition, rule_ids};
 use super::scope;
 use crate::config::Config;
 use crate::core::Finding;
 use crate::scan::Snapshot;
 use std::collections::BTreeMap;
 
 pub fn dry_findings(snapshot: &Snapshot, config: &Config, max_findings: usize) -> Vec<Finding> {
-    if !crate::config::rust_dry_copied_blocks_enabled(config) {
+    if  /* ~ changed by cargo-mutants ~ */crate::config::rust_dry_copied_blocks_enabled(config) {
         return Vec::new();
     }
     let min_tokens = crate::config::rust_dry_min_tokens(config);
     let duplicates = copied_block_findings(snapshot, config, min_tokens);
     if duplicates.len() > max_findings {
         duplicates
     } else {
         Vec::new()

---- rust_rules::dry::tests::detects_same_file_copied_blocks stdout ----

thread 'rust_rules::dry::tests::detects_same_file_copied_blocks' (2055594) panicked at crates/slophammer-cli/src/rust_rules/dry.rs:148:9:
assertion `left == right` failed
  left: 0
 right: 1

---- rust_rules::dry::tests::disabled_copied_blocks_suppresses_findings stdout ----

thread 'rust_rules::dry::tests::disabled_copied_blocks_suppresses_findings' (2055595) panicked at crates/slophammer-cli/src/rust_rules/dry.rs:125:9:
assertion failed: findings.is_empty()

failures:
    rust_rules::dry::tests::detects_same_file_copied_blocks
    rust_rules::dry::tests::disabled_copied_blocks_suppresses_findings

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
