*** crates/slophammer-cli/src/rust_rules/evidence.rs:103:5: replace active_workflow_path -> bool with true

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/evidence.rs
+++ replace active_workflow_path -> bool with true
@@ -95,20 +95,17 @@
     end >= bytes.len() || !word_byte(bytes[end])
 }
 
 fn word_byte(value: u8) -> bool {
     value.is_ascii_alphanumeric() || value == b'_' || value == b'-'
 }
 
 fn active_workflow_path(path: &str) -> bool {
-    let Some(name) = path.strip_prefix(".github/workflows/") else {
-        return false;
-    };
-    !name.contains('/') && (name.ends_with(".yml") || name.ends_with(".yaml"))
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 fn normalized_content(content: &str) -> String {
     content
         .lines()
         .filter_map(strip_comment)
         .collect::<Vec<_>>()
         .join("\n")

---- rust_rules::evidence::tests::unreferenced_scripts_are_not_evidence stdout ----

thread 'rust_rules::evidence::tests::unreferenced_scripts_are_not_evidence' (2124387) panicked at crates/slophammer-cli/src/rust_rules/evidence.rs:168:9:
assertion failed: !text.contains("cargo mutants")

---- rust_rules::evidence::tests::only_direct_workflow_children_are_active_evidence stdout ----

thread 'rust_rules::evidence::tests::only_direct_workflow_children_are_active_evidence' (2124385) panicked at crates/slophammer-cli/src/rust_rules/evidence.rs:154:9:
assertion failed: !active_workflow_path(".github/workflows/archive/old.yml")

---- rust_rules::evidence::tests::makefiles_need_a_make_invocation stdout ----

thread 'rust_rules::evidence::tests::makefiles_need_a_make_invocation' (2124384) panicked at crates/slophammer-cli/src/rust_rules/evidence.rs:194:9:
assertion failed: !unreferenced.contains("cargo test")

failures:
    rust_rules::evidence::tests::makefiles_need_a_make_invocation
    rust_rules::evidence::tests::only_direct_workflow_children_are_active_evidence
    rust_rules::evidence::tests::unreferenced_scripts_are_not_evidence

test result: FAILED. 60 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
