*** crates/slophammer-cli/src/rust_rules/evidence.rs:106:5: delete ! in active_workflow_path

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/evidence.rs
+++ delete ! in active_workflow_path
@@ -98,17 +98,17 @@
 fn word_byte(value: u8) -> bool {
     value.is_ascii_alphanumeric() || value == b'_' || value == b'-'
 }
 
 fn active_workflow_path(path: &str) -> bool {
     let Some(name) = path.strip_prefix(".github/workflows/") else {
         return false;
     };
-    !name.contains('/') && (name.ends_with(".yml") || name.ends_with(".yaml"))
+     /* ~ changed by cargo-mutants ~ */name.contains('/') && (name.ends_with(".yml") || name.ends_with(".yaml"))
 }
 
 fn normalized_content(content: &str) -> String {
     content
         .lines()
         .filter_map(strip_comment)
         .collect::<Vec<_>>()
         .join("\n")

---- rust_rules::evidence::tests::referenced_scripts_are_evidence_one_hop_deep stdout ----

thread 'rust_rules::evidence::tests::referenced_scripts_are_evidence_one_hop_deep' (2127384) panicked at crates/slophammer-cli/src/rust_rules/evidence.rs:184:9:
assertion failed: text.contains("cargo test")

---- rust_rules::tests::accepts_stricter_coverage_thresholds stdout ----

thread 'rust_rules::tests::accepts_stricter_coverage_thresholds' (2127391) panicked at crates/slophammer-cli/src/rust_rules/mod.rs:407:9:
assertion failed: rust_coverage(&snapshot, &config).is_empty()

---- rust_rules::evidence::tests::unreferenced_scripts_are_not_evidence stdout ----

thread 'rust_rules::evidence::tests::unreferenced_scripts_are_not_evidence' (2127385) panicked at crates/slophammer-cli/src/rust_rules/evidence.rs:170:9:
assertion failed: text.contains("cargo test")

failures:
    app::tests::clean_fixture_has_no_findings
    rust_rules::evidence::tests::makefiles_need_a_make_invocation
    rust_rules::evidence::tests::only_direct_workflow_children_are_active_evidence
    rust_rules::evidence::tests::referenced_scripts_are_evidence_one_hop_deep
    rust_rules::evidence::tests::unreferenced_scripts_are_not_evidence
    rust_rules::tests::accepts_stricter_coverage_thresholds

test result: FAILED. 57 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
