*** crates/slophammer-cli/src/rust_rules/evidence.rs:106:52: replace || with && in active_workflow_path

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/evidence.rs
+++ replace || with && in active_workflow_path
@@ -98,17 +98,17 @@
 fn word_byte(value: u8) -> bool {
     value.is_ascii_alphanumeric() || value == b'_' || value == b'-'
 }
 
 fn active_workflow_path(path: &str) -> bool {
     let Some(name) = path.strip_prefix(".github/workflows/") else {
         return false;
     };
-    !name.contains('/') && (name.ends_with(".yml") || name.ends_with(".yaml"))
+    !name.contains('/') && (name.ends_with(".yml") && /* ~ changed by cargo-mutants ~ */ name.ends_with(".yaml"))
 }
 
 fn normalized_content(content: &str) -> String {
     content
         .lines()
         .filter_map(strip_comment)
         .collect::<Vec<_>>()
         .join("\n")

---- rust_rules::evidence::tests::makefiles_need_a_make_invocation stdout ----

thread 'rust_rules::evidence::tests::makefiles_need_a_make_invocation' (2128422) panicked at crates/slophammer-cli/src/rust_rules/evidence.rs:206:9:
assertion failed: referenced.contains("cargo test")

---- rust_rules::evidence::tests::only_direct_workflow_children_are_active_evidence stdout ----

thread 'rust_rules::evidence::tests::only_direct_workflow_children_are_active_evidence' (2128423) panicked at crates/slophammer-cli/src/rust_rules/evidence.rs:155:9:
assertion failed: active_workflow_path(".github/workflows/ci.yml")

---- rust_rules::evidence::tests::referenced_scripts_are_evidence_one_hop_deep stdout ----

thread 'rust_rules::evidence::tests::referenced_scripts_are_evidence_one_hop_deep' (2128424) panicked at crates/slophammer-cli/src/rust_rules/evidence.rs:184:9:
assertion failed: text.contains("cargo test")

failures:
    app::tests::clean_fixture_has_no_findings
    rust_rules::evidence::tests::makefiles_need_a_make_invocation
    rust_rules::evidence::tests::only_direct_workflow_children_are_active_evidence
    rust_rules::evidence::tests::referenced_scripts_are_evidence_one_hop_deep
    rust_rules::evidence::tests::unreferenced_scripts_are_not_evidence
    rust_rules::tests::accepts_stricter_coverage_thresholds

test result: FAILED. 57 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
