*** crates/slophammer-cli/src/rust_rules/evidence.rs:110:5: replace normalized_content -> String with "xyzzy".into()

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/evidence.rs
+++ replace normalized_content -> String with "xyzzy".into()
@@ -102,26 +102,17 @@
 fn active_workflow_path(path: &str) -> bool {
     let Some(name) = path.strip_prefix(".github/workflows/") else {
         return false;
     };
     !name.contains('/') && (name.ends_with(".yml") || name.ends_with(".yaml"))
 }
 
 fn normalized_content(content: &str) -> String {
-    content
-        .lines()
-        .filter_map(strip_comment)
-        .collect::<Vec<_>>()
-        .join("\n")
-        .replace("\\\n", " ")
-        .split_whitespace()
-        .collect::<Vec<_>>()
-        .join(" ")
-        .to_ascii_lowercase()
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 fn strip_comment(line: &str) -> Option<&str> {
     let trimmed = line.trim_start();
     if trimmed.starts_with('#') {
         return None;
     }
     Some(trimmed.split('#').next().unwrap_or(trimmed))

---- rust_rules::evidence::tests::referenced_scripts_are_evidence_one_hop_deep stdout ----

thread 'rust_rules::evidence::tests::referenced_scripts_are_evidence_one_hop_deep' (2130469) panicked at crates/slophammer-cli/src/rust_rules/evidence.rs:175:9:
assertion failed: text.contains("cargo test")

---- rust_rules::evidence::tests::unreferenced_scripts_are_not_evidence stdout ----

thread 'rust_rules::evidence::tests::unreferenced_scripts_are_not_evidence' (2130470) panicked at crates/slophammer-cli/src/rust_rules/evidence.rs:161:9:
assertion failed: text.contains("cargo test")

---- rust_rules::tests::accepts_stricter_coverage_thresholds stdout ----

thread 'rust_rules::tests::accepts_stricter_coverage_thresholds' (2130476) panicked at crates/slophammer-cli/src/rust_rules/mod.rs:407:9:
assertion failed: rust_coverage(&snapshot, &config).is_empty()

failures:
    app::tests::clean_fixture_has_no_findings
    rust_rules::evidence::tests::makefiles_need_a_make_invocation
    rust_rules::evidence::tests::referenced_scripts_are_evidence_one_hop_deep
    rust_rules::evidence::tests::unreferenced_scripts_are_not_evidence
    rust_rules::tests::accepts_stricter_coverage_thresholds

test result: FAILED. 58 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
