*** crates/slophammer-cli/src/rust_rules/evidence.rs:123:5: replace strip_comment -> Option<&str> with Some("")

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/evidence.rs
+++ replace strip_comment -> Option<&str> with Some("")
@@ -115,21 +115,17 @@
         .replace("\\\n", " ")
         .split_whitespace()
         .collect::<Vec<_>>()
         .join(" ")
         .to_ascii_lowercase()
 }
 
 fn strip_comment(line: &str) -> Option<&str> {
-    let trimmed = line.trim_start();
-    if trimmed.starts_with('#') {
-        return None;
-    }
-    Some(trimmed.split('#').next().unwrap_or(trimmed))
+    Some("") /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use crate::scan::RepoFile as File;
     use std::collections::BTreeMap;

---- rust_rules::evidence::tests::unreferenced_scripts_are_not_evidence stdout ----

thread 'rust_rules::evidence::tests::unreferenced_scripts_are_not_evidence' (2132481) panicked at crates/slophammer-cli/src/rust_rules/evidence.rs:166:9:
assertion failed: text.contains("cargo test")

---- rust_rules::evidence::tests::makefiles_need_a_make_invocation stdout ----

thread 'rust_rules::evidence::tests::makefiles_need_a_make_invocation' (2132478) panicked at crates/slophammer-cli/src/rust_rules/evidence.rs:202:9:
assertion failed: referenced.contains("cargo test")

---- rust_rules::evidence::tests::referenced_scripts_are_evidence_one_hop_deep stdout ----

thread 'rust_rules::evidence::tests::referenced_scripts_are_evidence_one_hop_deep' (2132480) panicked at crates/slophammer-cli/src/rust_rules/evidence.rs:180:9:
assertion failed: text.contains("cargo test")

failures:
    app::tests::clean_fixture_has_no_findings
    rust_rules::evidence::tests::makefiles_need_a_make_invocation
    rust_rules::evidence::tests::referenced_scripts_are_evidence_one_hop_deep
    rust_rules::evidence::tests::unreferenced_scripts_are_not_evidence
    rust_rules::tests::accepts_stricter_coverage_thresholds

test result: FAILED. 58 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
