*** crates/slophammer-cli/src/rust_rules/evidence.rs:16:5: replace workflow_evidence -> String with "xyzzy".into()

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/evidence.rs
+++ replace workflow_evidence -> String with "xyzzy".into()
@@ -8,26 +8,17 @@
     let extended = format!("{workflow_text}\n{first_hop}");
     let second_hop = reachable_contents(&candidates, &extended);
     format!("{workflow_text}\n{second_hop}")
 }
 
 /// Binding workflow evidence is the reachability root: workflows contribute
 /// only steps that can run and fail; unparseable workflows stay credited raw.
 fn workflow_evidence(snapshot: &Snapshot) -> String {
-    snapshot
-        .files
-        .values()
-        .filter(|file| active_workflow_path(&file.path))
-        .map(|file| match binding_workflow_text(&file.content) {
-            Some(text) => normalized_content(&text),
-            None => normalized_content(&file.content),
-        })
-        .collect::<Vec<_>>()
-        .join("\n")
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 struct CandidateFile {
     reference: String,
     content: String,
 }
 
 /// Scripts, Makefiles, and justfiles count only when binding evidence

---- rust_rules::evidence::tests::unreferenced_scripts_are_not_evidence stdout ----

thread 'rust_rules::evidence::tests::unreferenced_scripts_are_not_evidence' (2071336) panicked at crates/slophammer-cli/src/rust_rules/evidence.rs:161:9:
assertion failed: text.contains("cargo test")

---- rust_rules::evidence::tests::referenced_scripts_are_evidence_one_hop_deep stdout ----

thread 'rust_rules::evidence::tests::referenced_scripts_are_evidence_one_hop_deep' (2071335) panicked at crates/slophammer-cli/src/rust_rules/evidence.rs:175:9:
assertion failed: text.contains("cargo test")

---- rust_rules::evidence::tests::makefiles_need_a_make_invocation stdout ----

thread 'rust_rules::evidence::tests::makefiles_need_a_make_invocation' (2071333) panicked at crates/slophammer-cli/src/rust_rules/evidence.rs:197:9:
assertion failed: referenced.contains("cargo test")

failures:
    app::tests::clean_fixture_has_no_findings
    rust_rules::evidence::tests::makefiles_need_a_make_invocation
    rust_rules::evidence::tests::referenced_scripts_are_evidence_one_hop_deep
    rust_rules::evidence::tests::unreferenced_scripts_are_not_evidence
    rust_rules::tests::accepts_stricter_coverage_thresholds

test result: FAILED. 58 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
