*** crates/slophammer-cli/src/rust_rules/evidence.rs:36:5: replace candidate_files -> Vec<CandidateFile> with vec![]

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/evidence.rs
+++ replace candidate_files -> Vec<CandidateFile> with vec![]
@@ -28,25 +28,17 @@
 struct CandidateFile {
     reference: String,
     content: String,
 }
 
 /// Scripts, Makefiles, and justfiles count only when binding evidence
 /// references them, following script-to-script references one level deep.
 fn candidate_files(snapshot: &Snapshot) -> Vec<CandidateFile> {
-    snapshot
-        .files
-        .values()
-        .filter(|file| candidate_path(&file.path))
-        .map(|file| CandidateFile {
-            reference: candidate_reference(&file.path),
-            content: normalized_content(&file.content),
-        })
-        .collect()
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 fn reachable_contents(candidates: &[CandidateFile], evidence: &str) -> String {
     candidates
         .iter()
         .filter(|candidate| contains_word(evidence, &candidate.reference))
         .map(|candidate| candidate.content.clone())
         .collect::<Vec<_>>()

---- rust_rules::evidence::tests::makefiles_need_a_make_invocation stdout ----

thread 'rust_rules::evidence::tests::makefiles_need_a_make_invocation' (2071884) panicked at crates/slophammer-cli/src/rust_rules/evidence.rs:198:9:
assertion failed: referenced.contains("cargo test")

---- rust_rules::evidence::tests::referenced_scripts_are_evidence_one_hop_deep stdout ----

thread 'rust_rules::evidence::tests::referenced_scripts_are_evidence_one_hop_deep' (2071886) panicked at crates/slophammer-cli/src/rust_rules/evidence.rs:176:9:
assertion failed: text.contains("cargo test")

failures:
    rust_rules::evidence::tests::makefiles_need_a_make_invocation
    rust_rules::evidence::tests::referenced_scripts_are_evidence_one_hop_deep

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
