*** crates/slophammer-cli/src/rust_rules/evidence.rs:48:5: replace reachable_contents -> String with "xyzzy".into()

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/evidence.rs
+++ replace reachable_contents -> String with "xyzzy".into()
@@ -40,22 +40,17 @@
         .map(|file| CandidateFile {
             reference: candidate_reference(&file.path),
             content: normalized_content(&file.content),
         })
         .collect()
 }
 
 fn reachable_contents(candidates: &[CandidateFile], evidence: &str) -> String {
-    candidates
-        .iter()
-        .filter(|candidate| contains_word(evidence, &candidate.reference))
-        .map(|candidate| candidate.content.clone())
-        .collect::<Vec<_>>()
-        .join("\n")
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 fn candidate_path(path: &str) -> bool {
     path.starts_with("scripts/")
         || path.contains("/scripts/")
         || path.ends_with(".sh")
         || path.ends_with("justfile")
         || path.ends_with("Justfile")

---- rust_rules::evidence::tests::referenced_scripts_are_evidence_one_hop_deep stdout ----

thread 'rust_rules::evidence::tests::referenced_scripts_are_evidence_one_hop_deep' (2072882) panicked at crates/slophammer-cli/src/rust_rules/evidence.rs:179:9:
assertion failed: text.contains("cargo test")

---- rust_rules::evidence::tests::makefiles_need_a_make_invocation stdout ----

thread 'rust_rules::evidence::tests::makefiles_need_a_make_invocation' (2072880) panicked at crates/slophammer-cli/src/rust_rules/evidence.rs:201:9:
assertion failed: referenced.contains("cargo test")

failures:
    rust_rules::evidence::tests::makefiles_need_a_make_invocation
    rust_rules::evidence::tests::referenced_scripts_are_evidence_one_hop_deep

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
