*** crates/slophammer-cli/src/rust_rules/evidence.rs:57:5: replace candidate_path -> bool with true

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/evidence.rs
+++ replace candidate_path -> bool with true
@@ -49,22 +49,17 @@
         .iter()
         .filter(|candidate| contains_word(evidence, &candidate.reference))
         .map(|candidate| candidate.content.clone())
         .collect::<Vec<_>>()
         .join("\n")
 }
 
 fn candidate_path(path: &str) -> bool {
-    path.starts_with("scripts/")
-        || path.contains("/scripts/")
-        || path.ends_with(".sh")
-        || path.ends_with("justfile")
-        || path.ends_with("Justfile")
-        || path.ends_with("Makefile")
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 /// Runner-driven files are referenced through their runner command rather
 /// than their file name.
 fn candidate_reference(path: &str) -> String {
     let base_name = path.rsplit('/').next().unwrap_or(path);
     match base_name.to_ascii_lowercase().as_str() {
         "makefile" => "make".to_owned(),

*** result: Success
