*** crates/slophammer-cli/src/rust_rules/evidence.rs:57:5: replace candidate_path -> bool with false

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/evidence.rs
+++ replace candidate_path -> bool with false
@@ -49,22 +49,17 @@
         .iter()
         .filter(|candidate| contains_word(evidence, &candidate.reference))
         .map(|candidate| candidate.content.clone())
         .collect::<Vec<_>>()
         .join("\n")
 }
 
 fn candidate_path(path: &str) -> bool {
-    path.starts_with("scripts/")
-        || path.contains("/scripts/")
-        || path.ends_with(".sh")
-        || path.ends_with("justfile")
-        || path.ends_with("Justfile")
-        || path.ends_with("Makefile")
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 /// Runner-driven files are referenced through their runner command rather
 /// than their file name.
 fn candidate_reference(path: &str) -> String {
     let base_name = path.rsplit('/').next().unwrap_or(path);
     match base_name.to_ascii_lowercase().as_str() {
         "makefile" => "make".to_owned(),

---- rust_rules::evidence::tests::makefiles_need_a_make_invocation stdout ----

thread 'rust_rules::evidence::tests::makefiles_need_a_make_invocation' (2073870) panicked at crates/slophammer-cli/src/rust_rules/evidence.rs:201:9:
assertion failed: referenced.contains("cargo test")

---- rust_rules::evidence::tests::referenced_scripts_are_evidence_one_hop_deep stdout ----

thread 'rust_rules::evidence::tests::referenced_scripts_are_evidence_one_hop_deep' (2073872) panicked at crates/slophammer-cli/src/rust_rules/evidence.rs:179:9:
assertion failed: text.contains("cargo test")

failures:
    rust_rules::evidence::tests::makefiles_need_a_make_invocation
    rust_rules::evidence::tests::referenced_scripts_are_evidence_one_hop_deep

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
