*** crates/slophammer-cli/src/rust_rules/evidence.rs:59:9: replace || with && in candidate_path

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/evidence.rs
+++ replace || with && in candidate_path
@@ -51,17 +51,17 @@
         .map(|candidate| candidate.content.clone())
         .collect::<Vec<_>>()
         .join("\n")
 }
 
 fn candidate_path(path: &str) -> bool {
     path.starts_with("scripts/")
         || path.contains("/scripts/")
-        || path.ends_with(".sh")
+        && /* ~ changed by cargo-mutants ~ */ path.ends_with(".sh")
         || path.ends_with("justfile")
         || path.ends_with("Justfile")
         || path.ends_with("Makefile")
 }
 
 /// Runner-driven files are referenced through their runner command rather
 /// than their file name.
 fn candidate_reference(path: &str) -> String {

*** result: Success
