*** crates/slophammer-cli/src/rust_rules/evidence.rs:5:5: replace command_text -> String with "xyzzy".into()

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/evidence.rs
+++ replace command_text -> String with "xyzzy".into()
@@ -1,18 +1,13 @@
 use super::workflow_binding::binding_workflow_text;
 use crate::scan::Snapshot;
 
 pub fn command_text(snapshot: &Snapshot) -> String {
-    let workflow_text = workflow_evidence(snapshot);
-    let candidates = candidate_files(snapshot);
-    let first_hop = reachable_contents(&candidates, &workflow_text);
-    let extended = format!("{workflow_text}\n{first_hop}");
-    let second_hop = reachable_contents(&candidates, &extended);
-    format!("{workflow_text}\n{second_hop}")
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Binding workflow evidence is the reachability root: workflows contribute
 /// only steps that can run and fail; unparseable workflows stay credited raw.
 fn workflow_evidence(snapshot: &Snapshot) -> String {
     snapshot
         .files
         .values()

---- rust_rules::evidence::tests::unreferenced_scripts_are_not_evidence stdout ----

thread 'rust_rules::evidence::tests::unreferenced_scripts_are_not_evidence' (2070366) panicked at crates/slophammer-cli/src/rust_rules/evidence.rs:165:9:
assertion failed: text.contains("cargo test")

---- rust_rules::evidence::tests::referenced_scripts_are_evidence_one_hop_deep stdout ----

thread 'rust_rules::evidence::tests::referenced_scripts_are_evidence_one_hop_deep' (2070365) panicked at crates/slophammer-cli/src/rust_rules/evidence.rs:179:9:
assertion failed: text.contains("cargo test")

---- rust_rules::evidence::tests::makefiles_need_a_make_invocation stdout ----

thread 'rust_rules::evidence::tests::makefiles_need_a_make_invocation' (2070363) panicked at crates/slophammer-cli/src/rust_rules/evidence.rs:201:9:
assertion failed: referenced.contains("cargo test")

failures:
    app::tests::clean_fixture_has_no_findings
    rust_rules::evidence::tests::makefiles_need_a_make_invocation
    rust_rules::evidence::tests::referenced_scripts_are_evidence_one_hop_deep
    rust_rules::evidence::tests::unreferenced_scripts_are_not_evidence
    rust_rules::tests::accepts_stricter_coverage_thresholds

test result: FAILED. 58 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
