*** crates/slophammer-cli/src/rust_rules/evidence.rs:62:9: replace || with && in candidate_path

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/evidence.rs
+++ replace || with && in candidate_path
@@ -54,17 +54,17 @@
 }
 
 fn candidate_path(path: &str) -> bool {
     path.starts_with("scripts/")
         || path.contains("/scripts/")
         || path.ends_with(".sh")
         || path.ends_with("justfile")
         || path.ends_with("Justfile")
-        || path.ends_with("Makefile")
+        && /* ~ changed by cargo-mutants ~ */ path.ends_with("Makefile")
 }
 
 /// Runner-driven files are referenced through their runner command rather
 /// than their file name.
 fn candidate_reference(path: &str) -> String {
     let base_name = path.rsplit('/').next().unwrap_or(path);
     match base_name.to_ascii_lowercase().as_str() {
         "makefile" => "make".to_owned(),

---- rust_rules::evidence::tests::makefiles_need_a_make_invocation stdout ----

thread 'rust_rules::evidence::tests::makefiles_need_a_make_invocation' (2074364) panicked at crates/slophammer-cli/src/rust_rules/evidence.rs:206:9:
assertion failed: referenced.contains("cargo test")

failures:
    rust_rules::evidence::tests::makefiles_need_a_make_invocation

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
