*** crates/slophammer-cli/src/rust_rules/evidence.rs:68:5: replace candidate_reference -> String with "xyzzy".into()

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/evidence.rs
+++ replace candidate_reference -> String with "xyzzy".into()
@@ -60,23 +60,17 @@
         || path.ends_with("justfile")
         || path.ends_with("Justfile")
         || path.ends_with("Makefile")
 }
 
 /// Runner-driven files are referenced through their runner command rather
 /// than their file name.
 fn candidate_reference(path: &str) -> String {
-    let base_name = path.rsplit('/').next().unwrap_or(path);
-    match base_name.to_ascii_lowercase().as_str() {
-        "makefile" => "make".to_owned(),
-        "justfile" => "just".to_owned(),
-        "taskfile.yml" | "taskfile.yaml" => "task".to_owned(),
-        lowered => lowered.to_owned(),
-    }
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 fn contains_word(evidence: &str, word: &str) -> bool {
     let bytes = evidence.as_bytes();
     let mut start = 0;
     while let Some(found) = evidence[start..].find(word) {
         let index = start + found;
         if word_boundary(bytes, index, word.len()) {

---- rust_rules::evidence::tests::referenced_scripts_are_evidence_one_hop_deep stdout ----

thread 'rust_rules::evidence::tests::referenced_scripts_are_evidence_one_hop_deep' (2077342) panicked at crates/slophammer-cli/src/rust_rules/evidence.rs:178:9:
assertion failed: text.contains("cargo test")

---- rust_rules::evidence::tests::makefiles_need_a_make_invocation stdout ----

thread 'rust_rules::evidence::tests::makefiles_need_a_make_invocation' (2077340) panicked at crates/slophammer-cli/src/rust_rules/evidence.rs:200:9:
assertion failed: referenced.contains("cargo test")

failures:
    rust_rules::evidence::tests::makefiles_need_a_make_invocation
    rust_rules::evidence::tests::referenced_scripts_are_evidence_one_hop_deep

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
