*** crates/slophammer-cli/src/rust_rules/evidence.rs:78:5: replace contains_word -> bool with false

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/evidence.rs
+++ replace contains_word -> bool with false
@@ -70,26 +70,17 @@
         "makefile" => "make".to_owned(),
         "justfile" => "just".to_owned(),
         "taskfile.yml" | "taskfile.yaml" => "task".to_owned(),
         lowered => lowered.to_owned(),
     }
 }
 
 fn contains_word(evidence: &str, word: &str) -> bool {
-    let bytes = evidence.as_bytes();
-    let mut start = 0;
-    while let Some(found) = evidence[start..].find(word) {
-        let index = start + found;
-        if word_boundary(bytes, index, word.len()) {
-            return true;
-        }
-        start = index + 1;
-    }
-    false
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 fn word_boundary(bytes: &[u8], index: usize, length: usize) -> bool {
     if index > 0 && word_byte(bytes[index - 1]) {
         return false;
     }
     let end = index + length;
     end >= bytes.len() || !word_byte(bytes[end])

---- rust_rules::evidence::tests::referenced_scripts_are_evidence_one_hop_deep stdout ----

thread 'rust_rules::evidence::tests::referenced_scripts_are_evidence_one_hop_deep' (2078314) panicked at crates/slophammer-cli/src/rust_rules/evidence.rs:175:9:
assertion failed: text.contains("cargo test")

---- rust_rules::evidence::tests::makefiles_need_a_make_invocation stdout ----

thread 'rust_rules::evidence::tests::makefiles_need_a_make_invocation' (2078312) panicked at crates/slophammer-cli/src/rust_rules/evidence.rs:197:9:
assertion failed: referenced.contains("cargo test")

failures:
    rust_rules::evidence::tests::makefiles_need_a_make_invocation
    rust_rules::evidence::tests::referenced_scripts_are_evidence_one_hop_deep

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
