*** crates/slophammer-cli/src/rust_rules/evidence.rs:81:27: replace + with - in contains_word

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/evidence.rs
+++ replace + with - in contains_word
@@ -73,17 +73,17 @@
         lowered => lowered.to_owned(),
     }
 }
 
 fn contains_word(evidence: &str, word: &str) -> bool {
     let bytes = evidence.as_bytes();
     let mut start = 0;
     while let Some(found) = evidence[start..].find(word) {
-        let index = start + found;
+        let index = start - /* ~ changed by cargo-mutants ~ */ found;
         if word_boundary(bytes, index, word.len()) {
             return true;
         }
         start = index + 1;
     }
     false
 }

---- rust_rules::evidence::tests::referenced_scripts_are_evidence_one_hop_deep stdout ----

thread 'rust_rules::evidence::tests::referenced_scripts_are_evidence_one_hop_deep' (2078802) panicked at crates/slophammer-cli/src/rust_rules/evidence.rs:81:21:
attempt to subtract with overflow

failures:
    rust_rules::evidence::tests::referenced_scripts_are_evidence_one_hop_deep

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
