*** crates/slophammer-cli/src/rust_rules/evidence.rs:85:23: replace + with * in contains_word

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/evidence.rs
+++ replace + with * in contains_word
@@ -77,17 +77,17 @@
 fn contains_word(evidence: &str, word: &str) -> bool {
     let bytes = evidence.as_bytes();
     let mut start = 0;
     while let Some(found) = evidence[start..].find(word) {
         let index = start + found;
         if word_boundary(bytes, index, word.len()) {
             return true;
         }
-        start = index + 1;
+        start = index * /* ~ changed by cargo-mutants ~ */ 1;
     }
     false
 }
 
 fn word_boundary(bytes: &[u8], index: usize, length: usize) -> bool {
     if index > 0 && word_byte(bytes[index - 1]) {
         return false;
     }

*** result: Success
