*** crates/slophammer-cli/src/rust_rules/evidence.rs:91:5: replace word_boundary -> bool with true

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/evidence.rs
+++ replace word_boundary -> bool with true
@@ -83,21 +83,17 @@
             return true;
         }
         start = index + 1;
     }
     false
 }
 
 fn word_boundary(bytes: &[u8], index: usize, length: usize) -> bool {
-    if index > 0 && word_byte(bytes[index - 1]) {
-        return false;
-    }
-    let end = index + length;
-    end >= bytes.len() || !word_byte(bytes[end])
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 fn word_byte(value: u8) -> bool {
     value.is_ascii_alphanumeric() || value == b'_' || value == b'-'
 }
 
 fn active_workflow_path(path: &str) -> bool {
     let Some(name) = path.strip_prefix(".github/workflows/") else {

*** result: Success
