*** crates/slophammer-cli/src/rust_rules/evidence.rs:91:5: replace word_boundary -> bool with false

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/evidence.rs
+++ replace word_boundary -> bool with false
@@ -83,21 +83,17 @@
             return true;
         }
         start = index + 1;
     }
     false
 }
 
 fn word_boundary(bytes: &[u8], index: usize, length: usize) -> bool {
-    if index > 0 && word_byte(bytes[index - 1]) {
-        return false;
-    }
-    let end = index + length;
-    end >= bytes.len() || !word_byte(bytes[end])
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 fn word_byte(value: u8) -> bool {
     value.is_ascii_alphanumeric() || value == b'_' || value == b'-'
 }
 
 fn active_workflow_path(path: &str) -> bool {
     let Some(name) = path.strip_prefix(".github/workflows/") else {

---- rust_rules::evidence::tests::referenced_scripts_are_evidence_one_hop_deep stdout ----

thread 'rust_rules::evidence::tests::referenced_scripts_are_evidence_one_hop_deep' (2105503) panicked at crates/slophammer-cli/src/rust_rules/evidence.rs:180:9:
assertion failed: text.contains("cargo test")

---- rust_rules::evidence::tests::makefiles_need_a_make_invocation stdout ----

thread 'rust_rules::evidence::tests::makefiles_need_a_make_invocation' (2105501) panicked at crates/slophammer-cli/src/rust_rules/evidence.rs:202:9:
assertion failed: referenced.contains("cargo test")

failures:
    rust_rules::evidence::tests::makefiles_need_a_make_invocation
    rust_rules::evidence::tests::referenced_scripts_are_evidence_one_hop_deep

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
