*** crates/slophammer-cli/src/rust_rules/evidence.rs:94:21: replace + with * in word_boundary

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/evidence.rs
+++ replace + with * in word_boundary
@@ -86,17 +86,17 @@
     }
     false
 }
 
 fn word_boundary(bytes: &[u8], index: usize, length: usize) -> bool {
     if index > 0 && word_byte(bytes[index - 1]) {
         return false;
     }
-    let end = index + length;
+    let end = index * /* ~ changed by cargo-mutants ~ */ length;
     end >= bytes.len() || !word_byte(bytes[end])
 }
 
 fn word_byte(value: u8) -> bool {
     value.is_ascii_alphanumeric() || value == b'_' || value == b'-'
 }
 
 fn active_workflow_path(path: &str) -> bool {

---- rust_rules::evidence::tests::makefiles_need_a_make_invocation stdout ----

thread 'rust_rules::evidence::tests::makefiles_need_a_make_invocation' (2113835) panicked at crates/slophammer-cli/src/rust_rules/evidence.rs:206:9:
assertion failed: referenced.contains("cargo test")

failures:
    rust_rules::evidence::tests::makefiles_need_a_make_invocation

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
