*** crates/slophammer-cli/src/rust_rules/evidence.rs:99:5: replace word_byte -> bool with true

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/evidence.rs
+++ replace word_byte -> bool with true
@@ -91,17 +91,17 @@
     if index > 0 && word_byte(bytes[index - 1]) {
         return false;
     }
     let end = index + length;
     end >= bytes.len() || !word_byte(bytes[end])
 }
 
 fn word_byte(value: u8) -> bool {
-    value.is_ascii_alphanumeric() || value == b'_' || value == b'-'
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 fn active_workflow_path(path: &str) -> bool {
     let Some(name) = path.strip_prefix(".github/workflows/") else {
         return false;
     };
     !name.contains('/') && (name.ends_with(".yml") || name.ends_with(".yaml"))
 }

---- rust_rules::evidence::tests::makefiles_need_a_make_invocation stdout ----

thread 'rust_rules::evidence::tests::makefiles_need_a_make_invocation' (2118067) panicked at crates/slophammer-cli/src/rust_rules/evidence.rs:206:9:
assertion failed: referenced.contains("cargo test")

---- rust_rules::evidence::tests::referenced_scripts_are_evidence_one_hop_deep stdout ----

thread 'rust_rules::evidence::tests::referenced_scripts_are_evidence_one_hop_deep' (2118070) panicked at crates/slophammer-cli/src/rust_rules/evidence.rs:184:9:
assertion failed: text.contains("cargo test")

failures:
    rust_rules::evidence::tests::makefiles_need_a_make_invocation
    rust_rules::evidence::tests::referenced_scripts_are_evidence_one_hop_deep

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
