*** crates/slophammer-cli/src/rust_rules/mod.rs:118:5: replace invocation_with_check -> bool with false

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ replace invocation_with_check -> bool with false
@@ -110,20 +110,17 @@
         "slophammer-rs",
         "slophammer-py",
     ]
     .iter()
     .any(|binary| invocation_with_check(evidence, binary))
 }
 
 fn invocation_with_check(evidence: &str, binary: &str) -> bool {
-    evidence.match_indices(binary).any(|(index, _)| {
-        let window_end = (index + 160).min(evidence.len());
-        evidence[index..window_end].contains(" check")
-    })
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 fn rust_suppressions(snapshot: &Snapshot) -> Vec<Finding> {
     if !is_rust_project(snapshot) {
         return Vec::new();
     }
     suppressions::suppression_findings(snapshot)
 }

---- app::tests::clean_fixture_has_no_findings stdout ----

thread 'app::tests::clean_fixture_has_no_findings' (1961698) panicked at crates/slophammer-cli/src/app.rs:351:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    app::tests::clean_fixture_has_no_findings

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
