*** crates/slophammer-cli/src/rust_rules/mod.rs:119:33: replace + with - in invocation_with_check

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ replace + with - in invocation_with_check
@@ -111,17 +111,17 @@
         "slophammer-py",
     ]
     .iter()
     .any(|binary| invocation_with_check(evidence, binary))
 }
 
 fn invocation_with_check(evidence: &str, binary: &str) -> bool {
     evidence.match_indices(binary).any(|(index, _)| {
-        let window_end = (index + 160).min(evidence.len());
+        let window_end = (index - /* ~ changed by cargo-mutants ~ */ 160).min(evidence.len());
         evidence[index..window_end].contains(" check")
     })
 }
 
 fn rust_suppressions(snapshot: &Snapshot) -> Vec<Finding> {
     if !is_rust_project(snapshot) {
         return Vec::new();
     }

---- app::tests::clean_fixture_has_no_findings stdout ----

thread 'app::tests::clean_fixture_has_no_findings' (1962187) panicked at crates/slophammer-cli/src/rust_rules/mod.rs:120:17:

---- app::tests::rust_failure_fixtures_report_findings stdout ----

thread 'app::tests::rust_failure_fixtures_report_findings' (1962193) panicked at crates/slophammer-cli/src/rust_rules/mod.rs:120:17:

failures:
    app::tests::clean_fixture_has_no_findings
    app::tests::rust_failure_fixtures_report_findings

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
