*** crates/slophammer-cli/src/rust_rules/mod.rs:119:33: replace + with * in invocation_with_check

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ replace + with * in invocation_with_check
@@ -111,17 +111,17 @@
         "slophammer-py",
     ]
     .iter()
     .any(|binary| invocation_with_check(evidence, binary))
 }
 
 fn invocation_with_check(evidence: &str, binary: &str) -> bool {
     evidence.match_indices(binary).any(|(index, _)| {
-        let window_end = (index + 160).min(evidence.len());
+        let window_end = (index * /* ~ changed by cargo-mutants ~ */ 160).min(evidence.len());
         evidence[index..window_end].contains(" check")
     })
 }
 
 fn rust_suppressions(snapshot: &Snapshot) -> Vec<Finding> {
     if !is_rust_project(snapshot) {
         return Vec::new();
     }

*** result: Success
