*** crates/slophammer-cli/src/rust_rules/mod.rs:125:5: replace rust_suppressions -> Vec<Finding> with vec![]

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ replace rust_suppressions -> Vec<Finding> with vec![]
@@ -117,20 +117,17 @@
 fn invocation_with_check(evidence: &str, binary: &str) -> bool {
     evidence.match_indices(binary).any(|(index, _)| {
         let window_end = (index + 160).min(evidence.len());
         evidence[index..window_end].contains(" check")
     })
 }
 
 fn rust_suppressions(snapshot: &Snapshot) -> Vec<Finding> {
-    if !is_rust_project(snapshot) {
-        return Vec::new();
-    }
-    suppressions::suppression_findings(snapshot)
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 fn rust_manifest(snapshot: &Snapshot) -> Vec<Finding> {
     missing(
         is_rust_project(snapshot) && rust_manifests(snapshot).is_empty(),
         rule_ids::RUST_MANIFEST_REQUIRED,
     )
 }

*** result: Success
