*** crates/slophammer-cli/src/rust_rules/mod.rs:132:5: replace rust_manifest -> Vec<Finding> with vec![]

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ replace rust_manifest -> Vec<Finding> with vec![]
@@ -124,20 +124,17 @@
 fn rust_suppressions(snapshot: &Snapshot) -> Vec<Finding> {
     if !is_rust_project(snapshot) {
         return Vec::new();
     }
     suppressions::suppression_findings(snapshot)
 }
 
 fn rust_manifest(snapshot: &Snapshot) -> Vec<Finding> {
-    missing(
-        is_rust_project(snapshot) && rust_manifests(snapshot).is_empty(),
-        rule_ids::RUST_MANIFEST_REQUIRED,
-    )
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 fn rust_msrv(snapshot: &Snapshot) -> Vec<Finding> {
     missing(
         is_rust_project(snapshot) && !has_msrv(snapshot),
         rule_ids::RUST_MSRV_REQUIRED,
     )
 }

*** result: Success
