*** crates/slophammer-cli/src/rust_rules/mod.rs:133:35: replace && with || in rust_manifest

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ replace && with || in rust_manifest
@@ -125,17 +125,17 @@
     if !is_rust_project(snapshot) {
         return Vec::new();
     }
     suppressions::suppression_findings(snapshot)
 }
 
 fn rust_manifest(snapshot: &Snapshot) -> Vec<Finding> {
     missing(
-        is_rust_project(snapshot) && rust_manifests(snapshot).is_empty(),
+        is_rust_project(snapshot) || /* ~ changed by cargo-mutants ~ */ rust_manifests(snapshot).is_empty(),
         rule_ids::RUST_MANIFEST_REQUIRED,
     )
 }
 
 fn rust_msrv(snapshot: &Snapshot) -> Vec<Finding> {
     missing(
         is_rust_project(snapshot) && !has_msrv(snapshot),
         rule_ids::RUST_MSRV_REQUIRED,

---- app::tests::clean_fixture_has_no_findings stdout ----

thread 'app::tests::clean_fixture_has_no_findings' (1964701) panicked at crates/slophammer-cli/src/app.rs:351:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    app::tests::clean_fixture_has_no_findings

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
