*** crates/slophammer-cli/src/rust_rules/mod.rs:140:35: replace && with || in rust_msrv

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ replace && with || in rust_msrv
@@ -132,17 +132,17 @@
     missing(
         is_rust_project(snapshot) && rust_manifests(snapshot).is_empty(),
         rule_ids::RUST_MANIFEST_REQUIRED,
     )
 }
 
 fn rust_msrv(snapshot: &Snapshot) -> Vec<Finding> {
     missing(
-        is_rust_project(snapshot) && !has_msrv(snapshot),
+        is_rust_project(snapshot) || /* ~ changed by cargo-mutants ~ */ !has_msrv(snapshot),
         rule_ids::RUST_MSRV_REQUIRED,
     )
 }
 
 fn cargo_command(snapshot: &Snapshot, rule_id: &str, command: &str) -> Vec<Finding> {
     missing(
         is_rust_project(snapshot) && !evidence::command_text(snapshot).contains(command),
         rule_id,

---- rust_rules::tests::plain_rust_toolchain_pin_satisfies_msrv_rule stdout ----

thread 'rust_rules::tests::plain_rust_toolchain_pin_satisfies_msrv_rule' (1965751) panicked at crates/slophammer-cli/src/rust_rules/mod.rs:434:9:
assertion failed: rust_msrv(&snapshot).is_empty()

---- app::tests::clean_fixture_has_no_findings stdout ----

thread 'app::tests::clean_fixture_has_no_findings' (1965703) panicked at crates/slophammer-cli/src/app.rs:351:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    app::tests::clean_fixture_has_no_findings
    rust_rules::tests::plain_rust_toolchain_pin_satisfies_msrv_rule

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
