*** crates/slophammer-cli/src/rust_rules/mod.rs:146:5: replace cargo_command -> Vec<Finding> with vec![]

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ replace cargo_command -> Vec<Finding> with vec![]
@@ -138,20 +138,17 @@
 fn rust_msrv(snapshot: &Snapshot) -> Vec<Finding> {
     missing(
         is_rust_project(snapshot) && !has_msrv(snapshot),
         rule_ids::RUST_MSRV_REQUIRED,
     )
 }
 
 fn cargo_command(snapshot: &Snapshot, rule_id: &str, command: &str) -> Vec<Finding> {
-    missing(
-        is_rust_project(snapshot) && !evidence::command_text(snapshot).contains(command),
-        rule_id,
-    )
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 fn rust_fmt(snapshot: &Snapshot) -> Vec<Finding> {
     let evidence = evidence::command_text(snapshot);
     missing(
         is_rust_project(snapshot)
             && !(evidence.contains("cargo fmt") && evidence.contains("--check")),
         rule_ids::RUST_FMT_REQUIRED,

---- rust_rules::tests::missing_rust_checks_are_reported stdout ----

thread 'rust_rules::tests::missing_rust_checks_are_reported' (1966723) panicked at crates/slophammer-cli/src/rust_rules/mod.rs:389:9:
assertion failed: findings.iter().any(|finding|
        finding.rule_id == rule_ids::RUST_CHECK_REQUIRED)

failures:
    rust_rules::tests::missing_rust_checks_are_reported

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
