*** crates/slophammer-cli/src/rust_rules/mod.rs:147:35: replace && with || in cargo_command

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ replace && with || in cargo_command
@@ -139,17 +139,17 @@
     missing(
         is_rust_project(snapshot) && !has_msrv(snapshot),
         rule_ids::RUST_MSRV_REQUIRED,
     )
 }
 
 fn cargo_command(snapshot: &Snapshot, rule_id: &str, command: &str) -> Vec<Finding> {
     missing(
-        is_rust_project(snapshot) && !evidence::command_text(snapshot).contains(command),
+        is_rust_project(snapshot) || /* ~ changed by cargo-mutants ~ */ !evidence::command_text(snapshot).contains(command),
         rule_id,
     )
 }
 
 fn rust_fmt(snapshot: &Snapshot) -> Vec<Finding> {
     let evidence = evidence::command_text(snapshot);
     missing(
         is_rust_project(snapshot)

---- app::tests::clean_fixture_has_no_findings stdout ----

thread 'app::tests::clean_fixture_has_no_findings' (1967176) panicked at crates/slophammer-cli/src/app.rs:351:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    app::tests::clean_fixture_has_no_findings

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
