*** crates/slophammer-cli/src/rust_rules/mod.rs:147:38: delete ! in cargo_command

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ delete ! in cargo_command
@@ -139,17 +139,17 @@
     missing(
         is_rust_project(snapshot) && !has_msrv(snapshot),
         rule_ids::RUST_MSRV_REQUIRED,
     )
 }
 
 fn cargo_command(snapshot: &Snapshot, rule_id: &str, command: &str) -> Vec<Finding> {
     missing(
-        is_rust_project(snapshot) && !evidence::command_text(snapshot).contains(command),
+        is_rust_project(snapshot) &&  /* ~ changed by cargo-mutants ~ */evidence::command_text(snapshot).contains(command),
         rule_id,
     )
 }
 
 fn rust_fmt(snapshot: &Snapshot) -> Vec<Finding> {
     let evidence = evidence::command_text(snapshot);
     missing(
         is_rust_project(snapshot)

---- rust_rules::tests::missing_rust_checks_are_reported stdout ----

thread 'rust_rules::tests::missing_rust_checks_are_reported' (1967711) panicked at crates/slophammer-cli/src/rust_rules/mod.rs:392:9:
assertion failed: findings.iter().any(|finding|
        finding.rule_id == rule_ids::RUST_CHECK_REQUIRED)

---- app::tests::clean_fixture_has_no_findings stdout ----

thread 'app::tests::clean_fixture_has_no_findings' (1967664) panicked at crates/slophammer-cli/src/app.rs:351:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    app::tests::clean_fixture_has_no_findings
    rust_rules::tests::missing_rust_checks_are_reported

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
