*** crates/slophammer-cli/src/rust_rules/mod.rs:153:5: replace rust_fmt -> Vec<Finding> with vec![]

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ replace rust_fmt -> Vec<Finding> with vec![]
@@ -145,22 +145,17 @@
 fn cargo_command(snapshot: &Snapshot, rule_id: &str, command: &str) -> Vec<Finding> {
     missing(
         is_rust_project(snapshot) && !evidence::command_text(snapshot).contains(command),
         rule_id,
     )
 }
 
 fn rust_fmt(snapshot: &Snapshot) -> Vec<Finding> {
-    let evidence = evidence::command_text(snapshot);
-    missing(
-        is_rust_project(snapshot)
-            && !(evidence.contains("cargo fmt") && evidence.contains("--check")),
-        rule_ids::RUST_FMT_REQUIRED,
-    )
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 fn rust_clippy(snapshot: &Snapshot) -> Vec<Finding> {
     let evidence = evidence::command_text(snapshot);
     missing(
         is_rust_project(snapshot)
             && !(evidence.contains("cargo clippy")
                 && (evidence.contains("-d warnings") || evidence.contains("--deny warnings"))),

*** result: Success
