*** crates/slophammer-cli/src/rust_rules/mod.rs:156:13: replace && with || in rust_fmt

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ replace && with || in rust_fmt
@@ -148,17 +148,17 @@
         rule_id,
     )
 }
 
 fn rust_fmt(snapshot: &Snapshot) -> Vec<Finding> {
     let evidence = evidence::command_text(snapshot);
     missing(
         is_rust_project(snapshot)
-            && !(evidence.contains("cargo fmt") && evidence.contains("--check")),
+            || /* ~ changed by cargo-mutants ~ */ !(evidence.contains("cargo fmt") && evidence.contains("--check")),
         rule_ids::RUST_FMT_REQUIRED,
     )
 }
 
 fn rust_clippy(snapshot: &Snapshot) -> Vec<Finding> {
     let evidence = evidence::command_text(snapshot);
     missing(
         is_rust_project(snapshot)

---- app::tests::clean_fixture_has_no_findings stdout ----

thread 'app::tests::clean_fixture_has_no_findings' (1968680) panicked at crates/slophammer-cli/src/app.rs:351:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    app::tests::clean_fixture_has_no_findings

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
