*** crates/slophammer-cli/src/rust_rules/mod.rs:156:49: replace && with || in rust_fmt

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ replace && with || in rust_fmt
@@ -148,17 +148,17 @@
         rule_id,
     )
 }
 
 fn rust_fmt(snapshot: &Snapshot) -> Vec<Finding> {
     let evidence = evidence::command_text(snapshot);
     missing(
         is_rust_project(snapshot)
-            && !(evidence.contains("cargo fmt") && evidence.contains("--check")),
+            && !(evidence.contains("cargo fmt") || /* ~ changed by cargo-mutants ~ */ evidence.contains("--check")),
         rule_ids::RUST_FMT_REQUIRED,
     )
 }
 
 fn rust_clippy(snapshot: &Snapshot) -> Vec<Finding> {
     let evidence = evidence::command_text(snapshot);
     missing(
         is_rust_project(snapshot)

*** result: Success
