*** crates/slophammer-cli/src/rust_rules/mod.rs:162:5: replace rust_clippy -> Vec<Finding> with vec![]

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ replace rust_clippy -> Vec<Finding> with vec![]
@@ -154,23 +154,17 @@
     missing(
         is_rust_project(snapshot)
             && !(evidence.contains("cargo fmt") && evidence.contains("--check")),
         rule_ids::RUST_FMT_REQUIRED,
     )
 }
 
 fn rust_clippy(snapshot: &Snapshot) -> Vec<Finding> {
-    let evidence = evidence::command_text(snapshot);
-    missing(
-        is_rust_project(snapshot)
-            && !(evidence.contains("cargo clippy")
-                && (evidence.contains("-d warnings") || evidence.contains("--deny warnings"))),
-        rule_ids::RUST_CLIPPY_REQUIRED,
-    )
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 fn rust_coverage(snapshot: &Snapshot, config: &Config) -> Vec<Finding> {
     let threshold = crate::config::rust_coverage_threshold(config);
     missing(
         is_rust_project(snapshot) && !has_coverage_gate(snapshot, threshold),
         rule_ids::RUST_COVERAGE_REQUIRED,
     )

*** result: Success
