*** crates/slophammer-cli/src/rust_rules/mod.rs:166:54: replace || with && in rust_clippy

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ replace || with && in rust_clippy
@@ -158,17 +158,17 @@
     )
 }
 
 fn rust_clippy(snapshot: &Snapshot) -> Vec<Finding> {
     let evidence = evidence::command_text(snapshot);
     missing(
         is_rust_project(snapshot)
             && !(evidence.contains("cargo clippy")
-                && (evidence.contains("-d warnings") || evidence.contains("--deny warnings"))),
+                && (evidence.contains("-d warnings") && /* ~ changed by cargo-mutants ~ */ evidence.contains("--deny warnings"))),
         rule_ids::RUST_CLIPPY_REQUIRED,
     )
 }
 
 fn rust_coverage(snapshot: &Snapshot, config: &Config) -> Vec<Finding> {
     let threshold = crate::config::rust_coverage_threshold(config);
     missing(
         is_rust_project(snapshot) && !has_coverage_gate(snapshot, threshold),

---- app::tests::clean_fixture_has_no_findings stdout ----

thread 'app::tests::clean_fixture_has_no_findings' (1972143) panicked at crates/slophammer-cli/src/app.rs:351:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    app::tests::clean_fixture_has_no_findings

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
