*** crates/slophammer-cli/src/rust_rules/mod.rs:172:5: replace rust_coverage -> Vec<Finding> with vec![]

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ replace rust_coverage -> Vec<Finding> with vec![]
@@ -164,21 +164,17 @@
         is_rust_project(snapshot)
             && !(evidence.contains("cargo clippy")
                 && (evidence.contains("-d warnings") || evidence.contains("--deny warnings"))),
         rule_ids::RUST_CLIPPY_REQUIRED,
     )
 }
 
 fn rust_coverage(snapshot: &Snapshot, config: &Config) -> Vec<Finding> {
-    let threshold = crate::config::rust_coverage_threshold(config);
-    missing(
-        is_rust_project(snapshot) && !has_coverage_gate(snapshot, threshold),
-        rule_ids::RUST_COVERAGE_REQUIRED,
-    )
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 fn rust_complexity(snapshot: &Snapshot, config: &Config) -> Vec<Finding> {
     missing(
         is_rust_project(snapshot) && !has_complexity_limit(snapshot, config),
         rule_ids::RUST_COMPLEXITY_REQUIRED,
     )
 }

*** result: Success
