*** crates/slophammer-cli/src/rust_rules/mod.rs:174:35: replace && with || in rust_coverage

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ replace && with || in rust_coverage
@@ -166,17 +166,17 @@
                 && (evidence.contains("-d warnings") || evidence.contains("--deny warnings"))),
         rule_ids::RUST_CLIPPY_REQUIRED,
     )
 }
 
 fn rust_coverage(snapshot: &Snapshot, config: &Config) -> Vec<Finding> {
     let threshold = crate::config::rust_coverage_threshold(config);
     missing(
-        is_rust_project(snapshot) && !has_coverage_gate(snapshot, threshold),
+        is_rust_project(snapshot) || /* ~ changed by cargo-mutants ~ */ !has_coverage_gate(snapshot, threshold),
         rule_ids::RUST_COVERAGE_REQUIRED,
     )
 }
 
 fn rust_complexity(snapshot: &Snapshot, config: &Config) -> Vec<Finding> {
     missing(
         is_rust_project(snapshot) && !has_complexity_limit(snapshot, config),
         rule_ids::RUST_COMPLEXITY_REQUIRED,

---- rust_rules::tests::accepts_stricter_coverage_thresholds stdout ----

thread 'rust_rules::tests::accepts_stricter_coverage_thresholds' (1973186) panicked at crates/slophammer-cli/src/rust_rules/mod.rs:407:9:
assertion failed: rust_coverage(&snapshot, &config).is_empty()

---- app::tests::clean_fixture_has_no_findings stdout ----

thread 'app::tests::clean_fixture_has_no_findings' (1973141) panicked at crates/slophammer-cli/src/app.rs:351:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    app::tests::clean_fixture_has_no_findings
    rust_rules::tests::accepts_stricter_coverage_thresholds

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
