*** crates/slophammer-cli/src/rust_rules/mod.rs:181:35: replace && with || in rust_complexity

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ replace && with || in rust_complexity
@@ -173,17 +173,17 @@
     missing(
         is_rust_project(snapshot) && !has_coverage_gate(snapshot, threshold),
         rule_ids::RUST_COVERAGE_REQUIRED,
     )
 }
 
 fn rust_complexity(snapshot: &Snapshot, config: &Config) -> Vec<Finding> {
     missing(
-        is_rust_project(snapshot) && !has_complexity_limit(snapshot, config),
+        is_rust_project(snapshot) || /* ~ changed by cargo-mutants ~ */ !has_complexity_limit(snapshot, config),
         rule_ids::RUST_COMPLEXITY_REQUIRED,
     )
 }
 
 fn rust_dry_declaration(snapshot: &Snapshot) -> Vec<Finding> {
     missing(
         is_rust_project(snapshot)
             && !evidence::command_text(snapshot).contains("slophammer-rs dry"),

---- rust_rules::tests::configured_complexity_policy_satisfies_complexity_rule stdout ----

thread 'rust_rules::tests::configured_complexity_policy_satisfies_complexity_rule' (1974675) panicked at crates/slophammer-cli/src/rust_rules/mod.rs:418:9:
assertion failed: rust_complexity(&snapshot, &config).is_empty()

---- app::tests::clean_fixture_has_no_findings stdout ----

thread 'app::tests::clean_fixture_has_no_findings' (1974629) panicked at crates/slophammer-cli/src/app.rs:351:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    app::tests::clean_fixture_has_no_findings
    rust_rules::tests::configured_complexity_policy_satisfies_complexity_rule

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
