*** crates/slophammer-cli/src/rust_rules/mod.rs:187:5: replace rust_dry_declaration -> Vec<Finding> with vec![]

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ replace rust_dry_declaration -> Vec<Finding> with vec![]
@@ -179,21 +179,17 @@
 fn rust_complexity(snapshot: &Snapshot, config: &Config) -> Vec<Finding> {
     missing(
         is_rust_project(snapshot) && !has_complexity_limit(snapshot, config),
         rule_ids::RUST_COMPLEXITY_REQUIRED,
     )
 }
 
 fn rust_dry_declaration(snapshot: &Snapshot) -> Vec<Finding> {
-    missing(
-        is_rust_project(snapshot)
-            && !evidence::command_text(snapshot).contains("slophammer-rs dry"),
-        rule_ids::RUST_DRY_REQUIRED,
-    )
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 fn rust_dependency_audit(snapshot: &Snapshot) -> Vec<Finding> {
     let evidence = evidence::command_text(snapshot);
     missing(
         is_rust_project(snapshot)
             && !(evidence.contains("cargo audit") || evidence.contains("cargo deny")),
         rule_ids::RUST_DEPENDENCY_AUDIT_REQUIRED,

*** result: Success
