*** crates/slophammer-cli/src/rust_rules/mod.rs:189:13: replace && with || in rust_dry_declaration

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ replace && with || in rust_dry_declaration
@@ -181,17 +181,17 @@
         is_rust_project(snapshot) && !has_complexity_limit(snapshot, config),
         rule_ids::RUST_COMPLEXITY_REQUIRED,
     )
 }
 
 fn rust_dry_declaration(snapshot: &Snapshot) -> Vec<Finding> {
     missing(
         is_rust_project(snapshot)
-            && !evidence::command_text(snapshot).contains("slophammer-rs dry"),
+            || /* ~ changed by cargo-mutants ~ */ !evidence::command_text(snapshot).contains("slophammer-rs dry"),
         rule_ids::RUST_DRY_REQUIRED,
     )
 }
 
 fn rust_dependency_audit(snapshot: &Snapshot) -> Vec<Finding> {
     let evidence = evidence::command_text(snapshot);
     missing(
         is_rust_project(snapshot)

---- app::tests::clean_fixture_has_no_findings stdout ----

thread 'app::tests::clean_fixture_has_no_findings' (1976114) panicked at crates/slophammer-cli/src/app.rs:351:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    app::tests::clean_fixture_has_no_findings

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
