*** crates/slophammer-cli/src/rust_rules/mod.rs:204:5: replace missing -> Vec<Finding> with vec![]

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ replace missing -> Vec<Finding> with vec![]
@@ -196,21 +196,17 @@
     missing(
         is_rust_project(snapshot)
             && !(evidence.contains("cargo audit") || evidence.contains("cargo deny")),
         rule_ids::RUST_DEPENDENCY_AUDIT_REQUIRED,
     )
 }
 
 fn missing(condition: bool, rule_id: &str) -> Vec<Finding> {
-    if condition {
-        vec![Finding::new(definition(rule_id))]
-    } else {
-        Vec::new()
-    }
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn is_rust_project(snapshot: &Snapshot) -> bool {
     !rust_manifests(snapshot).is_empty()
         || snapshot
             .files
             .keys()
             .any(|path| rust_source_path(path) && !ignored_project_path(path))

---- rust_rules::tests::missing_rust_checks_are_reported stdout ----

thread 'rust_rules::tests::missing_rust_checks_are_reported' (1979114) panicked at crates/slophammer-cli/src/rust_rules/mod.rs:388:9:
assertion failed: findings.iter().any(|finding|
        finding.rule_id == rule_ids::RUST_CHECK_REQUIRED)

---- app::tests::check_applies_rule_severity_overrides stdout ----

thread 'app::tests::check_applies_rule_severity_overrides' (1979064) panicked at crates/slophammer-cli/src/app.rs:455:9:
assertion `left == right` failed
  left: 0
 right: 1

---- app::tests::rust_failure_fixtures_report_findings stdout ----

thread 'app::tests::rust_failure_fixtures_report_findings' (1979072) panicked at crates/slophammer-cli/src/app.rs:378:13:
assertion `left == right` failed: rust-missing-audit
  left: 0
 right: 1

failures:
    app::tests::check_applies_rule_severity_overrides
    app::tests::rust_failure_fixtures_report_findings
    rust_rules::tests::missing_rust_checks_are_reported

test result: FAILED. 60 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
