*** crates/slophammer-cli/src/rust_rules/mod.rs:212:5: replace is_rust_project -> bool with false

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ replace is_rust_project -> bool with false
@@ -204,22 +204,17 @@
     if condition {
         vec![Finding::new(definition(rule_id))]
     } else {
         Vec::new()
     }
 }
 
 pub fn is_rust_project(snapshot: &Snapshot) -> bool {
-    !rust_manifests(snapshot).is_empty()
-        || snapshot
-            .files
-            .keys()
-            .any(|path| rust_source_path(path) && !ignored_project_path(path))
-        || evidence::command_text(snapshot).contains("cargo ")
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 fn rust_manifests(snapshot: &Snapshot) -> Vec<&str> {
     snapshot
         .files
         .keys()
         .map(String::as_str)
         .filter(|path| path.ends_with("Cargo.toml") && !ignored_project_path(path))

---- rust_rules::unsafe_policy::tests::missing_policy_is_a_finding stdout ----

thread 'rust_rules::unsafe_policy::tests::missing_policy_is_a_finding' (1980119) panicked at crates/slophammer-cli/src/rust_rules/unsafe_policy.rs:141:9:
assertion `left == right` failed
  left: 0
 right: 1

---- rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked stdout ----

thread 'rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked' (1980098) panicked at crates/slophammer-cli/src/rust_rules/boundaries.rs:301:9:
assertion `left == right` failed
  left: 0
 right: 1

---- rust_rules::unsafe_policy::tests::allow_documented_requires_allow_entry stdout ----

thread 'rust_rules::unsafe_policy::tests::allow_documented_requires_allow_entry' (1980116) panicked at crates/slophammer-cli/src/rust_rules/unsafe_policy.rs:183:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    app::tests::direct_commands_use_report_contract
    app::tests::rust_failure_fixtures_report_findings
    rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked
    rust_rules::tests::missing_rust_checks_are_reported
    rust_rules::unsafe_policy::tests::allow_documented_requires_allow_entry
    rust_rules::unsafe_policy::tests::missing_policy_is_a_finding

test result: FAILED. 57 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
