*** crates/slophammer-cli/src/rust_rules/mod.rs:213:9: replace || with && in is_rust_project

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ replace || with && in is_rust_project
@@ -205,17 +205,17 @@
         vec![Finding::new(definition(rule_id))]
     } else {
         Vec::new()
     }
 }
 
 pub fn is_rust_project(snapshot: &Snapshot) -> bool {
     !rust_manifests(snapshot).is_empty()
-        || snapshot
+        && /* ~ changed by cargo-mutants ~ */ snapshot
             .files
             .keys()
             .any(|path| rust_source_path(path) && !ignored_project_path(path))
         || evidence::command_text(snapshot).contains("cargo ")
 }
 
 fn rust_manifests(snapshot: &Snapshot) -> Vec<&str> {
     snapshot

---- rust_rules::tests::missing_rust_checks_are_reported stdout ----

thread 'rust_rules::tests::missing_rust_checks_are_reported' (1981103) panicked at crates/slophammer-cli/src/rust_rules/mod.rs:392:9:
assertion failed: findings.iter().any(|finding|
        finding.rule_id == rule_ids::RUST_CHECK_REQUIRED)

---- rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked stdout ----

thread 'rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked' (1981087) panicked at crates/slophammer-cli/src/rust_rules/boundaries.rs:301:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked
    rust_rules::tests::missing_rust_checks_are_reported

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
