*** crates/slophammer-cli/src/rust_rules/mod.rs:216:48: replace && with || in is_rust_project

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ replace && with || in is_rust_project
@@ -208,17 +208,17 @@
     }
 }
 
 pub fn is_rust_project(snapshot: &Snapshot) -> bool {
     !rust_manifests(snapshot).is_empty()
         || snapshot
             .files
             .keys()
-            .any(|path| rust_source_path(path) && !ignored_project_path(path))
+            .any(|path| rust_source_path(path) || /* ~ changed by cargo-mutants ~ */ !ignored_project_path(path))
         || evidence::command_text(snapshot).contains("cargo ")
 }
 
 fn rust_manifests(snapshot: &Snapshot) -> Vec<&str> {
     snapshot
         .files
         .keys()
         .map(String::as_str)

*** result: Success
