*** crates/slophammer-cli/src/rust_rules/mod.rs:21:34: replace || with && in run_rules

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ replace || with && in run_rules
@@ -13,17 +13,17 @@
 use definitions::definition;
 pub use definitions::{default_definitions, rule_ids};
 pub use dry::dry_findings;
 pub use scope::scope_counts;
 
 pub fn run_rules(snapshot: &Snapshot, config: &Config, only_rule_ids: &[String]) -> Vec<Finding> {
     let definitions = default_definitions();
     let wanted = |rule_id: &str| {
-        only_rule_ids.is_empty() || only_rule_ids.iter().any(|wanted| wanted == rule_id)
+        only_rule_ids.is_empty() && /* ~ changed by cargo-mutants ~ */ only_rule_ids.iter().any(|wanted| wanted == rule_id)
     };
     let mut findings = Vec::new();
     for rule_id in definitions
         .iter()
         .map(|item| item.id)
         .filter(|id| wanted(id))
     {
         findings.extend(run_rule(rule_id, snapshot, config));

---- rust_rules::tests::missing_rust_checks_are_reported stdout ----

thread 'rust_rules::tests::missing_rust_checks_are_reported' (1941908) panicked at crates/slophammer-cli/src/rust_rules/mod.rs:392:9:
assertion failed: findings.iter().any(|finding|
        finding.rule_id == rule_ids::RUST_CHECK_REQUIRED)

---- app::tests::check_applies_rule_severity_overrides stdout ----

thread 'app::tests::check_applies_rule_severity_overrides' (1941860) panicked at crates/slophammer-cli/src/app.rs:455:9:
assertion `left == right` failed
  left: 0
 right: 1

---- app::tests::rust_failure_fixtures_report_findings stdout ----

thread 'app::tests::rust_failure_fixtures_report_findings' (1941867) panicked at crates/slophammer-cli/src/app.rs:378:13:
assertion `left == right` failed: rust-bad-dependency
  left: 0
 right: 1

failures:
    app::tests::check_applies_rule_severity_overrides
    app::tests::direct_commands_use_report_contract
    app::tests::rust_failure_fixtures_report_findings
    rust_rules::tests::missing_rust_checks_are_reported

test result: FAILED. 59 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
