*** crates/slophammer-cli/src/rust_rules/mod.rs:21:78: replace == with != in run_rules

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ replace == with != in run_rules
@@ -13,17 +13,17 @@
 use definitions::definition;
 pub use definitions::{default_definitions, rule_ids};
 pub use dry::dry_findings;
 pub use scope::scope_counts;
 
 pub fn run_rules(snapshot: &Snapshot, config: &Config, only_rule_ids: &[String]) -> Vec<Finding> {
     let definitions = default_definitions();
     let wanted = |rule_id: &str| {
-        only_rule_ids.is_empty() || only_rule_ids.iter().any(|wanted| wanted == rule_id)
+        only_rule_ids.is_empty() || only_rule_ids.iter().any(|wanted| wanted != /* ~ changed by cargo-mutants ~ */ rule_id)
     };
     let mut findings = Vec::new();
     for rule_id in definitions
         .iter()
         .map(|item| item.id)
         .filter(|id| wanted(id))
     {
         findings.extend(run_rule(rule_id, snapshot, config));

---- app::tests::check_applies_rule_severity_overrides stdout ----

thread 'app::tests::check_applies_rule_severity_overrides' (1942348) panicked at crates/slophammer-cli/src/app.rs:456:9:
assertion failed: result.stdout.contains("\"rule_id\": \"repo.readme-required\"")

---- app::tests::direct_commands_use_report_contract stdout ----

thread 'app::tests::direct_commands_use_report_contract' (1942351) panicked at crates/slophammer-cli/src/app.rs:401:9:
assertion failed: boundaries.stdout.contains("rust.dependency-boundaries-required")

failures:
    app::tests::check_applies_rule_severity_overrides
    app::tests::direct_commands_use_report_contract

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
