*** crates/slophammer-cli/src/rust_rules/mod.rs:221:5: replace rust_manifests -> Vec<&str> with vec![]

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ replace rust_manifests -> Vec<&str> with vec![]
@@ -213,22 +213,17 @@
         || snapshot
             .files
             .keys()
             .any(|path| rust_source_path(path) && !ignored_project_path(path))
         || evidence::command_text(snapshot).contains("cargo ")
 }
 
 fn rust_manifests(snapshot: &Snapshot) -> Vec<&str> {
-    snapshot
-        .files
-        .keys()
-        .map(String::as_str)
-        .filter(|path| path.ends_with("Cargo.toml") && !ignored_project_path(path))
-        .collect()
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 fn has_msrv(snapshot: &Snapshot) -> bool {
     snapshot
         .files
         .values()
         .filter(|file| file.path.ends_with("Cargo.toml") && !ignored_project_path(&file.path))
         .any(|file| file.content.contains("rust-version"))

---- rust_rules::tests::missing_rust_checks_are_reported stdout ----

thread 'rust_rules::tests::missing_rust_checks_are_reported' (1983092) panicked at crates/slophammer-cli/src/rust_rules/mod.rs:387:9:
assertion failed: findings.iter().any(|finding|
        finding.rule_id == rule_ids::RUST_CHECK_REQUIRED)

---- rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked stdout ----

thread 'rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked' (1983076) panicked at crates/slophammer-cli/src/rust_rules/boundaries.rs:301:9:
assertion `left == right` failed
  left: 0
 right: 1

---- app::tests::clean_fixture_has_no_findings stdout ----

thread 'app::tests::clean_fixture_has_no_findings' (1983045) panicked at crates/slophammer-cli/src/app.rs:351:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    app::tests::clean_fixture_has_no_findings
    rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked
    rust_rules::tests::missing_rust_checks_are_reported

test result: FAILED. 60 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
