*** crates/slophammer-cli/src/rust_rules/mod.rs:221:5: replace rust_manifests -> Vec<&str> with vec!["xyzzy"]

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ replace rust_manifests -> Vec<&str> with vec!["xyzzy"]
@@ -213,22 +213,17 @@
         || snapshot
             .files
             .keys()
             .any(|path| rust_source_path(path) && !ignored_project_path(path))
         || evidence::command_text(snapshot).contains("cargo ")
 }
 
 fn rust_manifests(snapshot: &Snapshot) -> Vec<&str> {
-    snapshot
-        .files
-        .keys()
-        .map(String::as_str)
-        .filter(|path| path.ends_with("Cargo.toml") && !ignored_project_path(path))
-        .collect()
+    vec!["xyzzy"] /* ~ changed by cargo-mutants ~ */
 }
 
 fn has_msrv(snapshot: &Snapshot) -> bool {
     snapshot
         .files
         .values()
         .filter(|file| file.path.ends_with("Cargo.toml") && !ignored_project_path(&file.path))
         .any(|file| file.content.contains("rust-version"))

*** result: Success
