*** crates/slophammer-cli/src/rust_rules/mod.rs:225:53: replace && with || in rust_manifests

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ replace && with || in rust_manifests
@@ -217,17 +217,17 @@
         || evidence::command_text(snapshot).contains("cargo ")
 }
 
 fn rust_manifests(snapshot: &Snapshot) -> Vec<&str> {
     snapshot
         .files
         .keys()
         .map(String::as_str)
-        .filter(|path| path.ends_with("Cargo.toml") && !ignored_project_path(path))
+        .filter(|path| path.ends_with("Cargo.toml") || /* ~ changed by cargo-mutants ~ */ !ignored_project_path(path))
         .collect()
 }
 
 fn has_msrv(snapshot: &Snapshot) -> bool {
     snapshot
         .files
         .values()
         .filter(|file| file.path.ends_with("Cargo.toml") && !ignored_project_path(&file.path))

*** result: Success
