*** crates/slophammer-cli/src/rust_rules/mod.rs:225:56: delete ! in rust_manifests

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ delete ! in rust_manifests
@@ -217,17 +217,17 @@
         || evidence::command_text(snapshot).contains("cargo ")
 }
 
 fn rust_manifests(snapshot: &Snapshot) -> Vec<&str> {
     snapshot
         .files
         .keys()
         .map(String::as_str)
-        .filter(|path| path.ends_with("Cargo.toml") && !ignored_project_path(path))
+        .filter(|path| path.ends_with("Cargo.toml") &&  /* ~ changed by cargo-mutants ~ */ignored_project_path(path))
         .collect()
 }
 
 fn has_msrv(snapshot: &Snapshot) -> bool {
     snapshot
         .files
         .values()
         .filter(|file| file.path.ends_with("Cargo.toml") && !ignored_project_path(&file.path))

---- rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked stdout ----

thread 'rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked' (1985084) panicked at crates/slophammer-cli/src/rust_rules/boundaries.rs:301:9:
assertion `left == right` failed
  left: 0
 right: 1

---- rust_rules::tests::missing_rust_checks_are_reported stdout ----

thread 'rust_rules::tests::missing_rust_checks_are_reported' (1985100) panicked at crates/slophammer-cli/src/rust_rules/mod.rs:392:9:
assertion failed: findings.iter().any(|finding|
        finding.rule_id == rule_ids::RUST_CHECK_REQUIRED)

---- app::tests::clean_fixture_has_no_findings stdout ----

thread 'app::tests::clean_fixture_has_no_findings' (1985053) panicked at crates/slophammer-cli/src/app.rs:351:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    app::tests::clean_fixture_has_no_findings
    rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked
    rust_rules::tests::missing_rust_checks_are_reported

test result: FAILED. 60 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
