*** crates/slophammer-cli/src/rust_rules/mod.rs:230:5: replace has_msrv -> bool with false

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ replace has_msrv -> bool with false
@@ -222,27 +222,17 @@
         .files
         .keys()
         .map(String::as_str)
         .filter(|path| path.ends_with("Cargo.toml") && !ignored_project_path(path))
         .collect()
 }
 
 fn has_msrv(snapshot: &Snapshot) -> bool {
-    snapshot
-        .files
-        .values()
-        .filter(|file| file.path.ends_with("Cargo.toml") && !ignored_project_path(&file.path))
-        .any(|file| file.content.contains("rust-version"))
-        || snapshot
-            .file("rust-toolchain.toml")
-            .is_some_and(|file| toolchain_declares_version(&file.content))
-        || snapshot
-            .file("rust-toolchain")
-            .is_some_and(|file| toolchain_declares_version(&file.content))
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 fn toolchain_declares_version(content: &str) -> bool {
     content
         .lines()
         .map(strip_inline_comment)
         .map(str::trim)
         .filter(|line| !line.is_empty())

---- rust_rules::tests::plain_rust_toolchain_pin_satisfies_msrv_rule stdout ----

thread 'rust_rules::tests::plain_rust_toolchain_pin_satisfies_msrv_rule' (1986090) panicked at crates/slophammer-cli/src/rust_rules/mod.rs:424:9:
assertion failed: rust_msrv(&snapshot).is_empty()

---- app::tests::clean_fixture_has_no_findings stdout ----

thread 'app::tests::clean_fixture_has_no_findings' (1986042) panicked at crates/slophammer-cli/src/app.rs:351:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    app::tests::clean_fixture_has_no_findings
    rust_rules::tests::plain_rust_toolchain_pin_satisfies_msrv_rule

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
