*** crates/slophammer-cli/src/rust_rules/mod.rs:233:58: replace && with || in has_msrv

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ replace && with || in has_msrv
@@ -225,17 +225,17 @@
         .filter(|path| path.ends_with("Cargo.toml") && !ignored_project_path(path))
         .collect()
 }
 
 fn has_msrv(snapshot: &Snapshot) -> bool {
     snapshot
         .files
         .values()
-        .filter(|file| file.path.ends_with("Cargo.toml") && !ignored_project_path(&file.path))
+        .filter(|file| file.path.ends_with("Cargo.toml") || /* ~ changed by cargo-mutants ~ */ !ignored_project_path(&file.path))
         .any(|file| file.content.contains("rust-version"))
         || snapshot
             .file("rust-toolchain.toml")
             .is_some_and(|file| toolchain_declares_version(&file.content))
         || snapshot
             .file("rust-toolchain")
             .is_some_and(|file| toolchain_declares_version(&file.content))
 }

*** result: Success
