*** crates/slophammer-cli/src/rust_rules/mod.rs:233:61: delete ! in has_msrv

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ delete ! in has_msrv
@@ -225,17 +225,17 @@
         .filter(|path| path.ends_with("Cargo.toml") && !ignored_project_path(path))
         .collect()
 }
 
 fn has_msrv(snapshot: &Snapshot) -> bool {
     snapshot
         .files
         .values()
-        .filter(|file| file.path.ends_with("Cargo.toml") && !ignored_project_path(&file.path))
+        .filter(|file| file.path.ends_with("Cargo.toml") &&  /* ~ changed by cargo-mutants ~ */ignored_project_path(&file.path))
         .any(|file| file.content.contains("rust-version"))
         || snapshot
             .file("rust-toolchain.toml")
             .is_some_and(|file| toolchain_declares_version(&file.content))
         || snapshot
             .file("rust-toolchain")
             .is_some_and(|file| toolchain_declares_version(&file.content))
 }

---- app::tests::clean_fixture_has_no_findings stdout ----

thread 'app::tests::clean_fixture_has_no_findings' (1988002) panicked at crates/slophammer-cli/src/app.rs:351:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    app::tests::clean_fixture_has_no_findings

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
