*** crates/slophammer-cli/src/rust_rules/mod.rs:238:9: replace || with && in has_msrv

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ replace || with && in has_msrv
@@ -230,17 +230,17 @@
     snapshot
         .files
         .values()
         .filter(|file| file.path.ends_with("Cargo.toml") && !ignored_project_path(&file.path))
         .any(|file| file.content.contains("rust-version"))
         || snapshot
             .file("rust-toolchain.toml")
             .is_some_and(|file| toolchain_declares_version(&file.content))
-        || snapshot
+        && /* ~ changed by cargo-mutants ~ */ snapshot
             .file("rust-toolchain")
             .is_some_and(|file| toolchain_declares_version(&file.content))
 }
 
 fn toolchain_declares_version(content: &str) -> bool {
     content
         .lines()
         .map(strip_inline_comment)

---- rust_rules::tests::plain_rust_toolchain_pin_satisfies_msrv_rule stdout ----

thread 'rust_rules::tests::plain_rust_toolchain_pin_satisfies_msrv_rule' (1986574) panicked at crates/slophammer-cli/src/rust_rules/mod.rs:434:9:
assertion failed: rust_msrv(&snapshot).is_empty()

failures:
    rust_rules::tests::plain_rust_toolchain_pin_satisfies_msrv_rule

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
