*** crates/slophammer-cli/src/rust_rules/mod.rs:248:24: delete ! in toolchain_declares_version

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ delete ! in toolchain_declares_version
@@ -240,17 +240,17 @@
             .is_some_and(|file| toolchain_declares_version(&file.content))
 }
 
 fn toolchain_declares_version(content: &str) -> bool {
     content
         .lines()
         .map(strip_inline_comment)
         .map(str::trim)
-        .filter(|line| !line.is_empty())
+        .filter(|line|  /* ~ changed by cargo-mutants ~ */line.is_empty())
         .any(|line| {
             if let Some((key, value)) = line.split_once('=') {
                 key.trim() == "channel" && value.chars().any(|ch| ch.is_ascii_digit())
             } else {
                 line.chars().any(|ch| ch.is_ascii_digit())
             }
         })
 }

---- rust_rules::tests::plain_rust_toolchain_pin_satisfies_msrv_rule stdout ----

thread 'rust_rules::tests::plain_rust_toolchain_pin_satisfies_msrv_rule' (1989527) panicked at crates/slophammer-cli/src/rust_rules/mod.rs:434:9:
assertion failed: rust_msrv(&snapshot).is_empty()

failures:
    rust_rules::tests::plain_rust_toolchain_pin_satisfies_msrv_rule

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
