*** crates/slophammer-cli/src/rust_rules/mod.rs:251:28: replace == with != in toolchain_declares_version

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ replace == with != in toolchain_declares_version
@@ -243,17 +243,17 @@
 fn toolchain_declares_version(content: &str) -> bool {
     content
         .lines()
         .map(strip_inline_comment)
         .map(str::trim)
         .filter(|line| !line.is_empty())
         .any(|line| {
             if let Some((key, value)) = line.split_once('=') {
-                key.trim() == "channel" && value.chars().any(|ch| ch.is_ascii_digit())
+                key.trim() != /* ~ changed by cargo-mutants ~ */ "channel" && value.chars().any(|ch| ch.is_ascii_digit())
             } else {
                 line.chars().any(|ch| ch.is_ascii_digit())
             }
         })
 }
 
 fn has_coverage_gate(snapshot: &Snapshot, minimum: u32) -> bool {
     let evidence = evidence::command_text(snapshot);

*** result: Success
