*** crates/slophammer-cli/src/rust_rules/mod.rs:259:5: replace has_coverage_gate -> bool with false

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ replace has_coverage_gate -> bool with false
@@ -251,21 +251,17 @@
                 key.trim() == "channel" && value.chars().any(|ch| ch.is_ascii_digit())
             } else {
                 line.chars().any(|ch| ch.is_ascii_digit())
             }
         })
 }
 
 fn has_coverage_gate(snapshot: &Snapshot, minimum: u32) -> bool {
-    let evidence = evidence::command_text(snapshot);
-    evidence.contains("cargo llvm-cov")
-        && coverage_thresholds(&evidence)
-            .into_iter()
-            .any(|threshold| threshold >= f64::from(minimum))
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 fn coverage_thresholds(content: &str) -> Vec<f64> {
     let tokens = content.split_whitespace().collect::<Vec<_>>();
     let mut thresholds = Vec::new();
     for (index, token) in tokens.iter().enumerate() {
         if !token.starts_with("--fail-under") {
             continue;

---- rust_rules::tests::accepts_stricter_coverage_thresholds stdout ----

thread 'rust_rules::tests::accepts_stricter_coverage_thresholds' (1991502) panicked at crates/slophammer-cli/src/rust_rules/mod.rs:403:9:
assertion failed: rust_coverage(&snapshot, &config).is_empty()

---- app::tests::clean_fixture_has_no_findings stdout ----

thread 'app::tests::clean_fixture_has_no_findings' (1991457) panicked at crates/slophammer-cli/src/app.rs:351:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    app::tests::clean_fixture_has_no_findings
    rust_rules::tests::accepts_stricter_coverage_thresholds

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
