*** crates/slophammer-cli/src/rust_rules/mod.rs:261:9: replace && with || in has_coverage_gate

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ replace && with || in has_coverage_gate
@@ -253,17 +253,17 @@
                 line.chars().any(|ch| ch.is_ascii_digit())
             }
         })
 }
 
 fn has_coverage_gate(snapshot: &Snapshot, minimum: u32) -> bool {
     let evidence = evidence::command_text(snapshot);
     evidence.contains("cargo llvm-cov")
-        && coverage_thresholds(&evidence)
+        || /* ~ changed by cargo-mutants ~ */ coverage_thresholds(&evidence)
             .into_iter()
             .any(|threshold| threshold >= f64::from(minimum))
 }
 
 fn coverage_thresholds(content: &str) -> Vec<f64> {
     let tokens = content.split_whitespace().collect::<Vec<_>>();
     let mut thresholds = Vec::new();
     for (index, token) in tokens.iter().enumerate() {

*** result: Success
