*** crates/slophammer-cli/src/rust_rules/mod.rs:263:40: replace >= with < in has_coverage_gate

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ replace >= with < in has_coverage_gate
@@ -255,17 +255,17 @@
         })
 }
 
 fn has_coverage_gate(snapshot: &Snapshot, minimum: u32) -> bool {
     let evidence = evidence::command_text(snapshot);
     evidence.contains("cargo llvm-cov")
         && coverage_thresholds(&evidence)
             .into_iter()
-            .any(|threshold| threshold >= f64::from(minimum))
+            .any(|threshold| threshold < /* ~ changed by cargo-mutants ~ */ f64::from(minimum))
 }
 
 fn coverage_thresholds(content: &str) -> Vec<f64> {
     let tokens = content.split_whitespace().collect::<Vec<_>>();
     let mut thresholds = Vec::new();
     for (index, token) in tokens.iter().enumerate() {
         if !token.starts_with("--fail-under") {
             continue;

---- rust_rules::tests::accepts_stricter_coverage_thresholds stdout ----

thread 'rust_rules::tests::accepts_stricter_coverage_thresholds' (1992498) panicked at crates/slophammer-cli/src/rust_rules/mod.rs:407:9:
assertion failed: rust_coverage(&snapshot, &config).is_empty()

---- app::tests::clean_fixture_has_no_findings stdout ----

thread 'app::tests::clean_fixture_has_no_findings' (1992453) panicked at crates/slophammer-cli/src/app.rs:351:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    app::tests::clean_fixture_has_no_findings
    rust_rules::tests::accepts_stricter_coverage_thresholds

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
