*** crates/slophammer-cli/src/rust_rules/mod.rs:267:5: replace coverage_thresholds -> Vec<f64> with vec![]

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ replace coverage_thresholds -> Vec<f64> with vec![]
@@ -259,34 +259,17 @@
     let evidence = evidence::command_text(snapshot);
     evidence.contains("cargo llvm-cov")
         && coverage_thresholds(&evidence)
             .into_iter()
             .any(|threshold| threshold >= f64::from(minimum))
 }
 
 fn coverage_thresholds(content: &str) -> Vec<f64> {
-    let tokens = content.split_whitespace().collect::<Vec<_>>();
-    let mut thresholds = Vec::new();
-    for (index, token) in tokens.iter().enumerate() {
-        if !token.starts_with("--fail-under") {
-            continue;
-        }
-        if let Some((_, value)) = token.split_once('=') {
-            if let Some(threshold) = numeric_prefix(value) {
-                thresholds.push(threshold);
-            }
-        } else if let Some(next) = tokens
-            .get(index + 1)
-            .and_then(|value| numeric_prefix(value))
-        {
-            thresholds.push(next);
-        }
-    }
-    thresholds
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 fn numeric_prefix(value: &str) -> Option<f64> {
     let number = value
         .trim_matches(|ch: char| ch == '"' || ch == '\'')
         .chars()
         .take_while(|ch| ch.is_ascii_digit() || *ch == '.')
         .collect::<String>();

---- rust_rules::tests::accepts_stricter_coverage_thresholds stdout ----

thread 'rust_rules::tests::accepts_stricter_coverage_thresholds' (1992982) panicked at crates/slophammer-cli/src/rust_rules/mod.rs:390:9:
assertion failed: rust_coverage(&snapshot, &config).is_empty()

---- app::tests::clean_fixture_has_no_findings stdout ----

thread 'app::tests::clean_fixture_has_no_findings' (1992937) panicked at crates/slophammer-cli/src/app.rs:351:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    app::tests::clean_fixture_has_no_findings
    rust_rules::tests::accepts_stricter_coverage_thresholds

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
