*** crates/slophammer-cli/src/rust_rules/mod.rs:270:12: delete ! in coverage_thresholds

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ delete ! in coverage_thresholds
@@ -262,17 +262,17 @@
             .into_iter()
             .any(|threshold| threshold >= f64::from(minimum))
 }
 
 fn coverage_thresholds(content: &str) -> Vec<f64> {
     let tokens = content.split_whitespace().collect::<Vec<_>>();
     let mut thresholds = Vec::new();
     for (index, token) in tokens.iter().enumerate() {
-        if !token.starts_with("--fail-under") {
+        if  /* ~ changed by cargo-mutants ~ */token.starts_with("--fail-under") {
             continue;
         }
         if let Some((_, value)) = token.split_once('=') {
             if let Some(threshold) = numeric_prefix(value) {
                 thresholds.push(threshold);
             }
         } else if let Some(next) = tokens
             .get(index + 1)

---- rust_rules::tests::accepts_stricter_coverage_thresholds stdout ----

thread 'rust_rules::tests::accepts_stricter_coverage_thresholds' (1994919) panicked at crates/slophammer-cli/src/rust_rules/mod.rs:407:9:
assertion failed: rust_coverage(&snapshot, &config).is_empty()

---- app::tests::clean_fixture_has_no_findings stdout ----

thread 'app::tests::clean_fixture_has_no_findings' (1994874) panicked at crates/slophammer-cli/src/app.rs:351:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    app::tests::clean_fixture_has_no_findings
    rust_rules::tests::accepts_stricter_coverage_thresholds

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
