*** crates/slophammer-cli/src/rust_rules/mod.rs:278:24: replace + with - in coverage_thresholds

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ replace + with - in coverage_thresholds
@@ -270,17 +270,17 @@
         if !token.starts_with("--fail-under") {
             continue;
         }
         if let Some((_, value)) = token.split_once('=') {
             if let Some(threshold) = numeric_prefix(value) {
                 thresholds.push(threshold);
             }
         } else if let Some(next) = tokens
-            .get(index + 1)
+            .get(index - /* ~ changed by cargo-mutants ~ */ 1)
             .and_then(|value| numeric_prefix(value))
         {
             thresholds.push(next);
         }
     }
     thresholds
 }

---- rust_rules::tests::accepts_stricter_coverage_thresholds stdout ----

thread 'rust_rules::tests::accepts_stricter_coverage_thresholds' (1995407) panicked at crates/slophammer-cli/src/rust_rules/mod.rs:407:9:
assertion failed: rust_coverage(&snapshot, &config).is_empty()

---- app::tests::clean_fixture_has_no_findings stdout ----

thread 'app::tests::clean_fixture_has_no_findings' (1995362) panicked at crates/slophammer-cli/src/app.rs:351:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    app::tests::clean_fixture_has_no_findings
    rust_rules::tests::accepts_stricter_coverage_thresholds

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
