*** crates/slophammer-cli/src/rust_rules/mod.rs:288:5: replace numeric_prefix -> Option<f64> with Some(-1.0)

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ replace numeric_prefix -> Option<f64> with Some(-1.0)
@@ -280,26 +280,17 @@
         {
             thresholds.push(next);
         }
     }
     thresholds
 }
 
 fn numeric_prefix(value: &str) -> Option<f64> {
-    let number = value
-        .trim_matches(|ch: char| ch == '"' || ch == '\'')
-        .chars()
-        .take_while(|ch| ch.is_ascii_digit() || *ch == '.')
-        .collect::<String>();
-    if number.is_empty() {
-        None
-    } else {
-        number.parse::<f64>().ok()
-    }
+    Some(-1.0) /* ~ changed by cargo-mutants ~ */
 }
 
 fn has_complexity_limit(snapshot: &Snapshot, config: &Config) -> bool {
     config
         .rust
         .as_ref()
         .and_then(|rust| rust.complexity.as_ref())
         .is_some_and(|complexity| complexity.cognitive_max <= 8)

---- rust_rules::tests::accepts_stricter_coverage_thresholds stdout ----

thread 'rust_rules::tests::accepts_stricter_coverage_thresholds' (1997831) panicked at crates/slophammer-cli/src/rust_rules/mod.rs:398:9:
assertion failed: rust_coverage(&snapshot, &config).is_empty()

---- app::tests::clean_fixture_has_no_findings stdout ----

thread 'app::tests::clean_fixture_has_no_findings' (1997786) panicked at crates/slophammer-cli/src/app.rs:351:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    app::tests::clean_fixture_has_no_findings
    rust_rules::tests::accepts_stricter_coverage_thresholds

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
