*** crates/slophammer-cli/src/rust_rules/mod.rs:289:37: replace == with != in numeric_prefix

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ replace == with != in numeric_prefix
@@ -281,17 +281,17 @@
             thresholds.push(next);
         }
     }
     thresholds
 }
 
 fn numeric_prefix(value: &str) -> Option<f64> {
     let number = value
-        .trim_matches(|ch: char| ch == '"' || ch == '\'')
+        .trim_matches(|ch: char| ch != /* ~ changed by cargo-mutants ~ */ '"' || ch == '\'')
         .chars()
         .take_while(|ch| ch.is_ascii_digit() || *ch == '.')
         .collect::<String>();
     if number.is_empty() {
         None
     } else {
         number.parse::<f64>().ok()
     }

---- rust_rules::tests::accepts_stricter_coverage_thresholds stdout ----

thread 'rust_rules::tests::accepts_stricter_coverage_thresholds' (1998848) panicked at crates/slophammer-cli/src/rust_rules/mod.rs:407:9:
assertion failed: rust_coverage(&snapshot, &config).is_empty()

---- app::tests::clean_fixture_has_no_findings stdout ----

thread 'app::tests::clean_fixture_has_no_findings' (1998803) panicked at crates/slophammer-cli/src/app.rs:351:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    app::tests::clean_fixture_has_no_findings
    rust_rules::tests::accepts_stricter_coverage_thresholds

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
