*** crates/slophammer-cli/src/rust_rules/mod.rs:289:44: replace || with && in numeric_prefix

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ replace || with && in numeric_prefix
@@ -281,17 +281,17 @@
             thresholds.push(next);
         }
     }
     thresholds
 }
 
 fn numeric_prefix(value: &str) -> Option<f64> {
     let number = value
-        .trim_matches(|ch: char| ch == '"' || ch == '\'')
+        .trim_matches(|ch: char| ch == '"' && /* ~ changed by cargo-mutants ~ */ ch == '\'')
         .chars()
         .take_while(|ch| ch.is_ascii_digit() || *ch == '.')
         .collect::<String>();
     if number.is_empty() {
         None
     } else {
         number.parse::<f64>().ok()
     }

*** result: Success
