*** crates/slophammer-cli/src/rust_rules/mod.rs:291:53: replace == with != in numeric_prefix

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ replace == with != in numeric_prefix
@@ -283,17 +283,17 @@
     }
     thresholds
 }
 
 fn numeric_prefix(value: &str) -> Option<f64> {
     let number = value
         .trim_matches(|ch: char| ch == '"' || ch == '\'')
         .chars()
-        .take_while(|ch| ch.is_ascii_digit() || *ch == '.')
+        .take_while(|ch| ch.is_ascii_digit() || *ch != /* ~ changed by cargo-mutants ~ */ '.')
         .collect::<String>();
     if number.is_empty() {
         None
     } else {
         number.parse::<f64>().ok()
     }
 }

*** result: Success
