*** crates/slophammer-cli/src/rust_rules/mod.rs:301:5: replace has_complexity_limit -> bool with true

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ replace has_complexity_limit -> bool with true
@@ -293,22 +293,17 @@
     if number.is_empty() {
         None
     } else {
         number.parse::<f64>().ok()
     }
 }
 
 fn has_complexity_limit(snapshot: &Snapshot, config: &Config) -> bool {
-    config
-        .rust
-        .as_ref()
-        .and_then(|rust| rust.complexity.as_ref())
-        .is_some_and(|complexity| complexity.cognitive_max <= 8)
-        || has_clippy_complexity_limit(snapshot)
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 fn has_clippy_complexity_limit(snapshot: &Snapshot) -> bool {
     snapshot
         .files
         .values()
         .filter(|file| {
             file.path.ends_with("clippy.toml")

*** result: Success
