*** crates/slophammer-cli/src/rust_rules/mod.rs:301:5: replace has_complexity_limit -> bool with false

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ replace has_complexity_limit -> bool with false
@@ -293,22 +293,17 @@
     if number.is_empty() {
         None
     } else {
         number.parse::<f64>().ok()
     }
 }
 
 fn has_complexity_limit(snapshot: &Snapshot, config: &Config) -> bool {
-    config
-        .rust
-        .as_ref()
-        .and_then(|rust| rust.complexity.as_ref())
-        .is_some_and(|complexity| complexity.cognitive_max <= 8)
-        || has_clippy_complexity_limit(snapshot)
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 fn has_clippy_complexity_limit(snapshot: &Snapshot) -> bool {
     snapshot
         .files
         .values()
         .filter(|file| {
             file.path.ends_with("clippy.toml")

---- rust_rules::tests::configured_complexity_policy_satisfies_complexity_rule stdout ----

thread 'rust_rules::tests::configured_complexity_policy_satisfies_complexity_rule' (2001312) panicked at crates/slophammer-cli/src/rust_rules/mod.rs:413:9:
assertion failed: rust_complexity(&snapshot, &config).is_empty()

---- app::tests::clean_fixture_has_no_findings stdout ----

thread 'app::tests::clean_fixture_has_no_findings' (2001266) panicked at crates/slophammer-cli/src/app.rs:351:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    app::tests::clean_fixture_has_no_findings
    rust_rules::tests::configured_complexity_policy_satisfies_complexity_rule

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
