*** crates/slophammer-cli/src/rust_rules/mod.rs:306:9: replace || with && in has_complexity_limit

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ replace || with && in has_complexity_limit
@@ -298,17 +298,17 @@
 }
 
 fn has_complexity_limit(snapshot: &Snapshot, config: &Config) -> bool {
     config
         .rust
         .as_ref()
         .and_then(|rust| rust.complexity.as_ref())
         .is_some_and(|complexity| complexity.cognitive_max <= 8)
-        || has_clippy_complexity_limit(snapshot)
+        && /* ~ changed by cargo-mutants ~ */ has_clippy_complexity_limit(snapshot)
 }
 
 fn has_clippy_complexity_limit(snapshot: &Snapshot) -> bool {
     snapshot
         .files
         .values()
         .filter(|file| {
             file.path.ends_with("clippy.toml")

---- rust_rules::tests::configured_complexity_policy_satisfies_complexity_rule stdout ----

thread 'rust_rules::tests::configured_complexity_policy_satisfies_complexity_rule' (2001800) panicked at crates/slophammer-cli/src/rust_rules/mod.rs:418:9:
assertion failed: rust_complexity(&snapshot, &config).is_empty()

failures:
    rust_rules::tests::configured_complexity_policy_satisfies_complexity_rule

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
