*** crates/slophammer-cli/src/rust_rules/mod.rs:321:17: replace && with || in has_clippy_complexity_limit

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ replace && with || in has_clippy_complexity_limit
@@ -313,17 +313,17 @@
         .filter(|file| {
             file.path.ends_with("clippy.toml")
                 || file.path.ends_with(".clippy.toml")
                 || file.path.ends_with("rust/clippy.toml")
         })
         .any(|file| {
             let normalized = file.content.to_ascii_lowercase();
             normalized.contains("cognitive-complexity-threshold")
-                && numeric_limit_at_most(&normalized, 8)
+                || /* ~ changed by cargo-mutants ~ */ numeric_limit_at_most(&normalized, 8)
         })
         || snapshot.files.values().any(|file| {
             rust_source_path(&file.path)
                 && file
                     .content
                     .to_ascii_lowercase()
                     .contains("clippy::cognitive_complexity")
         })

*** result: Success
