*** crates/slophammer-cli/src/rust_rules/mod.rs:323:9: replace || with && in has_clippy_complexity_limit

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ replace || with && in has_clippy_complexity_limit
@@ -315,17 +315,17 @@
                 || file.path.ends_with(".clippy.toml")
                 || file.path.ends_with("rust/clippy.toml")
         })
         .any(|file| {
             let normalized = file.content.to_ascii_lowercase();
             normalized.contains("cognitive-complexity-threshold")
                 && numeric_limit_at_most(&normalized, 8)
         })
-        || snapshot.files.values().any(|file| {
+        && /* ~ changed by cargo-mutants ~ */ snapshot.files.values().any(|file| {
             rust_source_path(&file.path)
                 && file
                     .content
                     .to_ascii_lowercase()
                     .contains("clippy::cognitive_complexity")
         })
 }

*** result: Success
