*** crates/slophammer-cli/src/rust_rules/mod.rs:333:5: replace strip_inline_comment -> &str with ""

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ replace strip_inline_comment -> &str with ""
@@ -325,17 +325,17 @@
                 && file
                     .content
                     .to_ascii_lowercase()
                     .contains("clippy::cognitive_complexity")
         })
 }
 
 fn strip_inline_comment(line: &str) -> &str {
-    line.split('#').next().unwrap_or(line)
+    "" /* ~ changed by cargo-mutants ~ */
 }
 
 fn numeric_limit_at_most(content: &str, maximum: u32) -> bool {
     content
         .split(|ch: char| !ch.is_ascii_digit())
         .filter(|part| !part.is_empty())
         .filter_map(|part| part.parse::<u32>().ok())
         .any(|value| value <= maximum)

---- rust_rules::tests::plain_rust_toolchain_pin_satisfies_msrv_rule stdout ----

thread 'rust_rules::tests::plain_rust_toolchain_pin_satisfies_msrv_rule' (2006295) panicked at crates/slophammer-cli/src/rust_rules/mod.rs:434:9:
assertion failed: rust_msrv(&snapshot).is_empty()

failures:
    rust_rules::tests::plain_rust_toolchain_pin_satisfies_msrv_rule

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
