*** crates/slophammer-cli/src/rust_rules/mod.rs:337:5: replace numeric_limit_at_most -> bool with false

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ replace numeric_limit_at_most -> bool with false
@@ -329,21 +329,17 @@
         })
 }
 
 fn strip_inline_comment(line: &str) -> &str {
     line.split('#').next().unwrap_or(line)
 }
 
 fn numeric_limit_at_most(content: &str, maximum: u32) -> bool {
-    content
-        .split(|ch: char| !ch.is_ascii_digit())
-        .filter(|part| !part.is_empty())
-        .filter_map(|part| part.parse::<u32>().ok())
-        .any(|value| value <= maximum)
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 fn rust_source_path(path: &str) -> bool {
     path.ends_with(".rs")
 }
 
 fn ignored_project_path(path: &str) -> bool {
     path.starts_with("fixtures/")

*** result: Success
