*** crates/slophammer-cli/src/rust_rules/mod.rs:341:28: replace <= with > in numeric_limit_at_most

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ replace <= with > in numeric_limit_at_most
@@ -333,17 +333,17 @@
     line.split('#').next().unwrap_or(line)
 }
 
 fn numeric_limit_at_most(content: &str, maximum: u32) -> bool {
     content
         .split(|ch: char| !ch.is_ascii_digit())
         .filter(|part| !part.is_empty())
         .filter_map(|part| part.parse::<u32>().ok())
-        .any(|value| value <= maximum)
+        .any(|value| value > /* ~ changed by cargo-mutants ~ */ maximum)
 }
 
 fn rust_source_path(path: &str) -> bool {
     path.ends_with(".rs")
 }
 
 fn ignored_project_path(path: &str) -> bool {
     path.starts_with("fixtures/")

*** result: Success
