*** crates/slophammer-cli/src/rust_rules/mod.rs:349:5: replace ignored_project_path -> bool with true

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ replace ignored_project_path -> bool with true
@@ -341,21 +341,17 @@
         .any(|value| value <= maximum)
 }
 
 fn rust_source_path(path: &str) -> bool {
     path.ends_with(".rs")
 }
 
 fn ignored_project_path(path: &str) -> bool {
-    path.starts_with("fixtures/")
-        || path.starts_with("templates/")
-        || path.contains("/fixtures/")
-        || path.contains("/target/")
-        || path.contains("/node_modules/")
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use crate::scan::{RepoFile, Snapshot};
     use std::collections::BTreeMap;
     use std::path::PathBuf;

---- rust_rules::unsafe_policy::tests::missing_policy_is_a_finding stdout ----

thread 'rust_rules::unsafe_policy::tests::missing_policy_is_a_finding' (2010774) panicked at crates/slophammer-cli/src/rust_rules/unsafe_policy.rs:141:9:
assertion `left == right` failed
  left: 0
 right: 1

---- rust_rules::tests::missing_rust_checks_are_reported stdout ----

thread 'rust_rules::tests::missing_rust_checks_are_reported' (2010769) panicked at crates/slophammer-cli/src/rust_rules/mod.rs:388:9:
assertion failed: findings.iter().any(|finding|
        finding.rule_id == rule_ids::RUST_CHECK_REQUIRED)

---- rust_rules::unsafe_policy::tests::allow_documented_requires_allow_entry stdout ----

thread 'rust_rules::unsafe_policy::tests::allow_documented_requires_allow_entry' (2010771) panicked at crates/slophammer-cli/src/rust_rules/unsafe_policy.rs:183:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    app::tests::clean_fixture_has_no_findings
    rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked
    rust_rules::suppressions::tests::bare_allow_in_production_code_is_a_finding
    rust_rules::tests::missing_rust_checks_are_reported
    rust_rules::unsafe_policy::tests::allow_documented_requires_allow_entry
    rust_rules::unsafe_policy::tests::missing_policy_is_a_finding

test result: FAILED. 57 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
