*** crates/slophammer-cli/src/rust_rules/mod.rs:349:5: replace ignored_project_path -> bool with false

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ replace ignored_project_path -> bool with false
@@ -341,21 +341,17 @@
         .any(|value| value <= maximum)
 }
 
 fn rust_source_path(path: &str) -> bool {
     path.ends_with(".rs")
 }
 
 fn ignored_project_path(path: &str) -> bool {
-    path.starts_with("fixtures/")
-        || path.starts_with("templates/")
-        || path.contains("/fixtures/")
-        || path.contains("/target/")
-        || path.contains("/node_modules/")
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use crate::scan::{RepoFile, Snapshot};
     use std::collections::BTreeMap;
     use std::path::PathBuf;

*** result: Success
