*** crates/slophammer-cli/src/rust_rules/mod.rs:35:5: replace explain -> Option<String> with Some("xyzzy".into())

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ replace explain -> Option<String> with Some("xyzzy".into())
@@ -27,22 +27,17 @@
         .filter(|id| wanted(id))
     {
         findings.extend(run_rule(rule_id, snapshot, config));
     }
     findings
 }
 
 pub fn explain(rule_id: &str) -> Option<String> {
-    find_definition(&default_definitions(), rule_id).map(|definition| {
-        format!(
-            "{}\n{}\nseverity: {}\npath: {}\n",
-            definition.id, definition.description, definition.severity, definition.path
-        )
-    })
+    Some("xyzzy".into()) /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn known_rule(rule_id: &str) -> bool {
     find_definition(&default_definitions(), rule_id).is_some()
 }
 
 fn run_rule(rule_id: &str, snapshot: &Snapshot, config: &Config) -> Vec<Finding> {
     match rule_id {

---- app::tests::rules_and_explain_are_available stdout ----

thread 'app::tests::rules_and_explain_are_available' (1943813) panicked at crates/slophammer-cli/src/app.rs:425:9:
assertion failed: explanation.stdout.contains("Rust projects should declare cargo check")

failures:
    app::tests::rules_and_explain_are_available

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
