*** crates/slophammer-cli/src/rust_rules/mod.rs:44:5: replace known_rule -> bool with false

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ replace known_rule -> bool with false
@@ -36,17 +36,17 @@
         format!(
             "{}\n{}\nseverity: {}\npath: {}\n",
             definition.id, definition.description, definition.severity, definition.path
         )
     })
 }
 
 pub fn known_rule(rule_id: &str) -> bool {
-    find_definition(&default_definitions(), rule_id).is_some()
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 fn run_rule(rule_id: &str, snapshot: &Snapshot, config: &Config) -> Vec<Finding> {
     match rule_id {
         rule_ids::README_REQUIRED => repo_readme(snapshot),
         rule_ids::AGENTS_REQUIRED => repo_agents(snapshot),
         rule_ids::CI_REQUIRED => repo_ci(snapshot),
         rule_ids::SLOPHAMMER_CI_REQUIRED => repo_slophammer_ci(snapshot),

---- app::tests::check_applies_rule_severity_overrides stdout ----

thread 'app::tests::check_applies_rule_severity_overrides' (1944783) panicked at crates/slophammer-cli/src/app.rs:455:9:
assertion `left == right` failed
  left: 2
 right: 1

---- app::tests::only_rules_accept_comma_separated_ids stdout ----

thread 'app::tests::only_rules_accept_comma_separated_ids' (1944788) panicked at crates/slophammer-cli/src/app.rs:325:9:
assertion `left == right` failed: check failed: unknown rule: repo.readme-required, repo.agents-required

  left: 2
 right: 0

failures:
    app::tests::check_applies_rule_severity_overrides
    app::tests::only_rules_accept_comma_separated_ids

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
