*** crates/slophammer-cli/src/rust_rules/mod.rs:48:5: replace run_rule -> Vec<Finding> with vec![]

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ replace run_rule -> Vec<Finding> with vec![]
@@ -40,40 +40,17 @@
     })
 }
 
 pub fn known_rule(rule_id: &str) -> bool {
     find_definition(&default_definitions(), rule_id).is_some()
 }
 
 fn run_rule(rule_id: &str, snapshot: &Snapshot, config: &Config) -> Vec<Finding> {
-    match rule_id {
-        rule_ids::README_REQUIRED => repo_readme(snapshot),
-        rule_ids::AGENTS_REQUIRED => repo_agents(snapshot),
-        rule_ids::CI_REQUIRED => repo_ci(snapshot),
-        rule_ids::SLOPHAMMER_CI_REQUIRED => repo_slophammer_ci(snapshot),
-        rule_ids::RUST_MANIFEST_REQUIRED => rust_manifest(snapshot),
-        rule_ids::RUST_MSRV_REQUIRED => rust_msrv(snapshot),
-        rule_ids::RUST_CHECK_REQUIRED => cargo_command(snapshot, rule_id, "cargo check"),
-        rule_ids::RUST_FMT_REQUIRED => rust_fmt(snapshot),
-        rule_ids::RUST_CLIPPY_REQUIRED => rust_clippy(snapshot),
-        rule_ids::RUST_TEST_REQUIRED => cargo_command(snapshot, rule_id, "cargo test"),
-        rule_ids::RUST_COVERAGE_REQUIRED => rust_coverage(snapshot, config),
-        rule_ids::RUST_COMPLEXITY_REQUIRED => rust_complexity(snapshot, config),
-        rule_ids::RUST_DRY_REQUIRED => rust_dry_declaration(snapshot),
-        rule_ids::RUST_MUTATION_REQUIRED => cargo_command(snapshot, rule_id, "cargo mutants"),
-        rule_ids::RUST_UNSAFE_POLICY_REQUIRED => unsafe_policy::policy_findings(snapshot, config),
-        rule_ids::RUST_DEPENDENCY_AUDIT_REQUIRED => rust_dependency_audit(snapshot),
-        rule_ids::RUST_DEPENDENCY_BOUNDARIES_REQUIRED => {
-            boundaries::boundary_findings(snapshot, config)
-        }
-        rule_ids::RUST_SUPPRESSIONS_JUSTIFIED => rust_suppressions(snapshot),
-        rule_ids::RUST_SCOPE_INCOMPLETE => scope::scope_findings(snapshot, config),
-        _ => Vec::new(),
-    }
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 fn repo_readme(snapshot: &Snapshot) -> Vec<Finding> {
     missing(
         !snapshot.has_case_insensitive("README.md"),
         rule_ids::README_REQUIRED,
     )
 }

---- rust_rules::tests::missing_rust_checks_are_reported stdout ----

thread 'rust_rules::tests::missing_rust_checks_are_reported' (1945302) panicked at crates/slophammer-cli/src/rust_rules/mod.rs:369:9:
assertion failed: findings.iter().any(|finding|
        finding.rule_id == rule_ids::RUST_CHECK_REQUIRED)

---- app::tests::check_applies_rule_severity_overrides stdout ----

thread 'app::tests::check_applies_rule_severity_overrides' (1945254) panicked at crates/slophammer-cli/src/app.rs:455:9:
assertion `left == right` failed
  left: 0
 right: 1

---- app::tests::rust_failure_fixtures_report_findings stdout ----

thread 'app::tests::rust_failure_fixtures_report_findings' (1945261) panicked at crates/slophammer-cli/src/app.rs:378:13:
assertion `left == right` failed: rust-bad-dependency
  left: 0
 right: 1

failures:
    app::tests::check_applies_rule_severity_overrides
    app::tests::direct_commands_use_report_contract
    app::tests::rust_failure_fixtures_report_findings
    rust_rules::tests::missing_rust_checks_are_reported

test result: FAILED. 59 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
