*** crates/slophammer-cli/src/rust_rules/mod.rs:49:9: delete match arm rule_ids::README_REQUIRED in run_rule

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ delete match arm rule_ids::README_REQUIRED in run_rule
@@ -41,17 +41,17 @@
 }
 
 pub fn known_rule(rule_id: &str) -> bool {
     find_definition(&default_definitions(), rule_id).is_some()
 }
 
 fn run_rule(rule_id: &str, snapshot: &Snapshot, config: &Config) -> Vec<Finding> {
     match rule_id {
-        rule_ids::README_REQUIRED => repo_readme(snapshot),
+         /* ~ changed by cargo-mutants ~ */
         rule_ids::AGENTS_REQUIRED => repo_agents(snapshot),
         rule_ids::CI_REQUIRED => repo_ci(snapshot),
         rule_ids::SLOPHAMMER_CI_REQUIRED => repo_slophammer_ci(snapshot),
         rule_ids::RUST_MANIFEST_REQUIRED => rust_manifest(snapshot),
         rule_ids::RUST_MSRV_REQUIRED => rust_msrv(snapshot),
         rule_ids::RUST_CHECK_REQUIRED => cargo_command(snapshot, rule_id, "cargo check"),
         rule_ids::RUST_FMT_REQUIRED => rust_fmt(snapshot),
         rule_ids::RUST_CLIPPY_REQUIRED => rust_clippy(snapshot),

---- app::tests::check_applies_rule_severity_overrides stdout ----

thread 'app::tests::check_applies_rule_severity_overrides' (1945754) panicked at crates/slophammer-cli/src/app.rs:455:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    app::tests::check_applies_rule_severity_overrides

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
