*** crates/slophammer-cli/src/rust_rules/mod.rs:52:9: delete match arm rule_ids::SLOPHAMMER_CI_REQUIRED in run_rule

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ delete match arm rule_ids::SLOPHAMMER_CI_REQUIRED in run_rule
@@ -44,17 +44,17 @@
     find_definition(&default_definitions(), rule_id).is_some()
 }
 
 fn run_rule(rule_id: &str, snapshot: &Snapshot, config: &Config) -> Vec<Finding> {
     match rule_id {
         rule_ids::README_REQUIRED => repo_readme(snapshot),
         rule_ids::AGENTS_REQUIRED => repo_agents(snapshot),
         rule_ids::CI_REQUIRED => repo_ci(snapshot),
-        rule_ids::SLOPHAMMER_CI_REQUIRED => repo_slophammer_ci(snapshot),
+         /* ~ changed by cargo-mutants ~ */
         rule_ids::RUST_MANIFEST_REQUIRED => rust_manifest(snapshot),
         rule_ids::RUST_MSRV_REQUIRED => rust_msrv(snapshot),
         rule_ids::RUST_CHECK_REQUIRED => cargo_command(snapshot, rule_id, "cargo check"),
         rule_ids::RUST_FMT_REQUIRED => rust_fmt(snapshot),
         rule_ids::RUST_CLIPPY_REQUIRED => rust_clippy(snapshot),
         rule_ids::RUST_TEST_REQUIRED => cargo_command(snapshot, rule_id, "cargo test"),
         rule_ids::RUST_COVERAGE_REQUIRED => rust_coverage(snapshot, config),
         rule_ids::RUST_COMPLEXITY_REQUIRED => rust_complexity(snapshot, config),

*** result: Success
