*** crates/slophammer-cli/src/rust_rules/mod.rs:55:9: delete match arm rule_ids::RUST_CHECK_REQUIRED in run_rule

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ delete match arm rule_ids::RUST_CHECK_REQUIRED in run_rule
@@ -47,17 +47,17 @@
 fn run_rule(rule_id: &str, snapshot: &Snapshot, config: &Config) -> Vec<Finding> {
     match rule_id {
         rule_ids::README_REQUIRED => repo_readme(snapshot),
         rule_ids::AGENTS_REQUIRED => repo_agents(snapshot),
         rule_ids::CI_REQUIRED => repo_ci(snapshot),
         rule_ids::SLOPHAMMER_CI_REQUIRED => repo_slophammer_ci(snapshot),
         rule_ids::RUST_MANIFEST_REQUIRED => rust_manifest(snapshot),
         rule_ids::RUST_MSRV_REQUIRED => rust_msrv(snapshot),
-        rule_ids::RUST_CHECK_REQUIRED => cargo_command(snapshot, rule_id, "cargo check"),
+         /* ~ changed by cargo-mutants ~ */
         rule_ids::RUST_FMT_REQUIRED => rust_fmt(snapshot),
         rule_ids::RUST_CLIPPY_REQUIRED => rust_clippy(snapshot),
         rule_ids::RUST_TEST_REQUIRED => cargo_command(snapshot, rule_id, "cargo test"),
         rule_ids::RUST_COVERAGE_REQUIRED => rust_coverage(snapshot, config),
         rule_ids::RUST_COMPLEXITY_REQUIRED => rust_complexity(snapshot, config),
         rule_ids::RUST_DRY_REQUIRED => rust_dry_declaration(snapshot),
         rule_ids::RUST_MUTATION_REQUIRED => cargo_command(snapshot, rule_id, "cargo mutants"),
         rule_ids::RUST_UNSAFE_POLICY_REQUIRED => unsafe_policy::policy_findings(snapshot, config),

---- rust_rules::tests::missing_rust_checks_are_reported stdout ----

thread 'rust_rules::tests::missing_rust_checks_are_reported' (1948791) panicked at crates/slophammer-cli/src/rust_rules/mod.rs:392:9:
assertion failed: findings.iter().any(|finding|
        finding.rule_id == rule_ids::RUST_CHECK_REQUIRED)

failures:
    rust_rules::tests::missing_rust_checks_are_reported

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
