*** crates/slophammer-cli/src/rust_rules/mod.rs:61:9: delete match arm rule_ids::RUST_DRY_REQUIRED in run_rule

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ delete match arm rule_ids::RUST_DRY_REQUIRED in run_rule
@@ -53,17 +53,17 @@
         rule_ids::RUST_MANIFEST_REQUIRED => rust_manifest(snapshot),
         rule_ids::RUST_MSRV_REQUIRED => rust_msrv(snapshot),
         rule_ids::RUST_CHECK_REQUIRED => cargo_command(snapshot, rule_id, "cargo check"),
         rule_ids::RUST_FMT_REQUIRED => rust_fmt(snapshot),
         rule_ids::RUST_CLIPPY_REQUIRED => rust_clippy(snapshot),
         rule_ids::RUST_TEST_REQUIRED => cargo_command(snapshot, rule_id, "cargo test"),
         rule_ids::RUST_COVERAGE_REQUIRED => rust_coverage(snapshot, config),
         rule_ids::RUST_COMPLEXITY_REQUIRED => rust_complexity(snapshot, config),
-        rule_ids::RUST_DRY_REQUIRED => rust_dry_declaration(snapshot),
+         /* ~ changed by cargo-mutants ~ */
         rule_ids::RUST_MUTATION_REQUIRED => cargo_command(snapshot, rule_id, "cargo mutants"),
         rule_ids::RUST_UNSAFE_POLICY_REQUIRED => unsafe_policy::policy_findings(snapshot, config),
         rule_ids::RUST_DEPENDENCY_AUDIT_REQUIRED => rust_dependency_audit(snapshot),
         rule_ids::RUST_DEPENDENCY_BOUNDARIES_REQUIRED => {
             boundaries::boundary_findings(snapshot, config)
         }
         rule_ids::RUST_SUPPRESSIONS_JUSTIFIED => rust_suppressions(snapshot),
         rule_ids::RUST_SCOPE_INCOMPLETE => scope::scope_findings(snapshot, config),

*** result: Success
