*** crates/slophammer-cli/src/rust_rules/mod.rs:65:9: delete match arm rule_ids::RUST_DEPENDENCY_BOUNDARIES_REQUIRED in run_rule

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ delete match arm rule_ids::RUST_DEPENDENCY_BOUNDARIES_REQUIRED in run_rule
@@ -57,19 +57,17 @@
         rule_ids::RUST_CLIPPY_REQUIRED => rust_clippy(snapshot),
         rule_ids::RUST_TEST_REQUIRED => cargo_command(snapshot, rule_id, "cargo test"),
         rule_ids::RUST_COVERAGE_REQUIRED => rust_coverage(snapshot, config),
         rule_ids::RUST_COMPLEXITY_REQUIRED => rust_complexity(snapshot, config),
         rule_ids::RUST_DRY_REQUIRED => rust_dry_declaration(snapshot),
         rule_ids::RUST_MUTATION_REQUIRED => cargo_command(snapshot, rule_id, "cargo mutants"),
         rule_ids::RUST_UNSAFE_POLICY_REQUIRED => unsafe_policy::policy_findings(snapshot, config),
         rule_ids::RUST_DEPENDENCY_AUDIT_REQUIRED => rust_dependency_audit(snapshot),
-        rule_ids::RUST_DEPENDENCY_BOUNDARIES_REQUIRED => {
-            boundaries::boundary_findings(snapshot, config)
-        }
+         /* ~ changed by cargo-mutants ~ */
         rule_ids::RUST_SUPPRESSIONS_JUSTIFIED => rust_suppressions(snapshot),
         rule_ids::RUST_SCOPE_INCOMPLETE => scope::scope_findings(snapshot, config),
         _ => Vec::new(),
     }
 }
 
 fn repo_readme(snapshot: &Snapshot) -> Vec<Finding> {
     missing(

---- app::tests::direct_commands_use_report_contract stdout ----

thread 'app::tests::direct_commands_use_report_contract' (1953718) panicked at crates/slophammer-cli/src/app.rs:400:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    app::tests::direct_commands_use_report_contract

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
