*** crates/slophammer-cli/src/rust_rules/mod.rs:75:5: replace repo_readme -> Vec<Finding> with vec![]

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ replace repo_readme -> Vec<Finding> with vec![]
@@ -67,20 +67,17 @@
         }
         rule_ids::RUST_SUPPRESSIONS_JUSTIFIED => rust_suppressions(snapshot),
         rule_ids::RUST_SCOPE_INCOMPLETE => scope::scope_findings(snapshot, config),
         _ => Vec::new(),
     }
 }
 
 fn repo_readme(snapshot: &Snapshot) -> Vec<Finding> {
-    missing(
-        !snapshot.has_case_insensitive("README.md"),
-        rule_ids::README_REQUIRED,
-    )
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 fn repo_agents(snapshot: &Snapshot) -> Vec<Finding> {
     missing(
         !snapshot.has_case_insensitive("AGENTS.md"),
         rule_ids::AGENTS_REQUIRED,
     )
 }

---- app::tests::check_applies_rule_severity_overrides stdout ----

thread 'app::tests::check_applies_rule_severity_overrides' (1955220) panicked at crates/slophammer-cli/src/app.rs:455:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    app::tests::check_applies_rule_severity_overrides

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
