*** crates/slophammer-cli/src/rust_rules/mod.rs:76:9: delete ! in repo_readme

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ delete ! in repo_readme
@@ -68,17 +68,17 @@
         rule_ids::RUST_SUPPRESSIONS_JUSTIFIED => rust_suppressions(snapshot),
         rule_ids::RUST_SCOPE_INCOMPLETE => scope::scope_findings(snapshot, config),
         _ => Vec::new(),
     }
 }
 
 fn repo_readme(snapshot: &Snapshot) -> Vec<Finding> {
     missing(
-        !snapshot.has_case_insensitive("README.md"),
+         /* ~ changed by cargo-mutants ~ */snapshot.has_case_insensitive("README.md"),
         rule_ids::README_REQUIRED,
     )
 }
 
 fn repo_agents(snapshot: &Snapshot) -> Vec<Finding> {
     missing(
         !snapshot.has_case_insensitive("AGENTS.md"),
         rule_ids::AGENTS_REQUIRED,

---- app::tests::check_applies_rule_severity_overrides stdout ----

thread 'app::tests::check_applies_rule_severity_overrides' (1955721) panicked at crates/slophammer-cli/src/app.rs:455:9:
assertion `left == right` failed
  left: 0
 right: 1

---- app::tests::only_rules_accept_comma_separated_ids stdout ----

thread 'app::tests::only_rules_accept_comma_separated_ids' (1955726) panicked at crates/slophammer-cli/src/app.rs:325:9:
assertion `left == right` failed: 
  left: 1
 right: 0

---- app::tests::clean_fixture_has_no_findings stdout ----

thread 'app::tests::clean_fixture_has_no_findings' (1955722) panicked at crates/slophammer-cli/src/app.rs:351:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    app::tests::check_applies_rule_severity_overrides
    app::tests::clean_fixture_has_no_findings
    app::tests::only_rules_accept_comma_separated_ids

test result: FAILED. 60 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
