*** crates/slophammer-cli/src/rust_rules/mod.rs:82:5: replace repo_agents -> Vec<Finding> with vec![]

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ replace repo_agents -> Vec<Finding> with vec![]
@@ -74,20 +74,17 @@
 fn repo_readme(snapshot: &Snapshot) -> Vec<Finding> {
     missing(
         !snapshot.has_case_insensitive("README.md"),
         rule_ids::README_REQUIRED,
     )
 }
 
 fn repo_agents(snapshot: &Snapshot) -> Vec<Finding> {
-    missing(
-        !snapshot.has_case_insensitive("AGENTS.md"),
-        rule_ids::AGENTS_REQUIRED,
-    )
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 fn repo_ci(snapshot: &Snapshot) -> Vec<Finding> {
     missing(!snapshot.has_workflow(), rule_ids::CI_REQUIRED)
 }
 
 /// Config without enforcement is decoration: when slophammer.yml is present,
 /// binding CI evidence must invoke a Slophammer checker.

*** result: Success
