*** crates/slophammer-cli/src/rust_rules/mod.rs:83:9: delete ! in repo_agents

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ delete ! in repo_agents
@@ -75,17 +75,17 @@
     missing(
         !snapshot.has_case_insensitive("README.md"),
         rule_ids::README_REQUIRED,
     )
 }
 
 fn repo_agents(snapshot: &Snapshot) -> Vec<Finding> {
     missing(
-        !snapshot.has_case_insensitive("AGENTS.md"),
+         /* ~ changed by cargo-mutants ~ */snapshot.has_case_insensitive("AGENTS.md"),
         rule_ids::AGENTS_REQUIRED,
     )
 }
 
 fn repo_ci(snapshot: &Snapshot) -> Vec<Finding> {
     missing(!snapshot.has_workflow(), rule_ids::CI_REQUIRED)
 }

---- app::tests::only_rules_accept_comma_separated_ids stdout ----

thread 'app::tests::only_rules_accept_comma_separated_ids' (1956727) panicked at crates/slophammer-cli/src/app.rs:325:9:
assertion `left == right` failed: 
  left: 1
 right: 0

---- app::tests::clean_fixture_has_no_findings stdout ----

thread 'app::tests::clean_fixture_has_no_findings' (1956723) panicked at crates/slophammer-cli/src/app.rs:351:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    app::tests::clean_fixture_has_no_findings
    app::tests::only_rules_accept_comma_separated_ids

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
