*** crates/slophammer-cli/src/rust_rules/mod.rs:89:13: delete ! in repo_ci

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ delete ! in repo_ci
@@ -81,17 +81,17 @@
 fn repo_agents(snapshot: &Snapshot) -> Vec<Finding> {
     missing(
         !snapshot.has_case_insensitive("AGENTS.md"),
         rule_ids::AGENTS_REQUIRED,
     )
 }
 
 fn repo_ci(snapshot: &Snapshot) -> Vec<Finding> {
-    missing(!snapshot.has_workflow(), rule_ids::CI_REQUIRED)
+    missing( /* ~ changed by cargo-mutants ~ */snapshot.has_workflow(), rule_ids::CI_REQUIRED)
 }
 
 /// Config without enforcement is decoration: when slophammer.yml is present,
 /// binding CI evidence must invoke a Slophammer checker.
 fn repo_slophammer_ci(snapshot: &Snapshot) -> Vec<Finding> {
     let has_config =
         snapshot.file("slophammer.yml").is_some() || snapshot.file("slophammer.yaml").is_some();
     missing(

---- app::tests::clean_fixture_has_no_findings stdout ----

thread 'app::tests::clean_fixture_has_no_findings' (1957720) panicked at crates/slophammer-cli/src/app.rs:351:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    app::tests::clean_fixture_has_no_findings

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
