*** crates/slophammer-cli/src/rust_rules/mod.rs:89:5: replace repo_ci -> Vec<Finding> with vec![]

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ replace repo_ci -> Vec<Finding> with vec![]
@@ -81,17 +81,17 @@
 fn repo_agents(snapshot: &Snapshot) -> Vec<Finding> {
     missing(
         !snapshot.has_case_insensitive("AGENTS.md"),
         rule_ids::AGENTS_REQUIRED,
     )
 }
 
 fn repo_ci(snapshot: &Snapshot) -> Vec<Finding> {
-    missing(!snapshot.has_workflow(), rule_ids::CI_REQUIRED)
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 /// Config without enforcement is decoration: when slophammer.yml is present,
 /// binding CI evidence must invoke a Slophammer checker.
 fn repo_slophammer_ci(snapshot: &Snapshot) -> Vec<Finding> {
     let has_config =
         snapshot.file("slophammer.yml").is_some() || snapshot.file("slophammer.yaml").is_some();
     missing(

*** result: Success
