*** crates/slophammer-cli/src/rust_rules/mod.rs:95:5: replace repo_slophammer_ci -> Vec<Finding> with vec![]

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ replace repo_slophammer_ci -> Vec<Finding> with vec![]
@@ -87,22 +87,17 @@
 
 fn repo_ci(snapshot: &Snapshot) -> Vec<Finding> {
     missing(!snapshot.has_workflow(), rule_ids::CI_REQUIRED)
 }
 
 /// Config without enforcement is decoration: when slophammer.yml is present,
 /// binding CI evidence must invoke a Slophammer checker.
 fn repo_slophammer_ci(snapshot: &Snapshot) -> Vec<Finding> {
-    let has_config =
-        snapshot.file("slophammer.yml").is_some() || snapshot.file("slophammer.yaml").is_some();
-    missing(
-        has_config && !slophammer_invocation(&evidence::command_text(snapshot)),
-        rule_ids::SLOPHAMMER_CI_REQUIRED,
-    )
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 fn slophammer_invocation(evidence: &str) -> bool {
     if evidence.contains("uses: dutifuldev/slophammer@") {
         return true;
     }
     [
         "slophammer-go",

*** result: Success
