*** crates/slophammer-cli/src/rust_rules/mod.rs:96:51: replace || with && in repo_slophammer_ci

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ replace || with && in repo_slophammer_ci
@@ -88,17 +88,17 @@
 fn repo_ci(snapshot: &Snapshot) -> Vec<Finding> {
     missing(!snapshot.has_workflow(), rule_ids::CI_REQUIRED)
 }
 
 /// Config without enforcement is decoration: when slophammer.yml is present,
 /// binding CI evidence must invoke a Slophammer checker.
 fn repo_slophammer_ci(snapshot: &Snapshot) -> Vec<Finding> {
     let has_config =
-        snapshot.file("slophammer.yml").is_some() || snapshot.file("slophammer.yaml").is_some();
+        snapshot.file("slophammer.yml").is_some() && /* ~ changed by cargo-mutants ~ */ snapshot.file("slophammer.yaml").is_some();
     missing(
         has_config && !slophammer_invocation(&evidence::command_text(snapshot)),
         rule_ids::SLOPHAMMER_CI_REQUIRED,
     )
 }
 
 fn slophammer_invocation(evidence: &str) -> bool {
     if evidence.contains("uses: dutifuldev/slophammer@") {

*** result: Success
