*** crates/slophammer-cli/src/rust_rules/mod.rs:98:20: replace && with || in repo_slophammer_ci

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/mod.rs
+++ replace && with || in repo_slophammer_ci
@@ -90,17 +90,17 @@
 }
 
 /// Config without enforcement is decoration: when slophammer.yml is present,
 /// binding CI evidence must invoke a Slophammer checker.
 fn repo_slophammer_ci(snapshot: &Snapshot) -> Vec<Finding> {
     let has_config =
         snapshot.file("slophammer.yml").is_some() || snapshot.file("slophammer.yaml").is_some();
     missing(
-        has_config && !slophammer_invocation(&evidence::command_text(snapshot)),
+        has_config || /* ~ changed by cargo-mutants ~ */ !slophammer_invocation(&evidence::command_text(snapshot)),
         rule_ids::SLOPHAMMER_CI_REQUIRED,
     )
 }
 
 fn slophammer_invocation(evidence: &str) -> bool {
     if evidence.contains("uses: dutifuldev/slophammer@") {
         return true;
     }

---- app::tests::clean_fixture_has_no_findings stdout ----

thread 'app::tests::clean_fixture_has_no_findings' (1959221) panicked at crates/slophammer-cli/src/app.rs:351:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    app::tests::clean_fixture_has_no_findings

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
