*** crates/slophammer-cli/src/rust_rules/scope.rs:101:24: delete ! in production_rust_files

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/scope.rs
+++ delete ! in production_rust_files
@@ -93,17 +93,17 @@
     patterns
 }
 
 fn production_rust_files(snapshot: &Snapshot) -> Vec<String> {
     snapshot
         .files
         .keys()
         .filter(|path| path.ends_with(".rs"))
-        .filter(|path| !conventional_path(path))
+        .filter(|path|  /* ~ changed by cargo-mutants ~ */conventional_path(path))
         .cloned()
         .collect()
 }
 
 /// Path-level form of the conventional non-production list in
 /// specs/CONFIG.md.
 fn conventional_path(path: &str) -> bool {
     const DIRS: [&str; 12] = [

---- rust_rules::scope::tests::mutation_excludes_cover_out_of_scope_production_files stdout ----

thread 'rust_rules::scope::tests::mutation_excludes_cover_out_of_scope_production_files' (2155095) panicked at crates/slophammer-cli/src/rust_rules/scope.rs:234:9:
assertion `left == right` failed
  left: 0
 right: 1

---- rust_rules::scope::tests::mutation_targets_extend_configured_scope stdout ----

thread 'rust_rules::scope::tests::mutation_targets_extend_configured_scope' (2155097) panicked at crates/slophammer-cli/src/rust_rules/scope.rs:251:9:
assertion `left == right` failed
  left: Some((0, 0))
 right: Some((2, 2))

failures:
    rust_rules::scope::tests::mutation_excludes_cover_out_of_scope_production_files
    rust_rules::scope::tests::mutation_targets_extend_configured_scope

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
