*** crates/slophammer-cli/src/rust_rules/scope.rs:109:5: replace conventional_path -> bool with true

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/scope.rs
+++ replace conventional_path -> bool with true
@@ -101,34 +101,17 @@
         .filter(|path| !conventional_path(path))
         .cloned()
         .collect()
 }
 
 /// Path-level form of the conventional non-production list in
 /// specs/CONFIG.md.
 fn conventional_path(path: &str) -> bool {
-    const DIRS: [&str; 12] = [
-        "tests",
-        "fixtures",
-        "templates",
-        "testdata",
-        "dist",
-        "build",
-        "coverage",
-        "target",
-        "node_modules",
-        "vendor",
-        "scripts",
-        "benches",
-    ];
-    if path.ends_with("_test.rs") || path.contains("generated") {
-        return true;
-    }
-    path.split('/').any(|segment| DIRS.contains(&segment))
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 fn parent_dir(path: &str) -> String {
     match path.rsplit_once('/') {
         Some((dir, _)) => dir.to_owned(),
         None => ".".to_owned(),
     }
 }

---- rust_rules::scope::tests::mutation_excludes_cover_out_of_scope_production_files stdout ----

thread 'rust_rules::scope::tests::mutation_excludes_cover_out_of_scope_production_files' (2156026) panicked at crates/slophammer-cli/src/rust_rules/scope.rs:217:9:
assertion `left == right` failed
  left: 0
 right: 1

---- rust_rules::scope::tests::mutation_targets_extend_configured_scope stdout ----

thread 'rust_rules::scope::tests::mutation_targets_extend_configured_scope' (2156027) panicked at crates/slophammer-cli/src/rust_rules/scope.rs:234:9:
assertion `left == right` failed
  left: Some((0, 0))
 right: Some((2, 2))

failures:
    rust_rules::scope::tests::mutation_excludes_cover_out_of_scope_production_files
    rust_rules::scope::tests::mutation_targets_extend_configured_scope

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
