*** crates/slophammer-cli/src/rust_rules/scope.rs:109:5: replace conventional_path -> bool with false

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/scope.rs
+++ replace conventional_path -> bool with false
@@ -101,34 +101,17 @@
         .filter(|path| !conventional_path(path))
         .cloned()
         .collect()
 }
 
 /// Path-level form of the conventional non-production list in
 /// specs/CONFIG.md.
 fn conventional_path(path: &str) -> bool {
-    const DIRS: [&str; 12] = [
-        "tests",
-        "fixtures",
-        "templates",
-        "testdata",
-        "dist",
-        "build",
-        "coverage",
-        "target",
-        "node_modules",
-        "vendor",
-        "scripts",
-        "benches",
-    ];
-    if path.ends_with("_test.rs") || path.contains("generated") {
-        return true;
-    }
-    path.split('/').any(|segment| DIRS.contains(&segment))
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 fn parent_dir(path: &str) -> String {
     match path.rsplit_once('/') {
         Some((dir, _)) => dir.to_owned(),
         None => ".".to_owned(),
     }
 }

*** result: Success
