*** crates/slophammer-cli/src/rust_rules/scope.rs:12:5: replace scope_findings -> Vec<Finding> with vec![]

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/scope.rs
+++ replace scope_findings -> Vec<Finding> with vec![]
@@ -4,33 +4,17 @@
 use crate::scan::Snapshot;
 use globset::{Glob, GlobSet, GlobSetBuilder};
 
 /// Configured scope must account for every production Rust file: each one is
 /// either inside a configured paths/targets scope or covered by an exclude
 /// (conventional or reasoned). Anything else is a finding, so narrowing scope
 /// cannot hide code from checking.
 pub fn scope_findings(snapshot: &Snapshot, config: &Config) -> Vec<Finding> {
-    let Some(rust) = &config.rust else {
-        return Vec::new();
-    };
-    let scopes = configured_scopes(rust);
-    if scopes.is_empty() {
-        return Vec::new();
-    }
-    let uncovered = uncovered_production_dirs(snapshot, config, &scopes);
-    if uncovered.is_empty() {
-        return Vec::new();
-    }
-    let template = definition(rule_ids::RUST_SCOPE_INCOMPLETE);
-    vec![Finding::with_message(
-        template,
-        template.path,
-        format!("{}: {}", template.message, uncovered.join(", ")),
-    )]
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 /// Scope coverage counts for the report: production files the configured
 /// scope covers versus all production files. None when no scope is
 /// configured.
 pub fn scope_counts(snapshot: &Snapshot, config: &Config) -> Option<(usize, usize)> {
     let rust = config.rust.as_ref()?;
     let scopes = configured_scopes(rust);

---- rust_rules::scope::tests::mutation_excludes_cover_out_of_scope_production_files stdout ----

thread 'rust_rules::scope::tests::mutation_excludes_cover_out_of_scope_production_files' (2134512) panicked at crates/slophammer-cli/src/rust_rules/scope.rs:218:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    rust_rules::scope::tests::mutation_excludes_cover_out_of_scope_production_files

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
