*** crates/slophammer-cli/src/rust_rules/scope.rs:130:5: replace parent_dir -> String with String::new()

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/scope.rs
+++ replace parent_dir -> String with String::new()
@@ -122,20 +122,17 @@
     ];
     if path.ends_with("_test.rs") || path.contains("generated") {
         return true;
     }
     path.split('/').any(|segment| DIRS.contains(&segment))
 }
 
 fn parent_dir(path: &str) -> String {
-    match path.rsplit_once('/') {
-        Some((dir, _)) => dir.to_owned(),
-        None => ".".to_owned(),
-    }
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn rust_files(snapshot: &Snapshot, paths: &[String], excludes: &[String]) -> Vec<String> {
     let exclude_set = globset(excludes);
     snapshot
         .files
         .keys()
         .filter(|path| path.ends_with(".rs"))

*** result: Success
