*** crates/slophammer-cli/src/rust_rules/scope.rs:137:5: replace rust_files -> Vec<String> with vec![String::new()]

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/scope.rs
+++ replace rust_files -> Vec<String> with vec![String::new()]
@@ -129,30 +129,17 @@
 fn parent_dir(path: &str) -> String {
     match path.rsplit_once('/') {
         Some((dir, _)) => dir.to_owned(),
         None => ".".to_owned(),
     }
 }
 
 pub fn rust_files(snapshot: &Snapshot, paths: &[String], excludes: &[String]) -> Vec<String> {
-    let exclude_set = globset(excludes);
-    snapshot
-        .files
-        .keys()
-        .filter(|path| path.ends_with(".rs"))
-        .filter(|path| in_targets(path, paths))
-        .filter(|path| !default_excluded(path))
-        .filter(|path| {
-            exclude_set
-                .as_ref()
-                .is_none_or(|set| !set.is_match(path.as_str()))
-        })
-        .cloned()
-        .collect()
+    vec![String::new()] /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn configured_rust_files(snapshot: &Snapshot, config: &Config) -> Vec<String> {
     rust_files(
         snapshot,
         &crate::config::rust_targets(config),
         &crate::config::rust_exclude(config),
     )

---- rust_rules::unsafe_policy::tests::allow_documented_requires_allow_entry stdout ----

thread 'rust_rules::unsafe_policy::tests::allow_documented_requires_allow_entry' (2162252) panicked at crates/slophammer-cli/src/rust_rules/unsafe_policy.rs:183:9:
assertion `left == right` failed
  left: 0
 right: 1

---- rust_rules::dry::tests::detects_same_file_copied_blocks stdout ----

thread 'rust_rules::dry::tests::detects_same_file_copied_blocks' (2162236) panicked at crates/slophammer-cli/src/rust_rules/dry.rs:148:9:
assertion `left == right` failed
  left: 0
 right: 1

---- app::tests::direct_commands_use_report_contract stdout ----

thread 'app::tests::direct_commands_use_report_contract' (2162205) panicked at crates/slophammer-cli/src/app.rs:413:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    app::tests::direct_commands_use_report_contract
    app::tests::rust_failure_fixtures_report_findings
    rust_rules::dry::tests::detects_same_file_copied_blocks
    rust_rules::unsafe_policy::tests::allow_documented_requires_allow_entry

test result: FAILED. 59 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
