*** crates/slophammer-cli/src/rust_rules/scope.rs:143:24: delete ! in rust_files

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/scope.rs
+++ delete ! in rust_files
@@ -135,17 +135,17 @@
 
 pub fn rust_files(snapshot: &Snapshot, paths: &[String], excludes: &[String]) -> Vec<String> {
     let exclude_set = globset(excludes);
     snapshot
         .files
         .keys()
         .filter(|path| path.ends_with(".rs"))
         .filter(|path| in_targets(path, paths))
-        .filter(|path| !default_excluded(path))
+        .filter(|path|  /* ~ changed by cargo-mutants ~ */default_excluded(path))
         .filter(|path| {
             exclude_set
                 .as_ref()
                 .is_none_or(|set| !set.is_match(path.as_str()))
         })
         .cloned()
         .collect()
 }

---- rust_rules::dry::tests::detects_same_file_copied_blocks stdout ----

thread 'rust_rules::dry::tests::detects_same_file_copied_blocks' (2164171) panicked at crates/slophammer-cli/src/rust_rules/dry.rs:148:9:
assertion `left == right` failed
  left: 0
 right: 1

---- rust_rules::unsafe_policy::tests::allow_documented_requires_allow_entry stdout ----

thread 'rust_rules::unsafe_policy::tests::allow_documented_requires_allow_entry' (2164187) panicked at crates/slophammer-cli/src/rust_rules/unsafe_policy.rs:183:9:
assertion `left == right` failed
  left: 0
 right: 1

---- app::tests::direct_commands_use_report_contract stdout ----

thread 'app::tests::direct_commands_use_report_contract' (2164138) panicked at crates/slophammer-cli/src/app.rs:413:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    app::tests::direct_commands_use_report_contract
    app::tests::rust_failure_fixtures_report_findings
    rust_rules::dry::tests::detects_same_file_copied_blocks
    rust_rules::unsafe_policy::tests::allow_documented_requires_allow_entry

test result: FAILED. 59 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
