*** crates/slophammer-cli/src/rust_rules/scope.rs:154:5: replace configured_rust_files -> Vec<String> with vec!["xyzzy".into()]

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/scope.rs
+++ replace configured_rust_files -> Vec<String> with vec!["xyzzy".into()]
@@ -146,21 +146,17 @@
                 .as_ref()
                 .is_none_or(|set| !set.is_match(path.as_str()))
         })
         .cloned()
         .collect()
 }
 
 pub fn configured_rust_files(snapshot: &Snapshot, config: &Config) -> Vec<String> {
-    rust_files(
-        snapshot,
-        &crate::config::rust_targets(config),
-        &crate::config::rust_exclude(config),
-    )
+    vec!["xyzzy".into()] /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn dry_rust_files(snapshot: &Snapshot, config: &Config) -> Vec<String> {
     rust_files(
         snapshot,
         &crate::config::rust_dry_paths(config),
         &crate::config::rust_dry_exclude(config),
     )

---- rust_rules::unsafe_policy::tests::allow_documented_requires_allow_entry stdout ----

thread 'rust_rules::unsafe_policy::tests::allow_documented_requires_allow_entry' (2168293) panicked at crates/slophammer-cli/src/rust_rules/unsafe_policy.rs:183:9:
assertion `left == right` failed
  left: 0
 right: 1

---- app::tests::direct_commands_use_report_contract stdout ----

thread 'app::tests::direct_commands_use_report_contract' (2168235) panicked at crates/slophammer-cli/src/app.rs:413:9:
assertion `left == right` failed
  left: 0
 right: 1

---- app::tests::rust_failure_fixtures_report_findings stdout ----

thread 'app::tests::rust_failure_fixtures_report_findings' (2168239) panicked at crates/slophammer-cli/src/app.rs:378:13:
assertion `left == right` failed: rust-unsafe
  left: 0
 right: 1

failures:
    app::tests::direct_commands_use_report_contract
    app::tests::rust_failure_fixtures_report_findings
    rust_rules::unsafe_policy::tests::allow_documented_requires_allow_entry

test result: FAILED. 60 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
