*** crates/slophammer-cli/src/rust_rules/scope.rs:162:5: replace dry_rust_files -> Vec<String> with vec!["xyzzy".into()]

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/scope.rs
+++ replace dry_rust_files -> Vec<String> with vec!["xyzzy".into()]
@@ -154,21 +154,17 @@
     rust_files(
         snapshot,
         &crate::config::rust_targets(config),
         &crate::config::rust_exclude(config),
     )
 }
 
 pub fn dry_rust_files(snapshot: &Snapshot, config: &Config) -> Vec<String> {
-    rust_files(
-        snapshot,
-        &crate::config::rust_dry_paths(config),
-        &crate::config::rust_dry_exclude(config),
-    )
+    vec!["xyzzy".into()] /* ~ changed by cargo-mutants ~ */
 }
 
 fn in_targets(path: &str, targets: &[String]) -> bool {
     targets.is_empty()
         || targets.iter().any(|target| {
             let normalized = target.trim_end_matches('/');
             normalized == "." || path == normalized || path.starts_with(&format!("{normalized}/"))
         })

---- rust_rules::dry::tests::detects_same_file_copied_blocks stdout ----

thread 'rust_rules::dry::tests::detects_same_file_copied_blocks' (2171161) panicked at crates/slophammer-cli/src/rust_rules/dry.rs:148:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    rust_rules::dry::tests::detects_same_file_copied_blocks

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
