*** crates/slophammer-cli/src/rust_rules/scope.rs:170:5: replace in_targets -> bool with true

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/scope.rs
+++ replace in_targets -> bool with true
@@ -162,21 +162,17 @@
     rust_files(
         snapshot,
         &crate::config::rust_dry_paths(config),
         &crate::config::rust_dry_exclude(config),
     )
 }
 
 fn in_targets(path: &str, targets: &[String]) -> bool {
-    targets.is_empty()
-        || targets.iter().any(|target| {
-            let normalized = target.trim_end_matches('/');
-            normalized == "." || path == normalized || path.starts_with(&format!("{normalized}/"))
-        })
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 fn default_excluded(path: &str) -> bool {
     path.starts_with("fixtures/")
         || path.starts_with("templates/")
         || path.contains("/fixtures/")
         || path.contains("/target/")
         || path.contains("/node_modules/")

---- rust_rules::scope::tests::mutation_excludes_cover_out_of_scope_production_files stdout ----

thread 'rust_rules::scope::tests::mutation_excludes_cover_out_of_scope_production_files' (2172024) panicked at crates/slophammer-cli/src/rust_rules/scope.rs:230:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    rust_rules::scope::tests::mutation_excludes_cover_out_of_scope_production_files

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
