*** crates/slophammer-cli/src/rust_rules/scope.rs:173:39: replace == with != in in_targets

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/scope.rs
+++ replace == with != in in_targets
@@ -165,17 +165,17 @@
         &crate::config::rust_dry_exclude(config),
     )
 }
 
 fn in_targets(path: &str, targets: &[String]) -> bool {
     targets.is_empty()
         || targets.iter().any(|target| {
             let normalized = target.trim_end_matches('/');
-            normalized == "." || path == normalized || path.starts_with(&format!("{normalized}/"))
+            normalized == "." || path != /* ~ changed by cargo-mutants ~ */ normalized || path.starts_with(&format!("{normalized}/"))
         })
 }
 
 fn default_excluded(path: &str) -> bool {
     path.starts_with("fixtures/")
         || path.starts_with("templates/")
         || path.contains("/fixtures/")
         || path.contains("/target/")

---- rust_rules::scope::tests::mutation_excludes_cover_out_of_scope_production_files stdout ----

thread 'rust_rules::scope::tests::mutation_excludes_cover_out_of_scope_production_files' (2178074) panicked at crates/slophammer-cli/src/rust_rules/scope.rs:234:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    rust_rules::scope::tests::mutation_excludes_cover_out_of_scope_production_files

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
