*** crates/slophammer-cli/src/rust_rules/scope.rs:173:53: replace || with && in in_targets

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/scope.rs
+++ replace || with && in in_targets
@@ -165,17 +165,17 @@
         &crate::config::rust_dry_exclude(config),
     )
 }
 
 fn in_targets(path: &str, targets: &[String]) -> bool {
     targets.is_empty()
         || targets.iter().any(|target| {
             let normalized = target.trim_end_matches('/');
-            normalized == "." || path == normalized || path.starts_with(&format!("{normalized}/"))
+            normalized == "." || path == normalized && /* ~ changed by cargo-mutants ~ */ path.starts_with(&format!("{normalized}/"))
         })
 }
 
 fn default_excluded(path: &str) -> bool {
     path.starts_with("fixtures/")
         || path.starts_with("templates/")
         || path.contains("/fixtures/")
         || path.contains("/target/")

---- rust_rules::unsafe_policy::tests::allow_documented_requires_allow_entry stdout ----

thread 'rust_rules::unsafe_policy::tests::allow_documented_requires_allow_entry' (2175040) panicked at crates/slophammer-cli/src/rust_rules/unsafe_policy.rs:183:9:
assertion `left == right` failed
  left: 0
 right: 1

---- rust_rules::dry::tests::detects_same_file_copied_blocks stdout ----

thread 'rust_rules::dry::tests::detects_same_file_copied_blocks' (2175024) panicked at crates/slophammer-cli/src/rust_rules/dry.rs:148:9:
assertion `left == right` failed
  left: 0
 right: 1

---- rust_rules::scope::tests::mutation_targets_extend_configured_scope stdout ----

thread 'rust_rules::scope::tests::mutation_targets_extend_configured_scope' (2175032) panicked at crates/slophammer-cli/src/rust_rules/scope.rs:250:9:
assertion failed: scope_findings(&repo, &config).is_empty()

failures:
    app::tests::clean_fixture_has_no_findings
    app::tests::direct_commands_use_report_contract
    rust_rules::dry::tests::detects_same_file_copied_blocks
    rust_rules::scope::tests::mutation_excludes_cover_out_of_scope_production_files
    rust_rules::scope::tests::mutation_targets_extend_configured_scope
    rust_rules::unsafe_policy::tests::allow_documented_requires_allow_entry

test result: FAILED. 57 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
