*** crates/slophammer-cli/src/rust_rules/scope.rs:178:5: replace default_excluded -> bool with true

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/scope.rs
+++ replace default_excluded -> bool with true
@@ -170,22 +170,17 @@
     targets.is_empty()
         || targets.iter().any(|target| {
             let normalized = target.trim_end_matches('/');
             normalized == "." || path == normalized || path.starts_with(&format!("{normalized}/"))
         })
 }
 
 fn default_excluded(path: &str) -> bool {
-    path.starts_with("fixtures/")
-        || path.starts_with("templates/")
-        || path.contains("/fixtures/")
-        || path.contains("/target/")
-        || path.contains("/node_modules/")
-        || path.ends_with("_test.rs")
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 fn globset(patterns: &[String]) -> Option<GlobSet> {
     if patterns.is_empty() {
         return None;
     }
     let mut builder = GlobSetBuilder::new();
     for pattern in patterns {

---- rust_rules::dry::tests::detects_same_file_copied_blocks stdout ----

thread 'rust_rules::dry::tests::detects_same_file_copied_blocks' (2179185) panicked at crates/slophammer-cli/src/rust_rules/dry.rs:148:9:
assertion `left == right` failed
  left: 0
 right: 1

---- rust_rules::unsafe_policy::tests::allow_documented_requires_allow_entry stdout ----

thread 'rust_rules::unsafe_policy::tests::allow_documented_requires_allow_entry' (2179202) panicked at crates/slophammer-cli/src/rust_rules/unsafe_policy.rs:183:9:
assertion `left == right` failed
  left: 0
 right: 1

---- app::tests::direct_commands_use_report_contract stdout ----

thread 'app::tests::direct_commands_use_report_contract' (2179153) panicked at crates/slophammer-cli/src/app.rs:413:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    app::tests::direct_commands_use_report_contract
    app::tests::rust_failure_fixtures_report_findings
    rust_rules::dry::tests::detects_same_file_copied_blocks
    rust_rules::unsafe_policy::tests::allow_documented_requires_allow_entry

test result: FAILED. 59 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
