*** crates/slophammer-cli/src/rust_rules/scope.rs:179:9: replace || with && in default_excluded

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/scope.rs
+++ replace || with && in default_excluded
@@ -171,17 +171,17 @@
         || targets.iter().any(|target| {
             let normalized = target.trim_end_matches('/');
             normalized == "." || path == normalized || path.starts_with(&format!("{normalized}/"))
         })
 }
 
 fn default_excluded(path: &str) -> bool {
     path.starts_with("fixtures/")
-        || path.starts_with("templates/")
+        && /* ~ changed by cargo-mutants ~ */ path.starts_with("templates/")
         || path.contains("/fixtures/")
         || path.contains("/target/")
         || path.contains("/node_modules/")
         || path.ends_with("_test.rs")
 }
 
 fn globset(patterns: &[String]) -> Option<GlobSet> {
     if patterns.is_empty() {

*** result: Success
