*** crates/slophammer-cli/src/rust_rules/scope.rs:181:9: replace || with && in default_excluded

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/scope.rs
+++ replace || with && in default_excluded
@@ -173,17 +173,17 @@
             normalized == "." || path == normalized || path.starts_with(&format!("{normalized}/"))
         })
 }
 
 fn default_excluded(path: &str) -> bool {
     path.starts_with("fixtures/")
         || path.starts_with("templates/")
         || path.contains("/fixtures/")
-        || path.contains("/target/")
+        && /* ~ changed by cargo-mutants ~ */ path.contains("/target/")
         || path.contains("/node_modules/")
         || path.ends_with("_test.rs")
 }
 
 fn globset(patterns: &[String]) -> Option<GlobSet> {
     if patterns.is_empty() {
         return None;
     }

*** result: Success
