*** crates/slophammer-cli/src/rust_rules/scope.rs:183:9: replace || with && in default_excluded

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/scope.rs
+++ replace || with && in default_excluded
@@ -175,17 +175,17 @@
 }
 
 fn default_excluded(path: &str) -> bool {
     path.starts_with("fixtures/")
         || path.starts_with("templates/")
         || path.contains("/fixtures/")
         || path.contains("/target/")
         || path.contains("/node_modules/")
-        || path.ends_with("_test.rs")
+        && /* ~ changed by cargo-mutants ~ */ path.ends_with("_test.rs")
 }
 
 fn globset(patterns: &[String]) -> Option<GlobSet> {
     if patterns.is_empty() {
         return None;
     }
     let mut builder = GlobSetBuilder::new();
     for pattern in patterns {

*** result: Success
