*** crates/slophammer-cli/src/rust_rules/scope.rs:187:5: replace globset -> Option<GlobSet> with None

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/scope.rs
+++ replace globset -> Option<GlobSet> with None
@@ -179,26 +179,17 @@
         || path.starts_with("templates/")
         || path.contains("/fixtures/")
         || path.contains("/target/")
         || path.contains("/node_modules/")
         || path.ends_with("_test.rs")
 }
 
 fn globset(patterns: &[String]) -> Option<GlobSet> {
-    if patterns.is_empty() {
-        return None;
-    }
-    let mut builder = GlobSetBuilder::new();
-    for pattern in patterns {
-        if let Ok(glob) = Glob::new(pattern) {
-            builder.add(glob);
-        }
-    }
-    builder.build().ok()
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use crate::scan::RepoFile as File;
     use std::collections::BTreeMap;

---- rust_rules::scope::tests::mutation_excludes_cover_out_of_scope_production_files stdout ----

thread 'rust_rules::scope::tests::mutation_excludes_cover_out_of_scope_production_files' (2186347) panicked at crates/slophammer-cli/src/rust_rules/scope.rs:230:9:
assertion failed: scope_findings(&repo, &covered).is_empty()

failures:
    rust_rules::scope::tests::mutation_excludes_cover_out_of_scope_production_files

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
