*** crates/slophammer-cli/src/rust_rules/scope.rs:35:5: replace scope_counts -> Option<(usize, usize)> with Some((1, 0))

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/scope.rs
+++ replace scope_counts -> Option<(usize, usize)> with Some((1, 0))
@@ -27,27 +27,17 @@
         format!("{}: {}", template.message, uncovered.join(", ")),
     )]
 }
 
 /// Scope coverage counts for the report: production files the configured
 /// scope covers versus all production files. None when no scope is
 /// configured.
 pub fn scope_counts(snapshot: &Snapshot, config: &Config) -> Option<(usize, usize)> {
-    let rust = config.rust.as_ref()?;
-    let scopes = configured_scopes(rust);
-    if scopes.is_empty() {
-        return None;
-    }
-    let production = production_rust_files(snapshot);
-    let scanned = production
-        .iter()
-        .filter(|path| in_targets(path, &scopes))
-        .count();
-    Some((scanned, production.len()))
+    Some((1, 0)) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Mutation targets participate so narrowing mutation scope stays visible.
 fn configured_scopes(rust: &RustConfig) -> Vec<String> {
     let mut scopes = rust.targets.clone();
     if let Some(dry) = &rust.dry {
         scopes.extend(dry.paths.iter().cloned());
     }

---- rust_rules::scope::tests::mutation_targets_extend_configured_scope stdout ----

thread 'rust_rules::scope::tests::mutation_targets_extend_configured_scope' (2138811) panicked at crates/slophammer-cli/src/rust_rules/scope.rs:241:9:
assertion `left == right` failed
  left: Some((1, 0))
 right: Some((2, 2))

failures:
    rust_rules::scope::tests::mutation_targets_extend_configured_scope

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
