*** crates/slophammer-cli/src/rust_rules/scope.rs:50:5: replace configured_scopes -> Vec<String> with vec![]

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/scope.rs
+++ replace configured_scopes -> Vec<String> with vec![]
@@ -42,27 +42,17 @@
         .iter()
         .filter(|path| in_targets(path, &scopes))
         .count();
     Some((scanned, production.len()))
 }
 
 /// Mutation targets participate so narrowing mutation scope stays visible.
 fn configured_scopes(rust: &RustConfig) -> Vec<String> {
-    let mut scopes = rust.targets.clone();
-    if let Some(dry) = &rust.dry {
-        scopes.extend(dry.paths.iter().cloned());
-    }
-    if let Some(coverage) = &rust.coverage {
-        scopes.extend(coverage.paths.iter().cloned());
-    }
-    if let Some(mutation) = &rust.mutation {
-        scopes.extend(mutation.targets.iter().cloned());
-    }
-    scopes
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 fn uncovered_production_dirs(
     snapshot: &Snapshot,
     config: &Config,
     scopes: &[String],
 ) -> Vec<String> {
     let exclude_set = globset(&all_exclude_patterns(config));

---- rust_rules::scope::tests::mutation_excludes_cover_out_of_scope_production_files stdout ----

thread 'rust_rules::scope::tests::mutation_excludes_cover_out_of_scope_production_files' (2140886) panicked at crates/slophammer-cli/src/rust_rules/scope.rs:224:9:
assertion `left == right` failed
  left: 0
 right: 1

---- rust_rules::scope::tests::mutation_targets_extend_configured_scope stdout ----

thread 'rust_rules::scope::tests::mutation_targets_extend_configured_scope' (2140887) panicked at crates/slophammer-cli/src/rust_rules/scope.rs:241:9:
assertion `left == right` failed
  left: None
 right: Some((2, 2))

failures:
    rust_rules::scope::tests::mutation_excludes_cover_out_of_scope_production_files
    rust_rules::scope::tests::mutation_targets_extend_configured_scope

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
