*** crates/slophammer-cli/src/rust_rules/scope.rs:50:5: replace configured_scopes -> Vec<String> with vec!["xyzzy".into()]

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/scope.rs
+++ replace configured_scopes -> Vec<String> with vec!["xyzzy".into()]
@@ -42,27 +42,17 @@
         .iter()
         .filter(|path| in_targets(path, &scopes))
         .count();
     Some((scanned, production.len()))
 }
 
 /// Mutation targets participate so narrowing mutation scope stays visible.
 fn configured_scopes(rust: &RustConfig) -> Vec<String> {
-    let mut scopes = rust.targets.clone();
-    if let Some(dry) = &rust.dry {
-        scopes.extend(dry.paths.iter().cloned());
-    }
-    if let Some(coverage) = &rust.coverage {
-        scopes.extend(coverage.paths.iter().cloned());
-    }
-    if let Some(mutation) = &rust.mutation {
-        scopes.extend(mutation.targets.iter().cloned());
-    }
-    scopes
+    vec!["xyzzy".into()] /* ~ changed by cargo-mutants ~ */
 }
 
 fn uncovered_production_dirs(
     snapshot: &Snapshot,
     config: &Config,
     scopes: &[String],
 ) -> Vec<String> {
     let exclude_set = globset(&all_exclude_patterns(config));

---- rust_rules::scope::tests::mutation_targets_extend_configured_scope stdout ----

thread 'rust_rules::scope::tests::mutation_targets_extend_configured_scope' (2142853) panicked at crates/slophammer-cli/src/rust_rules/scope.rs:240:9:
assertion failed: scope_findings(&repo, &config).is_empty()

---- rust_rules::scope::tests::mutation_excludes_cover_out_of_scope_production_files stdout ----

thread 'rust_rules::scope::tests::mutation_excludes_cover_out_of_scope_production_files' (2142852) panicked at crates/slophammer-cli/src/rust_rules/scope.rs:229:9:
assertion failed: scope_findings(&repo, &covered).is_empty()

---- app::tests::clean_fixture_has_no_findings stdout ----

thread 'app::tests::clean_fixture_has_no_findings' (2142812) panicked at crates/slophammer-cli/src/app.rs:351:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    app::tests::clean_fixture_has_no_findings
    rust_rules::scope::tests::mutation_excludes_cover_out_of_scope_production_files
    rust_rules::scope::tests::mutation_targets_extend_configured_scope

test result: FAILED. 60 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
