*** crates/slophammer-cli/src/rust_rules/scope.rs:68:5: replace uncovered_production_dirs -> Vec<String> with vec!["xyzzy".into()]

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/scope.rs
+++ replace uncovered_production_dirs -> Vec<String> with vec!["xyzzy".into()]
@@ -60,30 +60,17 @@
     scopes
 }
 
 fn uncovered_production_dirs(
     snapshot: &Snapshot,
     config: &Config,
     scopes: &[String],
 ) -> Vec<String> {
-    let exclude_set = globset(&all_exclude_patterns(config));
-    let mut dirs: Vec<String> = production_rust_files(snapshot)
-        .into_iter()
-        .filter(|path| !in_targets(path, scopes))
-        .filter(|path| {
-            exclude_set
-                .as_ref()
-                .is_none_or(|set| !set.is_match(path.as_str()))
-        })
-        .map(|path| parent_dir(&path))
-        .collect();
-    dirs.sort();
-    dirs.dedup();
-    dirs
+    vec!["xyzzy".into()] /* ~ changed by cargo-mutants ~ */
 }
 
 fn all_exclude_patterns(config: &Config) -> Vec<String> {
     let mut patterns = crate::config::rust_exclude(config);
     patterns.extend(crate::config::rust_dry_exclude(config));
     if let Some(coverage) = config.rust.as_ref().and_then(|rust| rust.coverage.as_ref()) {
         patterns.extend(crate::config::exclude_patterns(&coverage.exclude));
     }

---- rust_rules::scope::tests::mutation_excludes_cover_out_of_scope_production_files stdout ----

thread 'rust_rules::scope::tests::mutation_excludes_cover_out_of_scope_production_files' (2145925) panicked at crates/slophammer-cli/src/rust_rules/scope.rs:226:9:
assertion failed: scope_findings(&repo, &covered).is_empty()

---- rust_rules::scope::tests::mutation_targets_extend_configured_scope stdout ----

thread 'rust_rules::scope::tests::mutation_targets_extend_configured_scope' (2145926) panicked at crates/slophammer-cli/src/rust_rules/scope.rs:237:9:
assertion failed: scope_findings(&repo, &config).is_empty()

---- app::tests::clean_fixture_has_no_findings stdout ----

thread 'app::tests::clean_fixture_has_no_findings' (2145885) panicked at crates/slophammer-cli/src/app.rs:351:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    app::tests::clean_fixture_has_no_findings
    rust_rules::scope::tests::mutation_excludes_cover_out_of_scope_production_files
    rust_rules::scope::tests::mutation_targets_extend_configured_scope

test result: FAILED. 60 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
