*** crates/slophammer-cli/src/rust_rules/scope.rs:71:24: delete ! in uncovered_production_dirs

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/scope.rs
+++ delete ! in uncovered_production_dirs
@@ -63,17 +63,17 @@
 fn uncovered_production_dirs(
     snapshot: &Snapshot,
     config: &Config,
     scopes: &[String],
 ) -> Vec<String> {
     let exclude_set = globset(&all_exclude_patterns(config));
     let mut dirs: Vec<String> = production_rust_files(snapshot)
         .into_iter()
-        .filter(|path| !in_targets(path, scopes))
+        .filter(|path|  /* ~ changed by cargo-mutants ~ */in_targets(path, scopes))
         .filter(|path| {
             exclude_set
                 .as_ref()
                 .is_none_or(|set| !set.is_match(path.as_str()))
         })
         .map(|path| parent_dir(&path))
         .collect();
     dirs.sort();

---- rust_rules::scope::tests::mutation_targets_extend_configured_scope stdout ----

thread 'rust_rules::scope::tests::mutation_targets_extend_configured_scope' (2146980) panicked at crates/slophammer-cli/src/rust_rules/scope.rs:250:9:
assertion failed: scope_findings(&repo, &config).is_empty()

---- app::tests::clean_fixture_has_no_findings stdout ----

thread 'app::tests::clean_fixture_has_no_findings' (2146939) panicked at crates/slophammer-cli/src/app.rs:351:9:
assertion `left == right` failed
  left: 1
 right: 0

---- rust_rules::scope::tests::mutation_excludes_cover_out_of_scope_production_files stdout ----

thread 'rust_rules::scope::tests::mutation_excludes_cover_out_of_scope_production_files' (2146979) panicked at crates/slophammer-cli/src/rust_rules/scope.rs:239:9:
assertion failed: scope_findings(&repo, &covered).is_empty()

failures:
    app::tests::clean_fixture_has_no_findings
    rust_rules::scope::tests::mutation_excludes_cover_out_of_scope_production_files
    rust_rules::scope::tests::mutation_targets_extend_configured_scope

test result: FAILED. 60 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
