*** crates/slophammer-cli/src/rust_rules/scope.rs:85:5: replace all_exclude_patterns -> Vec<String> with vec!["xyzzy".into()]

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/scope.rs
+++ replace all_exclude_patterns -> Vec<String> with vec!["xyzzy".into()]
@@ -77,25 +77,17 @@
         .map(|path| parent_dir(&path))
         .collect();
     dirs.sort();
     dirs.dedup();
     dirs
 }
 
 fn all_exclude_patterns(config: &Config) -> Vec<String> {
-    let mut patterns = crate::config::rust_exclude(config);
-    patterns.extend(crate::config::rust_dry_exclude(config));
-    if let Some(coverage) = config.rust.as_ref().and_then(|rust| rust.coverage.as_ref()) {
-        patterns.extend(crate::config::exclude_patterns(&coverage.exclude));
-    }
-    if let Some(mutation) = config.rust.as_ref().and_then(|rust| rust.mutation.as_ref()) {
-        patterns.extend(crate::config::exclude_patterns(&mutation.exclude));
-    }
-    patterns
+    vec!["xyzzy".into()] /* ~ changed by cargo-mutants ~ */
 }
 
 fn production_rust_files(snapshot: &Snapshot) -> Vec<String> {
     snapshot
         .files
         .keys()
         .filter(|path| path.ends_with(".rs"))
         .filter(|path| !conventional_path(path))

---- rust_rules::scope::tests::mutation_excludes_cover_out_of_scope_production_files stdout ----

thread 'rust_rules::scope::tests::mutation_excludes_cover_out_of_scope_production_files' (2151194) panicked at crates/slophammer-cli/src/rust_rules/scope.rs:231:9:
assertion failed: scope_findings(&repo, &covered).is_empty()

failures:
    rust_rules::scope::tests::mutation_excludes_cover_out_of_scope_production_files

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
