*** crates/slophammer-cli/src/rust_rules/scope.rs:97:5: replace production_rust_files -> Vec<String> with vec![]

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/scope.rs
+++ replace production_rust_files -> Vec<String> with vec![]
@@ -89,23 +89,17 @@
     }
     if let Some(mutation) = config.rust.as_ref().and_then(|rust| rust.mutation.as_ref()) {
         patterns.extend(crate::config::exclude_patterns(&mutation.exclude));
     }
     patterns
 }
 
 fn production_rust_files(snapshot: &Snapshot) -> Vec<String> {
-    snapshot
-        .files
-        .keys()
-        .filter(|path| path.ends_with(".rs"))
-        .filter(|path| !conventional_path(path))
-        .cloned()
-        .collect()
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 /// Path-level form of the conventional non-production list in
 /// specs/CONFIG.md.
 fn conventional_path(path: &str) -> bool {
     const DIRS: [&str; 12] = [
         "tests",
         "fixtures",

---- rust_rules::scope::tests::mutation_targets_extend_configured_scope stdout ----

thread 'rust_rules::scope::tests::mutation_targets_extend_configured_scope' (2152124) panicked at crates/slophammer-cli/src/rust_rules/scope.rs:245:9:
assertion `left == right` failed
  left: Some((0, 0))
 right: Some((2, 2))

---- rust_rules::scope::tests::mutation_excludes_cover_out_of_scope_production_files stdout ----

thread 'rust_rules::scope::tests::mutation_excludes_cover_out_of_scope_production_files' (2152123) panicked at crates/slophammer-cli/src/rust_rules/scope.rs:228:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    rust_rules::scope::tests::mutation_excludes_cover_out_of_scope_production_files
    rust_rules::scope::tests::mutation_targets_extend_configured_scope

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
