*** crates/slophammer-cli/src/rust_rules/scope.rs:97:5: replace production_rust_files -> Vec<String> with vec!["xyzzy".into()]

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/scope.rs
+++ replace production_rust_files -> Vec<String> with vec!["xyzzy".into()]
@@ -89,23 +89,17 @@
     }
     if let Some(mutation) = config.rust.as_ref().and_then(|rust| rust.mutation.as_ref()) {
         patterns.extend(crate::config::exclude_patterns(&mutation.exclude));
     }
     patterns
 }
 
 fn production_rust_files(snapshot: &Snapshot) -> Vec<String> {
-    snapshot
-        .files
-        .keys()
-        .filter(|path| path.ends_with(".rs"))
-        .filter(|path| !conventional_path(path))
-        .cloned()
-        .collect()
+    vec!["xyzzy".into()] /* ~ changed by cargo-mutants ~ */
 }
 
 /// Path-level form of the conventional non-production list in
 /// specs/CONFIG.md.
 fn conventional_path(path: &str) -> bool {
     const DIRS: [&str; 12] = [
         "tests",
         "fixtures",

---- rust_rules::scope::tests::mutation_targets_extend_configured_scope stdout ----

thread 'rust_rules::scope::tests::mutation_targets_extend_configured_scope' (2154079) panicked at crates/slophammer-cli/src/rust_rules/scope.rs:244:9:
assertion failed: scope_findings(&repo, &config).is_empty()

---- rust_rules::scope::tests::mutation_excludes_cover_out_of_scope_production_files stdout ----

thread 'rust_rules::scope::tests::mutation_excludes_cover_out_of_scope_production_files' (2154078) panicked at crates/slophammer-cli/src/rust_rules/scope.rs:233:9:
assertion failed: scope_findings(&repo, &covered).is_empty()

---- app::tests::clean_fixture_has_no_findings stdout ----

thread 'app::tests::clean_fixture_has_no_findings' (2154038) panicked at crates/slophammer-cli/src/app.rs:351:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    app::tests::clean_fixture_has_no_findings
    rust_rules::scope::tests::mutation_excludes_cover_out_of_scope_production_files
    rust_rules::scope::tests::mutation_targets_extend_configured_scope

test result: FAILED. 60 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
