*** crates/slophammer-cli/src/rust_rules/suppressions.rs:11:5: replace suppression_findings -> Vec<Finding> with vec![]

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/suppressions.rs
+++ replace suppression_findings -> Vec<Finding> with vec![]
@@ -3,26 +3,17 @@
 use crate::scan::Snapshot;
 
 /// A bare `#[allow(...)]` in production Rust code is a finding: suppressions
 /// must carry an adjacent `// reason` comment or use `#[expect(...)]` with a
 /// `reason` attribute. Detection is line-based; the scan stops at the first
 /// `#[cfg(test)]` line since test modules sit at the end of a file by
 /// convention and test scope is exempt.
 pub fn suppression_findings(snapshot: &Snapshot) -> Vec<Finding> {
-    let mut findings = Vec::new();
-    for file in snapshot.files.values() {
-        if !production_rust_path(&file.path) {
-            continue;
-        }
-        if let Some(line) = bare_suppression_line(&file.content) {
-            findings.push(suppression_finding(&file.path, line));
-        }
-    }
-    findings
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 fn production_rust_path(path: &str) -> bool {
     path.ends_with(".rs")
         && !path.ends_with("_test.rs")
         && !path.starts_with("tests/")
         && !path.contains("/tests/")
         && !super::ignored_project_path(path)

---- rust_rules::suppressions::tests::bare_allow_in_production_code_is_a_finding stdout ----

thread 'rust_rules::suppressions::tests::bare_allow_in_production_code_is_a_finding' (2188423) panicked at crates/slophammer-cli/src/rust_rules/suppressions.rs:79:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    rust_rules::suppressions::tests::bare_allow_in_production_code_is_a_finding

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
