*** crates/slophammer-cli/src/rust_rules/suppressions.rs:13:12: delete ! in suppression_findings

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/suppressions.rs
+++ delete ! in suppression_findings
@@ -5,17 +5,17 @@
 /// A bare `#[allow(...)]` in production Rust code is a finding: suppressions
 /// must carry an adjacent `// reason` comment or use `#[expect(...)]` with a
 /// `reason` attribute. Detection is line-based; the scan stops at the first
 /// `#[cfg(test)]` line since test modules sit at the end of a file by
 /// convention and test scope is exempt.
 pub fn suppression_findings(snapshot: &Snapshot) -> Vec<Finding> {
     let mut findings = Vec::new();
     for file in snapshot.files.values() {
-        if !production_rust_path(&file.path) {
+        if  /* ~ changed by cargo-mutants ~ */production_rust_path(&file.path) {
             continue;
         }
         if let Some(line) = bare_suppression_line(&file.content) {
             findings.push(suppression_finding(&file.path, line));
         }
     }
     findings
 }

---- rust_rules::suppressions::tests::test_scope_is_exempt stdout ----

thread 'rust_rules::suppressions::tests::test_scope_is_exempt' (2189540) panicked at crates/slophammer-cli/src/rust_rules/suppressions.rs:105:9:
assertion failed: suppression_findings(&snapshot("tests/cli.rs",
                "#[allow(dead_code)]\n")).is_empty()

---- rust_rules::suppressions::tests::bare_allow_in_production_code_is_a_finding stdout ----

thread 'rust_rules::suppressions::tests::bare_allow_in_production_code_is_a_finding' (2189538) panicked at crates/slophammer-cli/src/rust_rules/suppressions.rs:88:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    rust_rules::suppressions::tests::bare_allow_in_production_code_is_a_finding
    rust_rules::suppressions::tests::test_scope_is_exempt

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
