*** crates/slophammer-cli/src/rust_rules/suppressions.rs:24:5: replace production_rust_path -> bool with false

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/suppressions.rs
+++ replace production_rust_path -> bool with false
@@ -16,21 +16,17 @@
         if let Some(line) = bare_suppression_line(&file.content) {
             findings.push(suppression_finding(&file.path, line));
         }
     }
     findings
 }
 
 fn production_rust_path(path: &str) -> bool {
-    path.ends_with(".rs")
-        && !path.ends_with("_test.rs")
-        && !path.starts_with("tests/")
-        && !path.contains("/tests/")
-        && !super::ignored_project_path(path)
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 fn bare_suppression_line(content: &str) -> Option<usize> {
     let mut previous_line_is_comment = false;
     for (index, line) in content.lines().enumerate() {
         let trimmed = line.trim_start();
         if trimmed.starts_with("#[cfg(test)") {
             return None;

---- rust_rules::suppressions::tests::bare_allow_in_production_code_is_a_finding stdout ----

thread 'rust_rules::suppressions::tests::bare_allow_in_production_code_is_a_finding' (2191491) panicked at crates/slophammer-cli/src/rust_rules/suppressions.rs:84:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    rust_rules::suppressions::tests::bare_allow_in_production_code_is_a_finding

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
