*** crates/slophammer-cli/src/rust_rules/suppressions.rs:25:12: delete ! in production_rust_path

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/suppressions.rs
+++ delete ! in production_rust_path
@@ -17,17 +17,17 @@
             findings.push(suppression_finding(&file.path, line));
         }
     }
     findings
 }
 
 fn production_rust_path(path: &str) -> bool {
     path.ends_with(".rs")
-        && !path.ends_with("_test.rs")
+        &&  /* ~ changed by cargo-mutants ~ */path.ends_with("_test.rs")
         && !path.starts_with("tests/")
         && !path.contains("/tests/")
         && !super::ignored_project_path(path)
 }
 
 fn bare_suppression_line(content: &str) -> Option<usize> {
     let mut previous_line_is_comment = false;
     for (index, line) in content.lines().enumerate() {

---- rust_rules::suppressions::tests::bare_allow_in_production_code_is_a_finding stdout ----

thread 'rust_rules::suppressions::tests::bare_allow_in_production_code_is_a_finding' (2196662) panicked at crates/slophammer-cli/src/rust_rules/suppressions.rs:88:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    rust_rules::suppressions::tests::bare_allow_in_production_code_is_a_finding

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
