*** crates/slophammer-cli/src/rust_rules/suppressions.rs:26:12: delete ! in production_rust_path

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/suppressions.rs
+++ delete ! in production_rust_path
@@ -18,17 +18,17 @@
         }
     }
     findings
 }
 
 fn production_rust_path(path: &str) -> bool {
     path.ends_with(".rs")
         && !path.ends_with("_test.rs")
-        && !path.starts_with("tests/")
+        &&  /* ~ changed by cargo-mutants ~ */path.starts_with("tests/")
         && !path.contains("/tests/")
         && !super::ignored_project_path(path)
 }
 
 fn bare_suppression_line(content: &str) -> Option<usize> {
     let mut previous_line_is_comment = false;
     for (index, line) in content.lines().enumerate() {
         let trimmed = line.trim_start();

---- rust_rules::suppressions::tests::bare_allow_in_production_code_is_a_finding stdout ----

thread 'rust_rules::suppressions::tests::bare_allow_in_production_code_is_a_finding' (2197737) panicked at crates/slophammer-cli/src/rust_rules/suppressions.rs:88:9:
assertion `left == right` failed
  left: 0
 right: 1

---- rust_rules::suppressions::tests::test_scope_is_exempt stdout ----

thread 'rust_rules::suppressions::tests::test_scope_is_exempt' (2197739) panicked at crates/slophammer-cli/src/rust_rules/suppressions.rs:105:9:
assertion failed: suppression_findings(&snapshot("tests/cli.rs",
                "#[allow(dead_code)]\n")).is_empty()

failures:
    rust_rules::suppressions::tests::bare_allow_in_production_code_is_a_finding
    rust_rules::suppressions::tests::test_scope_is_exempt

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
