*** crates/slophammer-cli/src/rust_rules/suppressions.rs:28:12: delete ! in production_rust_path

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/suppressions.rs
+++ delete ! in production_rust_path
@@ -20,17 +20,17 @@
     findings
 }
 
 fn production_rust_path(path: &str) -> bool {
     path.ends_with(".rs")
         && !path.ends_with("_test.rs")
         && !path.starts_with("tests/")
         && !path.contains("/tests/")
-        && !super::ignored_project_path(path)
+        &&  /* ~ changed by cargo-mutants ~ */super::ignored_project_path(path)
 }
 
 fn bare_suppression_line(content: &str) -> Option<usize> {
     let mut previous_line_is_comment = false;
     for (index, line) in content.lines().enumerate() {
         let trimmed = line.trim_start();
         if trimmed.starts_with("#[cfg(test)") {
             return None;

---- rust_rules::suppressions::tests::bare_allow_in_production_code_is_a_finding stdout ----

thread 'rust_rules::suppressions::tests::bare_allow_in_production_code_is_a_finding' (2199673) panicked at crates/slophammer-cli/src/rust_rules/suppressions.rs:88:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    rust_rules::suppressions::tests::bare_allow_in_production_code_is_a_finding

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
