*** crates/slophammer-cli/src/rust_rules/suppressions.rs:32:5: replace bare_suppression_line -> Option<usize> with None

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/suppressions.rs
+++ replace bare_suppression_line -> Option<usize> with None
@@ -24,28 +24,17 @@
     path.ends_with(".rs")
         && !path.ends_with("_test.rs")
         && !path.starts_with("tests/")
         && !path.contains("/tests/")
         && !super::ignored_project_path(path)
 }
 
 fn bare_suppression_line(content: &str) -> Option<usize> {
-    let mut previous_line_is_comment = false;
-    for (index, line) in content.lines().enumerate() {
-        let trimmed = line.trim_start();
-        if trimmed.starts_with("#[cfg(test)") {
-            return None;
-        }
-        if bare_allow_attribute(trimmed, previous_line_is_comment) {
-            return Some(index + 1);
-        }
-        previous_line_is_comment = trimmed.starts_with("//");
-    }
-    None
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn bare_allow_attribute(trimmed: &str, previous_line_is_comment: bool) -> bool {
     if !trimmed.starts_with("#[allow(") && !trimmed.starts_with("#![allow(") {
         return false;
     }
     !previous_line_is_comment && !trimmed.contains("//") && !trimmed.contains("reason")
 }

---- rust_rules::suppressions::tests::bare_allow_in_production_code_is_a_finding stdout ----

thread 'rust_rules::suppressions::tests::bare_allow_in_production_code_is_a_finding' (2200811) panicked at crates/slophammer-cli/src/rust_rules/suppressions.rs:77:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    rust_rules::suppressions::tests::bare_allow_in_production_code_is_a_finding

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
