*** crates/slophammer-cli/src/rust_rules/suppressions.rs:32:5: replace bare_suppression_line -> Option<usize> with Some(1)

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/suppressions.rs
+++ replace bare_suppression_line -> Option<usize> with Some(1)
@@ -24,28 +24,17 @@
     path.ends_with(".rs")
         && !path.ends_with("_test.rs")
         && !path.starts_with("tests/")
         && !path.contains("/tests/")
         && !super::ignored_project_path(path)
 }
 
 fn bare_suppression_line(content: &str) -> Option<usize> {
-    let mut previous_line_is_comment = false;
-    for (index, line) in content.lines().enumerate() {
-        let trimmed = line.trim_start();
-        if trimmed.starts_with("#[cfg(test)") {
-            return None;
-        }
-        if bare_allow_attribute(trimmed, previous_line_is_comment) {
-            return Some(index + 1);
-        }
-        previous_line_is_comment = trimmed.starts_with("//");
-    }
-    None
+    Some(1) /* ~ changed by cargo-mutants ~ */
 }
 
 fn bare_allow_attribute(trimmed: &str, previous_line_is_comment: bool) -> bool {
     if !trimmed.starts_with("#[allow(") && !trimmed.starts_with("#![allow(") {
         return false;
     }
     !previous_line_is_comment && !trimmed.contains("//") && !trimmed.contains("reason")
 }

---- rust_rules::suppressions::tests::justified_and_expect_suppressions_pass stdout ----

thread 'rust_rules::suppressions::tests::justified_and_expect_suppressions_pass' (2203283) panicked at crates/slophammer-cli/src/rust_rules/suppressions.rs:89:9:
assertion failed: suppression_findings(&snapshot("src/lib.rs", content)).is_empty()

---- rust_rules::suppressions::tests::test_scope_is_exempt stdout ----

thread 'rust_rules::suppressions::tests::test_scope_is_exempt' (2203284) panicked at crates/slophammer-cli/src/rust_rules/suppressions.rs:98:9:
assertion failed: suppression_findings(&snapshot("src/lib.rs", trailing)).is_empty()

---- app::tests::clean_fixture_has_no_findings stdout ----

thread 'app::tests::clean_fixture_has_no_findings' (2203240) panicked at crates/slophammer-cli/src/app.rs:351:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    app::tests::clean_fixture_has_no_findings
    rust_rules::suppressions::tests::justified_and_expect_suppressions_pass
    rust_rules::suppressions::tests::test_scope_is_exempt

test result: FAILED. 60 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
