*** crates/slophammer-cli/src/rust_rules/suppressions.rs:39:31: replace + with - in bare_suppression_line

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/suppressions.rs
+++ replace + with - in bare_suppression_line
@@ -31,17 +31,17 @@
 fn bare_suppression_line(content: &str) -> Option<usize> {
     let mut previous_line_is_comment = false;
     for (index, line) in content.lines().enumerate() {
         let trimmed = line.trim_start();
         if trimmed.starts_with("#[cfg(test)") {
             return None;
         }
         if bare_allow_attribute(trimmed, previous_line_is_comment) {
-            return Some(index + 1);
+            return Some(index - /* ~ changed by cargo-mutants ~ */ 1);
         }
         previous_line_is_comment = trimmed.starts_with("//");
     }
     None
 }
 
 fn bare_allow_attribute(trimmed: &str, previous_line_is_comment: bool) -> bool {
     if !trimmed.starts_with("#[allow(") && !trimmed.starts_with("#![allow(") {

---- rust_rules::suppressions::tests::bare_allow_in_production_code_is_a_finding stdout ----

thread 'rust_rules::suppressions::tests::bare_allow_in_production_code_is_a_finding' (2204328) panicked at crates/slophammer-cli/src/rust_rules/suppressions.rs:39:25:
attempt to subtract with overflow

failures:
    rust_rules::suppressions::tests::bare_allow_in_production_code_is_a_finding

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
