*** crates/slophammer-cli/src/rust_rules/suppressions.rs:47:44: delete ! in bare_allow_attribute

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/suppressions.rs
+++ delete ! in bare_allow_attribute
@@ -39,17 +39,17 @@
             return Some(index + 1);
         }
         previous_line_is_comment = trimmed.starts_with("//");
     }
     None
 }
 
 fn bare_allow_attribute(trimmed: &str, previous_line_is_comment: bool) -> bool {
-    if !trimmed.starts_with("#[allow(") && !trimmed.starts_with("#![allow(") {
+    if !trimmed.starts_with("#[allow(") &&  /* ~ changed by cargo-mutants ~ */trimmed.starts_with("#![allow(") {
         return false;
     }
     !previous_line_is_comment && !trimmed.contains("//") && !trimmed.contains("reason")
 }
 
 fn suppression_finding(path: &str, line: usize) -> Finding {
     let template = definition(rule_ids::RUST_SUPPRESSIONS_JUSTIFIED);
     Finding::with_message(

---- rust_rules::suppressions::tests::test_scope_is_exempt stdout ----

thread 'rust_rules::suppressions::tests::test_scope_is_exempt' (2210184) panicked at crates/slophammer-cli/src/rust_rules/suppressions.rs:109:9:
assertion failed: suppression_findings(&snapshot("src/lib.rs", trailing)).is_empty()

---- rust_rules::suppressions::tests::justified_and_expect_suppressions_pass stdout ----

thread 'rust_rules::suppressions::tests::justified_and_expect_suppressions_pass' (2210183) panicked at crates/slophammer-cli/src/rust_rules/suppressions.rs:100:9:
assertion failed: suppression_findings(&snapshot("src/lib.rs", content)).is_empty()

---- app::tests::clean_fixture_has_no_findings stdout ----

thread 'app::tests::clean_fixture_has_no_findings' (2210140) panicked at crates/slophammer-cli/src/app.rs:351:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    app::tests::clean_fixture_has_no_findings
    rust_rules::suppressions::tests::justified_and_expect_suppressions_pass
    rust_rules::suppressions::tests::test_scope_is_exempt

test result: FAILED. 60 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
