*** crates/slophammer-cli/src/rust_rules/suppressions.rs:47:5: replace bare_allow_attribute -> bool with true

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/suppressions.rs
+++ replace bare_allow_attribute -> bool with true
@@ -39,20 +39,17 @@
             return Some(index + 1);
         }
         previous_line_is_comment = trimmed.starts_with("//");
     }
     None
 }
 
 fn bare_allow_attribute(trimmed: &str, previous_line_is_comment: bool) -> bool {
-    if !trimmed.starts_with("#[allow(") && !trimmed.starts_with("#![allow(") {
-        return false;
-    }
-    !previous_line_is_comment && !trimmed.contains("//") && !trimmed.contains("reason")
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 fn suppression_finding(path: &str, line: usize) -> Finding {
     let template = definition(rule_ids::RUST_SUPPRESSIONS_JUSTIFIED);
     Finding::with_message(
         template,
         path,
         format!("{} (line {line})", template.message),

---- rust_rules::suppressions::tests::justified_and_expect_suppressions_pass stdout ----

thread 'rust_rules::suppressions::tests::justified_and_expect_suppressions_pass' (2205936) panicked at crates/slophammer-cli/src/rust_rules/suppressions.rs:97:9:
assertion failed: suppression_findings(&snapshot("src/lib.rs", content)).is_empty()

---- rust_rules::suppressions::tests::test_scope_is_exempt stdout ----

thread 'rust_rules::suppressions::tests::test_scope_is_exempt' (2205937) panicked at crates/slophammer-cli/src/rust_rules/suppressions.rs:106:9:
assertion failed: suppression_findings(&snapshot("src/lib.rs", trailing)).is_empty()

---- app::tests::clean_fixture_has_no_findings stdout ----

thread 'app::tests::clean_fixture_has_no_findings' (2205893) panicked at crates/slophammer-cli/src/app.rs:351:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    app::tests::clean_fixture_has_no_findings
    rust_rules::suppressions::tests::justified_and_expect_suppressions_pass
    rust_rules::suppressions::tests::test_scope_is_exempt

test result: FAILED. 60 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
