*** crates/slophammer-cli/src/rust_rules/suppressions.rs:47:5: replace bare_allow_attribute -> bool with false

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/suppressions.rs
+++ replace bare_allow_attribute -> bool with false
@@ -39,20 +39,17 @@
             return Some(index + 1);
         }
         previous_line_is_comment = trimmed.starts_with("//");
     }
     None
 }
 
 fn bare_allow_attribute(trimmed: &str, previous_line_is_comment: bool) -> bool {
-    if !trimmed.starts_with("#[allow(") && !trimmed.starts_with("#![allow(") {
-        return false;
-    }
-    !previous_line_is_comment && !trimmed.contains("//") && !trimmed.contains("reason")
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 fn suppression_finding(path: &str, line: usize) -> Finding {
     let template = definition(rule_ids::RUST_SUPPRESSIONS_JUSTIFIED);
     Finding::with_message(
         template,
         path,
         format!("{} (line {line})", template.message),

---- rust_rules::suppressions::tests::bare_allow_in_production_code_is_a_finding stdout ----

thread 'rust_rules::suppressions::tests::bare_allow_in_production_code_is_a_finding' (2207105) panicked at crates/slophammer-cli/src/rust_rules/suppressions.rs:85:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    rust_rules::suppressions::tests::bare_allow_in_production_code_is_a_finding

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
