*** crates/slophammer-cli/src/rust_rules/suppressions.rs:47:8: delete ! in bare_allow_attribute

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/suppressions.rs
+++ delete ! in bare_allow_attribute
@@ -39,17 +39,17 @@
             return Some(index + 1);
         }
         previous_line_is_comment = trimmed.starts_with("//");
     }
     None
 }
 
 fn bare_allow_attribute(trimmed: &str, previous_line_is_comment: bool) -> bool {
-    if !trimmed.starts_with("#[allow(") && !trimmed.starts_with("#![allow(") {
+    if  /* ~ changed by cargo-mutants ~ */trimmed.starts_with("#[allow(") && !trimmed.starts_with("#![allow(") {
         return false;
     }
     !previous_line_is_comment && !trimmed.contains("//") && !trimmed.contains("reason")
 }
 
 fn suppression_finding(path: &str, line: usize) -> Finding {
     let template = definition(rule_ids::RUST_SUPPRESSIONS_JUSTIFIED);
     Finding::with_message(

---- rust_rules::suppressions::tests::test_scope_is_exempt stdout ----

thread 'rust_rules::suppressions::tests::test_scope_is_exempt' (2209119) panicked at crates/slophammer-cli/src/rust_rules/suppressions.rs:109:9:
assertion failed: suppression_findings(&snapshot("src/lib.rs", trailing)).is_empty()

---- rust_rules::suppressions::tests::justified_and_expect_suppressions_pass stdout ----

thread 'rust_rules::suppressions::tests::justified_and_expect_suppressions_pass' (2209118) panicked at crates/slophammer-cli/src/rust_rules/suppressions.rs:100:9:
assertion failed: suppression_findings(&snapshot("src/lib.rs", content)).is_empty()

---- rust_rules::suppressions::tests::bare_allow_in_production_code_is_a_finding stdout ----

thread 'rust_rules::suppressions::tests::bare_allow_in_production_code_is_a_finding' (2209117) panicked at crates/slophammer-cli/src/rust_rules/suppressions.rs:90:9:
assertion failed: findings[0].message.contains("line 1")

failures:
    app::tests::clean_fixture_has_no_findings
    rust_rules::suppressions::tests::bare_allow_in_production_code_is_a_finding
    rust_rules::suppressions::tests::justified_and_expect_suppressions_pass
    rust_rules::suppressions::tests::test_scope_is_exempt

test result: FAILED. 59 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
