*** crates/slophammer-cli/src/rust_rules/suppressions.rs:50:31: replace && with || in bare_allow_attribute

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/suppressions.rs
+++ replace && with || in bare_allow_attribute
@@ -42,17 +42,17 @@
     }
     None
 }
 
 fn bare_allow_attribute(trimmed: &str, previous_line_is_comment: bool) -> bool {
     if !trimmed.starts_with("#[allow(") && !trimmed.starts_with("#![allow(") {
         return false;
     }
-    !previous_line_is_comment && !trimmed.contains("//") && !trimmed.contains("reason")
+    !previous_line_is_comment || /* ~ changed by cargo-mutants ~ */ !trimmed.contains("//") && !trimmed.contains("reason")
 }
 
 fn suppression_finding(path: &str, line: usize) -> Finding {
     let template = definition(rule_ids::RUST_SUPPRESSIONS_JUSTIFIED);
     Finding::with_message(
         template,
         path,
         format!("{} (line {line})", template.message),

---- rust_rules::suppressions::tests::justified_and_expect_suppressions_pass stdout ----

thread 'rust_rules::suppressions::tests::justified_and_expect_suppressions_pass' (2212152) panicked at crates/slophammer-cli/src/rust_rules/suppressions.rs:100:9:
assertion failed: suppression_findings(&snapshot("src/lib.rs", content)).is_empty()

failures:
    rust_rules::suppressions::tests::justified_and_expect_suppressions_pass

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
