*** crates/slophammer-cli/src/rust_rules/suppressions.rs:50:34: delete ! in bare_allow_attribute

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/suppressions.rs
+++ delete ! in bare_allow_attribute
@@ -42,17 +42,17 @@
     }
     None
 }
 
 fn bare_allow_attribute(trimmed: &str, previous_line_is_comment: bool) -> bool {
     if !trimmed.starts_with("#[allow(") && !trimmed.starts_with("#![allow(") {
         return false;
     }
-    !previous_line_is_comment && !trimmed.contains("//") && !trimmed.contains("reason")
+    !previous_line_is_comment &&  /* ~ changed by cargo-mutants ~ */trimmed.contains("//") && !trimmed.contains("reason")
 }
 
 fn suppression_finding(path: &str, line: usize) -> Finding {
     let template = definition(rule_ids::RUST_SUPPRESSIONS_JUSTIFIED);
     Finding::with_message(
         template,
         path,
         format!("{} (line {line})", template.message),

---- rust_rules::suppressions::tests::bare_allow_in_production_code_is_a_finding stdout ----

thread 'rust_rules::suppressions::tests::bare_allow_in_production_code_is_a_finding' (2214114) panicked at crates/slophammer-cli/src/rust_rules/suppressions.rs:88:9:
assertion `left == right` failed
  left: 0
 right: 1

---- rust_rules::suppressions::tests::justified_and_expect_suppressions_pass stdout ----

thread 'rust_rules::suppressions::tests::justified_and_expect_suppressions_pass' (2214115) panicked at crates/slophammer-cli/src/rust_rules/suppressions.rs:100:9:
assertion failed: suppression_findings(&snapshot("src/lib.rs", content)).is_empty()

failures:
    rust_rules::suppressions::tests::bare_allow_in_production_code_is_a_finding
    rust_rules::suppressions::tests::justified_and_expect_suppressions_pass

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
