*** crates/slophammer-cli/src/rust_rules/unsafe_policy.rs:102:9: replace <impl Visit<'ast> for UnsafeVisitor>::visit_item_trait with ()

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/unsafe_policy.rs
+++ replace <impl Visit<'ast> for UnsafeVisitor>::visit_item_trait with ()
@@ -94,20 +94,17 @@
     fn visit_item_fn(&mut self, node: &'ast syn::ItemFn) {
         if node.sig.unsafety.is_some() {
             self.found = true;
         }
         visit::visit_item_fn(self, node);
     }
 
     fn visit_item_trait(&mut self, node: &'ast syn::ItemTrait) {
-        if node.unsafety.is_some() {
-            self.found = true;
-        }
-        visit::visit_item_trait(self, node);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     fn visit_item_impl(&mut self, node: &'ast syn::ItemImpl) {
         if node.unsafety.is_some() {
             self.found = true;
         }
         visit::visit_item_impl(self, node);
     }

*** result: Success
