*** crates/slophammer-cli/src/rust_rules/unsafe_policy.rs:109:9: replace <impl Visit<'ast> for UnsafeVisitor>::visit_item_impl with ()

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/unsafe_policy.rs
+++ replace <impl Visit<'ast> for UnsafeVisitor>::visit_item_impl with ()
@@ -101,20 +101,17 @@
     fn visit_item_trait(&mut self, node: &'ast syn::ItemTrait) {
         if node.unsafety.is_some() {
             self.found = true;
         }
         visit::visit_item_trait(self, node);
     }
 
     fn visit_item_impl(&mut self, node: &'ast syn::ItemImpl) {
-        if node.unsafety.is_some() {
-            self.found = true;
-        }
-        visit::visit_item_impl(self, node);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     fn visit_item_foreign_mod(&mut self, node: &'ast syn::ItemForeignMod) {
         if node.unsafety.is_some() {
             self.found = true;
         }
         visit::visit_item_foreign_mod(self, node);
     }

*** result: Success
