*** crates/slophammer-cli/src/rust_rules/unsafe_policy.rs:116:9: replace <impl Visit<'ast> for UnsafeVisitor>::visit_item_foreign_mod with ()

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/unsafe_policy.rs
+++ replace <impl Visit<'ast> for UnsafeVisitor>::visit_item_foreign_mod with ()
@@ -108,20 +108,17 @@
     fn visit_item_impl(&mut self, node: &'ast syn::ItemImpl) {
         if node.unsafety.is_some() {
             self.found = true;
         }
         visit::visit_item_impl(self, node);
     }
 
     fn visit_item_foreign_mod(&mut self, node: &'ast syn::ItemForeignMod) {
-        if node.unsafety.is_some() {
-            self.found = true;
-        }
-        visit::visit_item_foreign_mod(self, node);
+        () /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use crate::config::{RustConfig, RustUnsafe, UnsafeAllow};
     use crate::scan::{RepoFile, Snapshot};

*** result: Success
