*** crates/slophammer-cli/src/rust_rules/unsafe_policy.rs:29:5: replace forbid_findings -> Vec<Finding> with vec![]

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/unsafe_policy.rs
+++ replace forbid_findings -> Vec<Finding> with vec![]
@@ -21,21 +21,17 @@
     };
     match policy.policy {
         UnsafePolicy::Forbid => forbid_findings(snapshot, config),
         UnsafePolicy::AllowDocumented => documented_findings(snapshot, config),
     }
 }
 
 fn forbid_findings(snapshot: &Snapshot, config: &Config) -> Vec<Finding> {
-    unsafe_paths(snapshot, config)
-        .into_iter()
-        .filter(|path| !unsafe_allowed(config, path))
-        .map(|path| Finding::at_path(definition(rule_ids::RUST_UNSAFE_POLICY_REQUIRED), path))
-        .collect()
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 fn documented_findings(snapshot: &Snapshot, config: &Config) -> Vec<Finding> {
     unsafe_paths(snapshot, config)
         .into_iter()
         .filter(|path| !unsafe_allowed(config, path))
         .map(|path| {
             Finding::with_message(

---- app::tests::direct_commands_use_report_contract stdout ----

thread 'app::tests::direct_commands_use_report_contract' (2218407) panicked at crates/slophammer-cli/src/app.rs:413:9:
assertion `left == right` failed
  left: 0
 right: 1

---- app::tests::rust_failure_fixtures_report_findings stdout ----

thread 'app::tests::rust_failure_fixtures_report_findings' (2218411) panicked at crates/slophammer-cli/src/app.rs:378:13:
assertion `left == right` failed: rust-unsafe
  left: 0
 right: 1

failures:
    app::tests::direct_commands_use_report_contract
    app::tests::rust_failure_fixtures_report_findings

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
