*** crates/slophammer-cli/src/rust_rules/unsafe_policy.rs:31:24: delete ! in forbid_findings

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/unsafe_policy.rs
+++ delete ! in forbid_findings
@@ -23,17 +23,17 @@
         UnsafePolicy::Forbid => forbid_findings(snapshot, config),
         UnsafePolicy::AllowDocumented => documented_findings(snapshot, config),
     }
 }
 
 fn forbid_findings(snapshot: &Snapshot, config: &Config) -> Vec<Finding> {
     unsafe_paths(snapshot, config)
         .into_iter()
-        .filter(|path| !unsafe_allowed(config, path))
+        .filter(|path|  /* ~ changed by cargo-mutants ~ */unsafe_allowed(config, path))
         .map(|path| Finding::at_path(definition(rule_ids::RUST_UNSAFE_POLICY_REQUIRED), path))
         .collect()
 }
 
 fn documented_findings(snapshot: &Snapshot, config: &Config) -> Vec<Finding> {
     unsafe_paths(snapshot, config)
         .into_iter()
         .filter(|path| !unsafe_allowed(config, path))

---- rust_rules::unsafe_policy::tests::allow_entry_suppresses_forbidden_unsafe stdout ----

thread 'rust_rules::unsafe_policy::tests::allow_entry_suppresses_forbidden_unsafe' (2219567) panicked at crates/slophammer-cli/src/rust_rules/unsafe_policy.rs:164:9:
assertion failed: findings.is_empty()

---- app::tests::direct_commands_use_report_contract stdout ----

thread 'app::tests::direct_commands_use_report_contract' (2219519) panicked at crates/slophammer-cli/src/app.rs:413:9:
assertion `left == right` failed
  left: 0
 right: 1

---- app::tests::rust_failure_fixtures_report_findings stdout ----

thread 'app::tests::rust_failure_fixtures_report_findings' (2219523) panicked at crates/slophammer-cli/src/app.rs:378:13:
assertion `left == right` failed: rust-unsafe
  left: 0
 right: 1

failures:
    app::tests::direct_commands_use_report_contract
    app::tests::rust_failure_fixtures_report_findings
    rust_rules::unsafe_policy::tests::allow_entry_suppresses_forbidden_unsafe

test result: FAILED. 60 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
