*** crates/slophammer-cli/src/rust_rules/unsafe_policy.rs:37:5: replace documented_findings -> Vec<Finding> with vec![]

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/unsafe_policy.rs
+++ replace documented_findings -> Vec<Finding> with vec![]
@@ -29,27 +29,17 @@
     unsafe_paths(snapshot, config)
         .into_iter()
         .filter(|path| !unsafe_allowed(config, path))
         .map(|path| Finding::at_path(definition(rule_ids::RUST_UNSAFE_POLICY_REQUIRED), path))
         .collect()
 }
 
 fn documented_findings(snapshot: &Snapshot, config: &Config) -> Vec<Finding> {
-    unsafe_paths(snapshot, config)
-        .into_iter()
-        .filter(|path| !unsafe_allowed(config, path))
-        .map(|path| {
-            Finding::with_message(
-                definition(rule_ids::RUST_UNSAFE_POLICY_REQUIRED),
-                path,
-                "Rust unsafe code must be documented with an allow entry",
-            )
-        })
-        .collect()
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 fn unsafe_paths(snapshot: &Snapshot, config: &Config) -> Vec<String> {
     scope::configured_rust_files(snapshot, config)
         .into_iter()
         .filter(|path| {
             snapshot
                 .file(path)

---- rust_rules::unsafe_policy::tests::allow_documented_requires_allow_entry stdout ----

thread 'rust_rules::unsafe_policy::tests::allow_documented_requires_allow_entry' (2220684) panicked at crates/slophammer-cli/src/rust_rules/unsafe_policy.rs:173:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    rust_rules::unsafe_policy::tests::allow_documented_requires_allow_entry

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
