*** crates/slophammer-cli/src/rust_rules/unsafe_policy.rs:51:5: replace unsafe_paths -> Vec<String> with vec![]

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/unsafe_policy.rs
+++ replace unsafe_paths -> Vec<String> with vec![]
@@ -43,24 +43,17 @@
                 path,
                 "Rust unsafe code must be documented with an allow entry",
             )
         })
         .collect()
 }
 
 fn unsafe_paths(snapshot: &Snapshot, config: &Config) -> Vec<String> {
-    scope::configured_rust_files(snapshot, config)
-        .into_iter()
-        .filter(|path| {
-            snapshot
-                .file(path)
-                .is_some_and(|file| file_contains_unsafe(&file.content))
-        })
-        .collect()
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 fn file_contains_unsafe(content: &str) -> bool {
     let Ok(parsed) = syn::parse_file(content) else {
         return content.contains("unsafe");
     };
     let mut visitor = UnsafeVisitor::default();
     visitor.visit_file(&parsed);

---- rust_rules::unsafe_policy::tests::allow_documented_requires_allow_entry stdout ----

thread 'rust_rules::unsafe_policy::tests::allow_documented_requires_allow_entry' (2222946) panicked at crates/slophammer-cli/src/rust_rules/unsafe_policy.rs:176:9:
assertion `left == right` failed
  left: 0
 right: 1

---- app::tests::direct_commands_use_report_contract stdout ----

thread 'app::tests::direct_commands_use_report_contract' (2222899) panicked at crates/slophammer-cli/src/app.rs:413:9:
assertion `left == right` failed
  left: 0
 right: 1

---- app::tests::rust_failure_fixtures_report_findings stdout ----

thread 'app::tests::rust_failure_fixtures_report_findings' (2222903) panicked at crates/slophammer-cli/src/app.rs:378:13:
assertion `left == right` failed: rust-unsafe
  left: 0
 right: 1

failures:
    app::tests::direct_commands_use_report_contract
    app::tests::rust_failure_fixtures_report_findings
    rust_rules::unsafe_policy::tests::allow_documented_requires_allow_entry

test result: FAILED. 60 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
