*** crates/slophammer-cli/src/rust_rules/unsafe_policy.rs:51:5: replace unsafe_paths -> Vec<String> with vec!["xyzzy".into()]

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/unsafe_policy.rs
+++ replace unsafe_paths -> Vec<String> with vec!["xyzzy".into()]
@@ -43,24 +43,17 @@
                 path,
                 "Rust unsafe code must be documented with an allow entry",
             )
         })
         .collect()
 }
 
 fn unsafe_paths(snapshot: &Snapshot, config: &Config) -> Vec<String> {
-    scope::configured_rust_files(snapshot, config)
-        .into_iter()
-        .filter(|path| {
-            snapshot
-                .file(path)
-                .is_some_and(|file| file_contains_unsafe(&file.content))
-        })
-        .collect()
+    vec!["xyzzy".into()] /* ~ changed by cargo-mutants ~ */
 }
 
 fn file_contains_unsafe(content: &str) -> bool {
     let Ok(parsed) = syn::parse_file(content) else {
         return content.contains("unsafe");
     };
     let mut visitor = UnsafeVisitor::default();
     visitor.visit_file(&parsed);

---- rust_rules::unsafe_policy::tests::allow_entry_suppresses_forbidden_unsafe stdout ----

thread 'rust_rules::unsafe_policy::tests::allow_entry_suppresses_forbidden_unsafe' (2224922) panicked at crates/slophammer-cli/src/rust_rules/unsafe_policy.rs:157:9:
assertion failed: findings.is_empty()

---- app::tests::clean_fixture_has_no_findings stdout ----

thread 'app::tests::clean_fixture_has_no_findings' (2224872) panicked at crates/slophammer-cli/src/app.rs:351:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    app::tests::clean_fixture_has_no_findings
    rust_rules::unsafe_policy::tests::allow_entry_suppresses_forbidden_unsafe

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
