*** crates/slophammer-cli/src/rust_rules/unsafe_policy.rs:62:5: replace file_contains_unsafe -> bool with true

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/unsafe_policy.rs
+++ replace file_contains_unsafe -> bool with true
@@ -54,22 +54,17 @@
             snapshot
                 .file(path)
                 .is_some_and(|file| file_contains_unsafe(&file.content))
         })
         .collect()
 }
 
 fn file_contains_unsafe(content: &str) -> bool {
-    let Ok(parsed) = syn::parse_file(content) else {
-        return content.contains("unsafe");
-    };
-    let mut visitor = UnsafeVisitor::default();
-    visitor.visit_file(&parsed);
-    visitor.found
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 fn unsafe_allowed(config: &Config, path: &str) -> bool {
     config
         .rust
         .as_ref()
         .and_then(|rust| rust.unsafe_policy.as_ref())
         .is_some_and(|policy| {

---- app::tests::clean_fixture_has_no_findings stdout ----

thread 'app::tests::clean_fixture_has_no_findings' (2225980) panicked at crates/slophammer-cli/src/app.rs:351:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    app::tests::clean_fixture_has_no_findings

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
