*** crates/slophammer-cli/src/rust_rules/unsafe_policy.rs:62:5: replace file_contains_unsafe -> bool with false

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/unsafe_policy.rs
+++ replace file_contains_unsafe -> bool with false
@@ -54,22 +54,17 @@
             snapshot
                 .file(path)
                 .is_some_and(|file| file_contains_unsafe(&file.content))
         })
         .collect()
 }
 
 fn file_contains_unsafe(content: &str) -> bool {
-    let Ok(parsed) = syn::parse_file(content) else {
-        return content.contains("unsafe");
-    };
-    let mut visitor = UnsafeVisitor::default();
-    visitor.visit_file(&parsed);
-    visitor.found
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 fn unsafe_allowed(config: &Config, path: &str) -> bool {
     config
         .rust
         .as_ref()
         .and_then(|rust| rust.unsafe_policy.as_ref())
         .is_some_and(|policy| {

---- rust_rules::unsafe_policy::tests::detects_unsafe_blocks stdout ----

thread 'rust_rules::unsafe_policy::tests::detects_unsafe_blocks' (2226834) panicked at crates/slophammer-cli/src/rust_rules/unsafe_policy.rs:128:9:
assertion failed: file_contains_unsafe("fn main() { unsafe { core::ptr::null::<u8>(); } }")

---- rust_rules::unsafe_policy::tests::allow_documented_requires_allow_entry stdout ----

thread 'rust_rules::unsafe_policy::tests::allow_documented_requires_allow_entry' (2226832) panicked at crates/slophammer-cli/src/rust_rules/unsafe_policy.rs:178:9:
assertion `left == right` failed
  left: 0
 right: 1

---- app::tests::direct_commands_use_report_contract stdout ----

thread 'app::tests::direct_commands_use_report_contract' (2226785) panicked at crates/slophammer-cli/src/app.rs:413:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    app::tests::direct_commands_use_report_contract
    app::tests::rust_failure_fixtures_report_findings
    rust_rules::unsafe_policy::tests::allow_documented_requires_allow_entry
    rust_rules::unsafe_policy::tests::detects_unsafe_blocks

test result: FAILED. 59 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
