*** crates/slophammer-cli/src/rust_rules/unsafe_policy.rs:71:5: replace unsafe_allowed -> bool with true

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/unsafe_policy.rs
+++ replace unsafe_allowed -> bool with true
@@ -63,26 +63,17 @@
         return content.contains("unsafe");
     };
     let mut visitor = UnsafeVisitor::default();
     visitor.visit_file(&parsed);
     visitor.found
 }
 
 fn unsafe_allowed(config: &Config, path: &str) -> bool {
-    config
-        .rust
-        .as_ref()
-        .and_then(|rust| rust.unsafe_policy.as_ref())
-        .is_some_and(|policy| {
-            policy.allow.iter().any(|allow| {
-                !allow.reason.trim().is_empty()
-                    && (path == allow.path || path.starts_with(&format!("{}/", allow.path)))
-            })
-        })
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 #[derive(Default)]
 struct UnsafeVisitor {
     found: bool,
 }
 
 impl<'ast> Visit<'ast> for UnsafeVisitor {

---- rust_rules::unsafe_policy::tests::allow_documented_requires_allow_entry stdout ----

thread 'rust_rules::unsafe_policy::tests::allow_documented_requires_allow_entry' (2227927) panicked at crates/slophammer-cli/src/rust_rules/unsafe_policy.rs:174:9:
assertion `left == right` failed
  left: 0
 right: 1

---- app::tests::direct_commands_use_report_contract stdout ----

thread 'app::tests::direct_commands_use_report_contract' (2227880) panicked at crates/slophammer-cli/src/app.rs:413:9:
assertion `left == right` failed
  left: 0
 right: 1

---- app::tests::rust_failure_fixtures_report_findings stdout ----

thread 'app::tests::rust_failure_fixtures_report_findings' (2227884) panicked at crates/slophammer-cli/src/app.rs:378:13:
assertion `left == right` failed: rust-unsafe
  left: 0
 right: 1

failures:
    app::tests::direct_commands_use_report_contract
    app::tests::rust_failure_fixtures_report_findings
    rust_rules::unsafe_policy::tests::allow_documented_requires_allow_entry

test result: FAILED. 60 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
