*** crates/slophammer-cli/src/rust_rules/unsafe_policy.rs:71:5: replace unsafe_allowed -> bool with false

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/unsafe_policy.rs
+++ replace unsafe_allowed -> bool with false
@@ -63,26 +63,17 @@
         return content.contains("unsafe");
     };
     let mut visitor = UnsafeVisitor::default();
     visitor.visit_file(&parsed);
     visitor.found
 }
 
 fn unsafe_allowed(config: &Config, path: &str) -> bool {
-    config
-        .rust
-        .as_ref()
-        .and_then(|rust| rust.unsafe_policy.as_ref())
-        .is_some_and(|policy| {
-            policy.allow.iter().any(|allow| {
-                !allow.reason.trim().is_empty()
-                    && (path == allow.path || path.starts_with(&format!("{}/", allow.path)))
-            })
-        })
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 #[derive(Default)]
 struct UnsafeVisitor {
     found: bool,
 }
 
 impl<'ast> Visit<'ast> for UnsafeVisitor {

---- rust_rules::unsafe_policy::tests::allow_entry_suppresses_forbidden_unsafe stdout ----

thread 'rust_rules::unsafe_policy::tests::allow_entry_suppresses_forbidden_unsafe' (2228737) panicked at crates/slophammer-cli/src/rust_rules/unsafe_policy.rs:155:9:
assertion failed: findings.is_empty()

failures:
    rust_rules::unsafe_policy::tests::allow_entry_suppresses_forbidden_unsafe

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
