*** crates/slophammer-cli/src/rust_rules/unsafe_policy.rs:78:21: replace && with || in unsafe_allowed

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/unsafe_policy.rs
+++ replace && with || in unsafe_allowed
@@ -70,17 +70,17 @@
 fn unsafe_allowed(config: &Config, path: &str) -> bool {
     config
         .rust
         .as_ref()
         .and_then(|rust| rust.unsafe_policy.as_ref())
         .is_some_and(|policy| {
             policy.allow.iter().any(|allow| {
                 !allow.reason.trim().is_empty()
-                    && (path == allow.path || path.starts_with(&format!("{}/", allow.path)))
+                    || /* ~ changed by cargo-mutants ~ */ (path == allow.path || path.starts_with(&format!("{}/", allow.path)))
             })
         })
 }
 
 #[derive(Default)]
 struct UnsafeVisitor {
     found: bool,
 }

*** result: Success
