*** crates/slophammer-cli/src/rust_rules/unsafe_policy.rs:78:44: replace || with && in unsafe_allowed

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/unsafe_policy.rs
+++ replace || with && in unsafe_allowed
@@ -70,17 +70,17 @@
 fn unsafe_allowed(config: &Config, path: &str) -> bool {
     config
         .rust
         .as_ref()
         .and_then(|rust| rust.unsafe_policy.as_ref())
         .is_some_and(|policy| {
             policy.allow.iter().any(|allow| {
                 !allow.reason.trim().is_empty()
-                    && (path == allow.path || path.starts_with(&format!("{}/", allow.path)))
+                    && (path == allow.path && /* ~ changed by cargo-mutants ~ */ path.starts_with(&format!("{}/", allow.path)))
             })
         })
 }
 
 #[derive(Default)]
 struct UnsafeVisitor {
     found: bool,
 }

---- rust_rules::unsafe_policy::tests::allow_entry_suppresses_forbidden_unsafe stdout ----

thread 'rust_rules::unsafe_policy::tests::allow_entry_suppresses_forbidden_unsafe' (2231838) panicked at crates/slophammer-cli/src/rust_rules/unsafe_policy.rs:164:9:
assertion failed: findings.is_empty()

failures:
    rust_rules::unsafe_policy::tests::allow_entry_suppresses_forbidden_unsafe

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
