*** crates/slophammer-cli/src/rust_rules/unsafe_policy.rs:90:9: replace <impl Visit<'ast> for UnsafeVisitor>::visit_expr_unsafe with ()

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/unsafe_policy.rs
+++ replace <impl Visit<'ast> for UnsafeVisitor>::visit_expr_unsafe with ()
@@ -82,18 +82,17 @@
 
 #[derive(Default)]
 struct UnsafeVisitor {
     found: bool,
 }
 
 impl<'ast> Visit<'ast> for UnsafeVisitor {
     fn visit_expr_unsafe(&mut self, node: &'ast syn::ExprUnsafe) {
-        self.found = true;
-        visit::visit_expr_unsafe(self, node);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     fn visit_item_fn(&mut self, node: &'ast syn::ItemFn) {
         if node.sig.unsafety.is_some() {
             self.found = true;
         }
         visit::visit_item_fn(self, node);
     }

---- rust_rules::unsafe_policy::tests::detects_unsafe_blocks stdout ----

thread 'rust_rules::unsafe_policy::tests::detects_unsafe_blocks' (2233795) panicked at crates/slophammer-cli/src/rust_rules/unsafe_policy.rs:132:9:
assertion failed: file_contains_unsafe("fn main() { unsafe { core::ptr::null::<u8>(); } }")

---- rust_rules::unsafe_policy::tests::allow_documented_requires_allow_entry stdout ----

thread 'rust_rules::unsafe_policy::tests::allow_documented_requires_allow_entry' (2233793) panicked at crates/slophammer-cli/src/rust_rules/unsafe_policy.rs:182:9:
assertion `left == right` failed
  left: 0
 right: 1

---- app::tests::direct_commands_use_report_contract stdout ----

thread 'app::tests::direct_commands_use_report_contract' (2233746) panicked at crates/slophammer-cli/src/app.rs:413:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    app::tests::direct_commands_use_report_contract
    app::tests::rust_failure_fixtures_report_findings
    rust_rules::unsafe_policy::tests::allow_documented_requires_allow_entry
    rust_rules::unsafe_policy::tests::detects_unsafe_blocks

test result: FAILED. 59 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
