*** crates/slophammer-cli/src/rust_rules/unsafe_policy.rs:95:9: replace <impl Visit<'ast> for UnsafeVisitor>::visit_item_fn with ()

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/unsafe_policy.rs
+++ replace <impl Visit<'ast> for UnsafeVisitor>::visit_item_fn with ()
@@ -87,20 +87,17 @@
 
 impl<'ast> Visit<'ast> for UnsafeVisitor {
     fn visit_expr_unsafe(&mut self, node: &'ast syn::ExprUnsafe) {
         self.found = true;
         visit::visit_expr_unsafe(self, node);
     }
 
     fn visit_item_fn(&mut self, node: &'ast syn::ItemFn) {
-        if node.sig.unsafety.is_some() {
-            self.found = true;
-        }
-        visit::visit_item_fn(self, node);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     fn visit_item_trait(&mut self, node: &'ast syn::ItemTrait) {
         if node.unsafety.is_some() {
             self.found = true;
         }
         visit::visit_item_trait(self, node);
     }

---- rust_rules::unsafe_policy::tests::allow_documented_requires_allow_entry stdout ----

thread 'rust_rules::unsafe_policy::tests::allow_documented_requires_allow_entry' (2234894) panicked at crates/slophammer-cli/src/rust_rules/unsafe_policy.rs:180:9:
assertion `left == right` failed
  left: 0
 right: 1

---- rust_rules::unsafe_policy::tests::detects_unsafe_blocks stdout ----

thread 'rust_rules::unsafe_policy::tests::detects_unsafe_blocks' (2234896) panicked at crates/slophammer-cli/src/rust_rules/unsafe_policy.rs:130:9:
assertion failed: file_contains_unsafe("fn main() { unsafe { core::ptr::null::<u8>(); } }")

---- app::tests::direct_commands_use_report_contract stdout ----

thread 'app::tests::direct_commands_use_report_contract' (2234847) panicked at crates/slophammer-cli/src/app.rs:413:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    app::tests::direct_commands_use_report_contract
    app::tests::rust_failure_fixtures_report_findings
    rust_rules::unsafe_policy::tests::allow_documented_requires_allow_entry
    rust_rules::unsafe_policy::tests::detects_unsafe_blocks

test result: FAILED. 59 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
