*** crates/slophammer-cli/src/rust_rules/unsafe_policy.rs:9:5: replace policy_findings -> Vec<Finding> with vec![]

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/unsafe_policy.rs
+++ replace policy_findings -> Vec<Finding> with vec![]
@@ -1,33 +1,17 @@
 use super::definitions::{definition, rule_ids};
 use super::scope;
 use crate::config::{Config, UnsafePolicy};
 use crate::core::Finding;
 use crate::scan::Snapshot;
 use syn::visit::{self, Visit};
 
 pub fn policy_findings(snapshot: &Snapshot, config: &Config) -> Vec<Finding> {
-    if !super::is_rust_project(snapshot) {
-        return Vec::new();
-    }
-    let Some(rust) = &config.rust else {
-        return vec![Finding::new(definition(
-            rule_ids::RUST_UNSAFE_POLICY_REQUIRED,
-        ))];
-    };
-    let Some(policy) = &rust.unsafe_policy else {
-        return vec![Finding::new(definition(
-            rule_ids::RUST_UNSAFE_POLICY_REQUIRED,
-        ))];
-    };
-    match policy.policy {
-        UnsafePolicy::Forbid => forbid_findings(snapshot, config),
-        UnsafePolicy::AllowDocumented => documented_findings(snapshot, config),
-    }
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 fn forbid_findings(snapshot: &Snapshot, config: &Config) -> Vec<Finding> {
     unsafe_paths(snapshot, config)
         .into_iter()
         .filter(|path| !unsafe_allowed(config, path))
         .map(|path| Finding::at_path(definition(rule_ids::RUST_UNSAFE_POLICY_REQUIRED), path))
         .collect()

---- rust_rules::unsafe_policy::tests::missing_policy_is_a_finding stdout ----

thread 'rust_rules::unsafe_policy::tests::missing_policy_is_a_finding' (2216320) panicked at crates/slophammer-cli/src/rust_rules/unsafe_policy.rs:125:9:
assertion `left == right` failed
  left: 0
 right: 1

---- rust_rules::unsafe_policy::tests::allow_documented_requires_allow_entry stdout ----

thread 'rust_rules::unsafe_policy::tests::allow_documented_requires_allow_entry' (2216316) panicked at crates/slophammer-cli/src/rust_rules/unsafe_policy.rs:167:9:
assertion `left == right` failed
  left: 0
 right: 1

---- app::tests::direct_commands_use_report_contract stdout ----

thread 'app::tests::direct_commands_use_report_contract' (2216258) panicked at crates/slophammer-cli/src/app.rs:413:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    app::tests::direct_commands_use_report_contract
    app::tests::rust_failure_fixtures_report_findings
    rust_rules::unsafe_policy::tests::allow_documented_requires_allow_entry
    rust_rules::unsafe_policy::tests::missing_policy_is_a_finding

test result: FAILED. 59 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
