*** crates/slophammer-cli/src/rust_rules/workflow_binding.rs:115:5: replace neutralized -> bool with true

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/workflow_binding.rs
+++ replace neutralized -> bool with true
@@ -107,20 +107,17 @@
         })
         .unwrap_or_default()
 }
 
 /// A job or step is neutralized when it cannot run or cannot fail: a literal
 /// false `if:` condition or a literal `continue-on-error: true`. Non-literal
 /// expressions stay credited; the checker ships no expression evaluator.
 fn neutralized(entry: &Value) -> bool {
-    if literal_bool(entry.get("continue-on-error"), true) {
-        return true;
-    }
-    literal_bool(entry.get("if"), false)
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 fn literal_bool(value: Option<&Value>, wanted: bool) -> bool {
     match value {
         Some(Value::Bool(actual)) => *actual == wanted,
         Some(Value::String(text)) => literal_bool_text(text, wanted),
         _ => false,
     }

---- rust_rules::evidence::tests::makefiles_need_a_make_invocation stdout ----

thread 'rust_rules::evidence::tests::makefiles_need_a_make_invocation' (2261099) panicked at crates/slophammer-cli/src/rust_rules/evidence.rs:206:9:
assertion failed: referenced.contains("cargo test")

---- rust_rules::evidence::tests::unreferenced_scripts_are_not_evidence stdout ----

thread 'rust_rules::evidence::tests::unreferenced_scripts_are_not_evidence' (2261102) panicked at crates/slophammer-cli/src/rust_rules/evidence.rs:170:9:
assertion failed: text.contains("cargo test")

---- rust_rules::tests::accepts_stricter_coverage_thresholds stdout ----

thread 'rust_rules::tests::accepts_stricter_coverage_thresholds' (2261108) panicked at crates/slophammer-cli/src/rust_rules/mod.rs:407:9:
assertion failed: rust_coverage(&snapshot, &config).is_empty()

failures:
    app::tests::clean_fixture_has_no_findings
    rust_rules::evidence::tests::makefiles_need_a_make_invocation
    rust_rules::evidence::tests::referenced_scripts_are_evidence_one_hop_deep
    rust_rules::evidence::tests::unreferenced_scripts_are_not_evidence
    rust_rules::tests::accepts_stricter_coverage_thresholds
    rust_rules::workflow_binding::tests::matrix_commands_expand_into_evidence
    rust_rules::workflow_binding::tests::neutralized_steps_and_jobs_are_dropped
    rust_rules::workflow_binding::tests::non_literal_expressions_stay_credited
    rust_rules::workflow_binding::tests::surviving_steps_contribute_runs_and_uses

test result: FAILED. 54 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
