*** crates/slophammer-cli/src/rust_rules/workflow_binding.rs:122:5: replace literal_bool -> bool with false

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/workflow_binding.rs
+++ replace literal_bool -> bool with false
@@ -114,21 +114,17 @@
 fn neutralized(entry: &Value) -> bool {
     if literal_bool(entry.get("continue-on-error"), true) {
         return true;
     }
     literal_bool(entry.get("if"), false)
 }
 
 fn literal_bool(value: Option<&Value>, wanted: bool) -> bool {
-    match value {
-        Some(Value::Bool(actual)) => *actual == wanted,
-        Some(Value::String(text)) => literal_bool_text(text, wanted),
-        _ => false,
-    }
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 fn literal_bool_text(text: &str, wanted: bool) -> bool {
     let mut trimmed = text.trim();
     if let Some(inner) = trimmed
         .strip_prefix("${{")
         .and_then(|rest| rest.strip_suffix("}}"))
     {

---- rust_rules::workflow_binding::tests::neutralized_steps_and_jobs_are_dropped stdout ----

thread 'rust_rules::workflow_binding::tests::neutralized_steps_and_jobs_are_dropped' (2264420) panicked at crates/slophammer-cli/src/rust_rules/workflow_binding.rs:226:9:
assertion `left == right` failed
  left: Some("cargo test --workspace\ncargo clippy\ncargo fmt --check")
 right: Some("cargo fmt --check")

failures:
    rust_rules::workflow_binding::tests::neutralized_steps_and_jobs_are_dropped

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
