*** crates/slophammer-cli/src/rust_rules/workflow_binding.rs:123:9: delete match arm Some(Value::Bool(actual)) in literal_bool

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/workflow_binding.rs
+++ delete match arm Some(Value::Bool(actual)) in literal_bool
@@ -115,17 +115,17 @@
     if literal_bool(entry.get("continue-on-error"), true) {
         return true;
     }
     literal_bool(entry.get("if"), false)
 }
 
 fn literal_bool(value: Option<&Value>, wanted: bool) -> bool {
     match value {
-        Some(Value::Bool(actual)) => *actual == wanted,
+         /* ~ changed by cargo-mutants ~ */
         Some(Value::String(text)) => literal_bool_text(text, wanted),
         _ => false,
     }
 }
 
 fn literal_bool_text(text: &str, wanted: bool) -> bool {
     let mut trimmed = text.trim();
     if let Some(inner) = trimmed

---- rust_rules::workflow_binding::tests::neutralized_steps_and_jobs_are_dropped stdout ----

thread 'rust_rules::workflow_binding::tests::neutralized_steps_and_jobs_are_dropped' (2265525) panicked at crates/slophammer-cli/src/rust_rules/workflow_binding.rs:230:9:
assertion `left == right` failed
  left: Some("cargo test --workspace\ncargo clippy\ncargo fmt --check")
 right: Some("cargo fmt --check")

failures:
    rust_rules::workflow_binding::tests::neutralized_steps_and_jobs_are_dropped

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
