*** crates/slophammer-cli/src/rust_rules/workflow_binding.rs:124:9: delete match arm Some(Value::String(text)) in literal_bool

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/workflow_binding.rs
+++ delete match arm Some(Value::String(text)) in literal_bool
@@ -116,17 +116,17 @@
         return true;
     }
     literal_bool(entry.get("if"), false)
 }
 
 fn literal_bool(value: Option<&Value>, wanted: bool) -> bool {
     match value {
         Some(Value::Bool(actual)) => *actual == wanted,
-        Some(Value::String(text)) => literal_bool_text(text, wanted),
+         /* ~ changed by cargo-mutants ~ */
         _ => false,
     }
 }
 
 fn literal_bool_text(text: &str, wanted: bool) -> bool {
     let mut trimmed = text.trim();
     if let Some(inner) = trimmed
         .strip_prefix("${{")

*** result: Success
