*** crates/slophammer-cli/src/rust_rules/workflow_binding.rs:130:5: replace literal_bool_text -> bool with true

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/workflow_binding.rs
+++ replace literal_bool_text -> bool with true
@@ -122,24 +122,17 @@
     match value {
         Some(Value::Bool(actual)) => *actual == wanted,
         Some(Value::String(text)) => literal_bool_text(text, wanted),
         _ => false,
     }
 }
 
 fn literal_bool_text(text: &str, wanted: bool) -> bool {
-    let mut trimmed = text.trim();
-    if let Some(inner) = trimmed
-        .strip_prefix("${{")
-        .and_then(|rest| rest.strip_suffix("}}"))
-    {
-        trimmed = inner.trim();
-    }
-    trimmed == if wanted { "true" } else { "false" }
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 /// Triggers bind when the workflow can fire for integration: pull requests,
 /// merge groups, schedules, or pushes whose branch filter is absent,
 /// wildcarded, or names an integration branch.
 fn binding_triggers(triggers: Option<&Value>) -> bool {
     match triggers {
         Some(Value::String(name)) => binding_trigger_name(name),

---- rust_rules::workflow_binding::tests::non_literal_expressions_stay_credited stdout ----

thread 'rust_rules::workflow_binding::tests::non_literal_expressions_stay_credited' (2268844) panicked at crates/slophammer-cli/src/rust_rules/workflow_binding.rs:257:9:
assertion failed: text.contains("cargo test --workspace")

failures:
    rust_rules::workflow_binding::tests::non_literal_expressions_stay_credited

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
