*** crates/slophammer-cli/src/rust_rules/workflow_binding.rs:130:5: replace literal_bool_text -> bool with false

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/workflow_binding.rs
+++ replace literal_bool_text -> bool with false
@@ -122,24 +122,17 @@
     match value {
         Some(Value::Bool(actual)) => *actual == wanted,
         Some(Value::String(text)) => literal_bool_text(text, wanted),
         _ => false,
     }
 }
 
 fn literal_bool_text(text: &str, wanted: bool) -> bool {
-    let mut trimmed = text.trim();
-    if let Some(inner) = trimmed
-        .strip_prefix("${{")
-        .and_then(|rest| rest.strip_suffix("}}"))
-    {
-        trimmed = inner.trim();
-    }
-    trimmed == if wanted { "true" } else { "false" }
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 /// Triggers bind when the workflow can fire for integration: pull requests,
 /// merge groups, schedules, or pushes whose branch filter is absent,
 /// wildcarded, or names an integration branch.
 fn binding_triggers(triggers: Option<&Value>) -> bool {
     match triggers {
         Some(Value::String(name)) => binding_trigger_name(name),

*** result: Success
