*** crates/slophammer-cli/src/rust_rules/workflow_binding.rs:137:13: replace == with != in literal_bool_text

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/workflow_binding.rs
+++ replace == with != in literal_bool_text
@@ -129,17 +129,17 @@
 fn literal_bool_text(text: &str, wanted: bool) -> bool {
     let mut trimmed = text.trim();
     if let Some(inner) = trimmed
         .strip_prefix("${{")
         .and_then(|rest| rest.strip_suffix("}}"))
     {
         trimmed = inner.trim();
     }
-    trimmed == if wanted { "true" } else { "false" }
+    trimmed != /* ~ changed by cargo-mutants ~ */ if wanted { "true" } else { "false" }
 }
 
 /// Triggers bind when the workflow can fire for integration: pull requests,
 /// merge groups, schedules, or pushes whose branch filter is absent,
 /// wildcarded, or names an integration branch.
 fn binding_triggers(triggers: Option<&Value>) -> bool {
     match triggers {
         Some(Value::String(name)) => binding_trigger_name(name),

---- rust_rules::workflow_binding::tests::non_literal_expressions_stay_credited stdout ----

thread 'rust_rules::workflow_binding::tests::non_literal_expressions_stay_credited' (2271177) panicked at crates/slophammer-cli/src/rust_rules/workflow_binding.rs:264:9:
assertion failed: text.contains("cargo test --workspace")

failures:
    rust_rules::workflow_binding::tests::non_literal_expressions_stay_credited

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
