*** crates/slophammer-cli/src/rust_rules/workflow_binding.rs:144:5: replace binding_triggers -> bool with true

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/workflow_binding.rs
+++ replace binding_triggers -> bool with true
@@ -136,28 +136,17 @@
     }
     trimmed == if wanted { "true" } else { "false" }
 }
 
 /// Triggers bind when the workflow can fire for integration: pull requests,
 /// merge groups, schedules, or pushes whose branch filter is absent,
 /// wildcarded, or names an integration branch.
 fn binding_triggers(triggers: Option<&Value>) -> bool {
-    match triggers {
-        Some(Value::String(name)) => binding_trigger_name(name),
-        Some(Value::Sequence(names)) => names
-            .iter()
-            .filter_map(Value::as_str)
-            .any(binding_trigger_name),
-        Some(Value::Mapping(entries)) => entries.iter().any(|(name, value)| {
-            name.as_str()
-                .is_some_and(|name| binding_trigger_entry(name, value))
-        }),
-        _ => false,
-    }
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 fn binding_trigger_name(name: &str) -> bool {
     matches!(
         name,
         "push" | "pull_request" | "pull_request_target" | "merge_group" | "schedule"
     )
 }

---- rust_rules::workflow_binding::tests::tag_only_push_triggers_do_not_bind stdout ----

thread 'rust_rules::workflow_binding::tests::tag_only_push_triggers_do_not_bind' (2272349) panicked at crates/slophammer-cli/src/rust_rules/workflow_binding.rs:287:9:
assertion `left == right` failed
  left: Some("cargo test --workspace")
 right: Some("")

---- rust_rules::workflow_binding::tests::neutralized_workflow_contributes_no_evidence stdout ----

thread 'rust_rules::workflow_binding::tests::neutralized_workflow_contributes_no_evidence' (2272346) panicked at crates/slophammer-cli/src/rust_rules/workflow_binding.rs:201:9:
assertion `left == right` failed
  left: Some("go test ./...")
 right: Some("")

failures:
    rust_rules::workflow_binding::tests::neutralized_workflow_contributes_no_evidence
    rust_rules::workflow_binding::tests::tag_only_push_triggers_do_not_bind

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
