*** crates/slophammer-cli/src/rust_rules/workflow_binding.rs:145:9: delete match arm Some(Value::String(name)) in binding_triggers

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/workflow_binding.rs
+++ delete match arm Some(Value::String(name)) in binding_triggers
@@ -137,17 +137,17 @@
     trimmed == if wanted { "true" } else { "false" }
 }
 
 /// Triggers bind when the workflow can fire for integration: pull requests,
 /// merge groups, schedules, or pushes whose branch filter is absent,
 /// wildcarded, or names an integration branch.
 fn binding_triggers(triggers: Option<&Value>) -> bool {
     match triggers {
-        Some(Value::String(name)) => binding_trigger_name(name),
+         /* ~ changed by cargo-mutants ~ */
         Some(Value::Sequence(names)) => names
             .iter()
             .filter_map(Value::as_str)
             .any(binding_trigger_name),
         Some(Value::Mapping(entries)) => entries.iter().any(|(name, value)| {
             name.as_str()
                 .is_some_and(|name| binding_trigger_entry(name, value))
         }),

*** result: Success
