*** crates/slophammer-cli/src/rust_rules/workflow_binding.rs:146:9: delete match arm Some(Value::Sequence(names)) in binding_triggers

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/workflow_binding.rs
+++ delete match arm Some(Value::Sequence(names)) in binding_triggers
@@ -138,20 +138,17 @@
 }
 
 /// Triggers bind when the workflow can fire for integration: pull requests,
 /// merge groups, schedules, or pushes whose branch filter is absent,
 /// wildcarded, or names an integration branch.
 fn binding_triggers(triggers: Option<&Value>) -> bool {
     match triggers {
         Some(Value::String(name)) => binding_trigger_name(name),
-        Some(Value::Sequence(names)) => names
-            .iter()
-            .filter_map(Value::as_str)
-            .any(binding_trigger_name),
+         /* ~ changed by cargo-mutants ~ */
         Some(Value::Mapping(entries)) => entries.iter().any(|(name, value)| {
             name.as_str()
                 .is_some_and(|name| binding_trigger_entry(name, value))
         }),
         _ => false,
     }
 }

---- rust_rules::evidence::tests::makefiles_need_a_make_invocation stdout ----

thread 'rust_rules::evidence::tests::makefiles_need_a_make_invocation' (2275595) panicked at crates/slophammer-cli/src/rust_rules/evidence.rs:206:9:
assertion failed: referenced.contains("cargo test")

---- rust_rules::tests::accepts_stricter_coverage_thresholds stdout ----

thread 'rust_rules::tests::accepts_stricter_coverage_thresholds' (2275604) panicked at crates/slophammer-cli/src/rust_rules/mod.rs:407:9:
assertion failed: rust_coverage(&snapshot, &config).is_empty()

---- rust_rules::workflow_binding::tests::matrix_commands_expand_into_evidence stdout ----

thread 'rust_rules::workflow_binding::tests::matrix_commands_expand_into_evidence' (2275612) panicked at crates/slophammer-cli/src/rust_rules/workflow_binding.rs:279:9:
assertion failed: text.contains("cargo test --workspace")

failures:
    app::tests::clean_fixture_has_no_findings
    rust_rules::evidence::tests::makefiles_need_a_make_invocation
    rust_rules::evidence::tests::referenced_scripts_are_evidence_one_hop_deep
    rust_rules::evidence::tests::unreferenced_scripts_are_not_evidence
    rust_rules::tests::accepts_stricter_coverage_thresholds
    rust_rules::workflow_binding::tests::matrix_commands_expand_into_evidence
    rust_rules::workflow_binding::tests::neutralized_steps_and_jobs_are_dropped
    rust_rules::workflow_binding::tests::non_literal_expressions_stay_credited

test result: FAILED. 55 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
