*** crates/slophammer-cli/src/rust_rules/workflow_binding.rs:150:9: delete match arm Some(Value::Mapping(entries)) in binding_triggers

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/workflow_binding.rs
+++ delete match arm Some(Value::Mapping(entries)) in binding_triggers
@@ -142,20 +142,17 @@
 /// wildcarded, or names an integration branch.
 fn binding_triggers(triggers: Option<&Value>) -> bool {
     match triggers {
         Some(Value::String(name)) => binding_trigger_name(name),
         Some(Value::Sequence(names)) => names
             .iter()
             .filter_map(Value::as_str)
             .any(binding_trigger_name),
-        Some(Value::Mapping(entries)) => entries.iter().any(|(name, value)| {
-            name.as_str()
-                .is_some_and(|name| binding_trigger_entry(name, value))
-        }),
+         /* ~ changed by cargo-mutants ~ */
         _ => false,
     }
 }
 
 fn binding_trigger_name(name: &str) -> bool {
     matches!(
         name,
         "push" | "pull_request" | "pull_request_target" | "merge_group" | "schedule"

---- rust_rules::workflow_binding::tests::surviving_steps_contribute_runs_and_uses stdout ----

thread 'rust_rules::workflow_binding::tests::surviving_steps_contribute_runs_and_uses' (2276712) panicked at crates/slophammer-cli/src/rust_rules/workflow_binding.rs:245:9:
assertion failed: text.contains("uses: actions/checkout@v6")

failures:
    rust_rules::workflow_binding::tests::surviving_steps_contribute_runs_and_uses

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
