*** crates/slophammer-cli/src/rust_rules/workflow_binding.rs:159:5: replace binding_trigger_name -> bool with true

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/workflow_binding.rs
+++ replace binding_trigger_name -> bool with true
@@ -151,20 +151,17 @@
             name.as_str()
                 .is_some_and(|name| binding_trigger_entry(name, value))
         }),
         _ => false,
     }
 }
 
 fn binding_trigger_name(name: &str) -> bool {
-    matches!(
-        name,
-        "push" | "pull_request" | "pull_request_target" | "merge_group" | "schedule"
-    )
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 fn binding_trigger_entry(name: &str, value: &Value) -> bool {
     match name {
         "pull_request" | "pull_request_target" | "merge_group" | "schedule" => true,
         "push" => binding_push_filter(value),
         _ => false,
     }

*** result: Success
