*** crates/slophammer-cli/src/rust_rules/workflow_binding.rs:159:5: replace binding_trigger_name -> bool with false

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/workflow_binding.rs
+++ replace binding_trigger_name -> bool with false
@@ -151,20 +151,17 @@
             name.as_str()
                 .is_some_and(|name| binding_trigger_entry(name, value))
         }),
         _ => false,
     }
 }
 
 fn binding_trigger_name(name: &str) -> bool {
-    matches!(
-        name,
-        "push" | "pull_request" | "pull_request_target" | "merge_group" | "schedule"
-    )
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 fn binding_trigger_entry(name: &str, value: &Value) -> bool {
     match name {
         "pull_request" | "pull_request_target" | "merge_group" | "schedule" => true,
         "push" => binding_push_filter(value),
         _ => false,
     }

---- rust_rules::evidence::tests::referenced_scripts_are_evidence_one_hop_deep stdout ----

thread 'rust_rules::evidence::tests::referenced_scripts_are_evidence_one_hop_deep' (2278953) panicked at crates/slophammer-cli/src/rust_rules/evidence.rs:184:9:
assertion failed: text.contains("cargo test")

---- rust_rules::evidence::tests::makefiles_need_a_make_invocation stdout ----

thread 'rust_rules::evidence::tests::makefiles_need_a_make_invocation' (2278951) panicked at crates/slophammer-cli/src/rust_rules/evidence.rs:206:9:
assertion failed: referenced.contains("cargo test")

---- rust_rules::evidence::tests::unreferenced_scripts_are_not_evidence stdout ----

thread 'rust_rules::evidence::tests::unreferenced_scripts_are_not_evidence' (2278954) panicked at crates/slophammer-cli/src/rust_rules/evidence.rs:170:9:
assertion failed: text.contains("cargo test")

failures:
    app::tests::clean_fixture_has_no_findings
    rust_rules::evidence::tests::makefiles_need_a_make_invocation
    rust_rules::evidence::tests::referenced_scripts_are_evidence_one_hop_deep
    rust_rules::evidence::tests::unreferenced_scripts_are_not_evidence
    rust_rules::tests::accepts_stricter_coverage_thresholds
    rust_rules::workflow_binding::tests::matrix_commands_expand_into_evidence
    rust_rules::workflow_binding::tests::neutralized_steps_and_jobs_are_dropped
    rust_rules::workflow_binding::tests::non_literal_expressions_stay_credited

test result: FAILED. 55 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
