*** crates/slophammer-cli/src/rust_rules/workflow_binding.rs:15:8: delete ! in binding_workflow_text

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/workflow_binding.rs
+++ delete ! in binding_workflow_text
@@ -7,17 +7,17 @@
 /// keeps the raw text so filtering only removes false passes.
 pub fn binding_workflow_text(content: &str) -> Option<String> {
     let document: Value = yaml_serde::from_str(content).ok()?;
     let mapping = document.as_mapping()?;
     let jobs = mapping.get("jobs")?.as_mapping()?;
     if jobs.is_empty() {
         return None;
     }
-    if !binding_triggers(workflow_triggers(&document)) {
+    if  /* ~ changed by cargo-mutants ~ */binding_triggers(workflow_triggers(&document)) {
         return Some(String::new());
     }
     let mut evidence = Vec::new();
     for (_, job) in jobs {
         collect_job_evidence(job, &mut evidence);
     }
     Some(evidence.join("\n"))
 }

---- rust_rules::workflow_binding::tests::neutralized_steps_and_jobs_are_dropped stdout ----

thread 'rust_rules::workflow_binding::tests::neutralized_steps_and_jobs_are_dropped' (2242607) panicked at crates/slophammer-cli/src/rust_rules/workflow_binding.rs:230:9:
assertion `left == right` failed
  left: Some("")
 right: Some("cargo fmt --check")

---- rust_rules::evidence::tests::makefiles_need_a_make_invocation stdout ----

thread 'rust_rules::evidence::tests::makefiles_need_a_make_invocation' (2242589) panicked at crates/slophammer-cli/src/rust_rules/evidence.rs:206:9:
assertion failed: referenced.contains("cargo test")

---- rust_rules::evidence::tests::unreferenced_scripts_are_not_evidence stdout ----

thread 'rust_rules::evidence::tests::unreferenced_scripts_are_not_evidence' (2242592) panicked at crates/slophammer-cli/src/rust_rules/evidence.rs:170:9:
assertion failed: text.contains("cargo test")

failures:
    app::tests::clean_fixture_has_no_findings
    rust_rules::evidence::tests::makefiles_need_a_make_invocation
    rust_rules::evidence::tests::referenced_scripts_are_evidence_one_hop_deep
    rust_rules::evidence::tests::unreferenced_scripts_are_not_evidence
    rust_rules::tests::accepts_stricter_coverage_thresholds
    rust_rules::workflow_binding::tests::matrix_commands_expand_into_evidence
    rust_rules::workflow_binding::tests::neutralized_steps_and_jobs_are_dropped
    rust_rules::workflow_binding::tests::neutralized_workflow_contributes_no_evidence
    rust_rules::workflow_binding::tests::non_literal_expressions_stay_credited
    rust_rules::workflow_binding::tests::surviving_steps_contribute_runs_and_uses
    rust_rules::workflow_binding::tests::tag_only_push_triggers_do_not_bind

test result: FAILED. 52 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
