*** crates/slophammer-cli/src/rust_rules/workflow_binding.rs:166:5: replace binding_trigger_entry -> bool with true

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/workflow_binding.rs
+++ replace binding_trigger_entry -> bool with true
@@ -158,21 +158,17 @@
 fn binding_trigger_name(name: &str) -> bool {
     matches!(
         name,
         "push" | "pull_request" | "pull_request_target" | "merge_group" | "schedule"
     )
 }
 
 fn binding_trigger_entry(name: &str, value: &Value) -> bool {
-    match name {
-        "pull_request" | "pull_request_target" | "merge_group" | "schedule" => true,
-        "push" => binding_push_filter(value),
-        _ => false,
-    }
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 fn binding_push_filter(value: &Value) -> bool {
     let Some(branches) = value.get("branches") else {
         // Defining only tags or tags-ignore stops the workflow from firing
         // for branch pushes entirely, so it is a release trigger, not
         // integration CI; a branches-ignore filter still fires for branches.
         if value.get("branches-ignore").is_some() {

---- rust_rules::workflow_binding::tests::tag_only_push_triggers_do_not_bind stdout ----

thread 'rust_rules::workflow_binding::tests::tag_only_push_triggers_do_not_bind' (2280036) panicked at crates/slophammer-cli/src/rust_rules/workflow_binding.rs:294:9:
assertion `left == right` failed
  left: Some("cargo test --workspace")
 right: Some("")

---- rust_rules::workflow_binding::tests::neutralized_workflow_contributes_no_evidence stdout ----

thread 'rust_rules::workflow_binding::tests::neutralized_workflow_contributes_no_evidence' (2280033) panicked at crates/slophammer-cli/src/rust_rules/workflow_binding.rs:208:9:
assertion `left == right` failed
  left: Some("go test ./...")
 right: Some("")

failures:
    rust_rules::workflow_binding::tests::neutralized_workflow_contributes_no_evidence
    rust_rules::workflow_binding::tests::tag_only_push_triggers_do_not_bind

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
