*** crates/slophammer-cli/src/rust_rules/workflow_binding.rs:166:5: replace binding_trigger_entry -> bool with false

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/workflow_binding.rs
+++ replace binding_trigger_entry -> bool with false
@@ -158,21 +158,17 @@
 fn binding_trigger_name(name: &str) -> bool {
     matches!(
         name,
         "push" | "pull_request" | "pull_request_target" | "merge_group" | "schedule"
     )
 }
 
 fn binding_trigger_entry(name: &str, value: &Value) -> bool {
-    match name {
-        "pull_request" | "pull_request_target" | "merge_group" | "schedule" => true,
-        "push" => binding_push_filter(value),
-        _ => false,
-    }
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 fn binding_push_filter(value: &Value) -> bool {
     let Some(branches) = value.get("branches") else {
         // Defining only tags or tags-ignore stops the workflow from firing
         // for branch pushes entirely, so it is a release trigger, not
         // integration CI; a branches-ignore filter still fires for branches.
         if value.get("branches-ignore").is_some() {

---- rust_rules::workflow_binding::tests::surviving_steps_contribute_runs_and_uses stdout ----

thread 'rust_rules::workflow_binding::tests::surviving_steps_contribute_runs_and_uses' (2281062) panicked at crates/slophammer-cli/src/rust_rules/workflow_binding.rs:244:9:
assertion failed: text.contains("uses: actions/checkout@v6")

failures:
    rust_rules::workflow_binding::tests::surviving_steps_contribute_runs_and_uses

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
