*** crates/slophammer-cli/src/rust_rules/workflow_binding.rs:167:9: delete match arm "pull_request" | "pull_request_target" | "merge_group" | "schedule" in binding_trigger_entry

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/workflow_binding.rs
+++ delete match arm "pull_request" | "pull_request_target" | "merge_group" | "schedule" in binding_trigger_entry
@@ -159,17 +159,17 @@
     matches!(
         name,
         "push" | "pull_request" | "pull_request_target" | "merge_group" | "schedule"
     )
 }
 
 fn binding_trigger_entry(name: &str, value: &Value) -> bool {
     match name {
-        "pull_request" | "pull_request_target" | "merge_group" | "schedule" => true,
+         /* ~ changed by cargo-mutants ~ */
         "push" => binding_push_filter(value),
         _ => false,
     }
 }
 
 fn binding_push_filter(value: &Value) -> bool {
     let Some(branches) = value.get("branches") else {
         // Defining only tags or tags-ignore stops the workflow from firing

---- rust_rules::workflow_binding::tests::surviving_steps_contribute_runs_and_uses stdout ----

thread 'rust_rules::workflow_binding::tests::surviving_steps_contribute_runs_and_uses' (2282137) panicked at crates/slophammer-cli/src/rust_rules/workflow_binding.rs:248:9:
assertion failed: text.contains("uses: actions/checkout@v6")

failures:
    rust_rules::workflow_binding::tests::surviving_steps_contribute_runs_and_uses

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
