*** crates/slophammer-cli/src/rust_rules/workflow_binding.rs:168:9: delete match arm "push" in binding_trigger_entry

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/workflow_binding.rs
+++ delete match arm "push" in binding_trigger_entry
@@ -160,17 +160,17 @@
         name,
         "push" | "pull_request" | "pull_request_target" | "merge_group" | "schedule"
     )
 }
 
 fn binding_trigger_entry(name: &str, value: &Value) -> bool {
     match name {
         "pull_request" | "pull_request_target" | "merge_group" | "schedule" => true,
-        "push" => binding_push_filter(value),
+         /* ~ changed by cargo-mutants ~ */
         _ => false,
     }
 }
 
 fn binding_push_filter(value: &Value) -> bool {
     let Some(branches) = value.get("branches") else {
         // Defining only tags or tags-ignore stops the workflow from firing
         // for branch pushes entirely, so it is a release trigger, not

*** result: Success
