*** crates/slophammer-cli/src/rust_rules/workflow_binding.rs:174:5: replace binding_push_filter -> bool with true

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/workflow_binding.rs
+++ replace binding_push_filter -> bool with true
@@ -166,33 +166,17 @@
     match name {
         "pull_request" | "pull_request_target" | "merge_group" | "schedule" => true,
         "push" => binding_push_filter(value),
         _ => false,
     }
 }
 
 fn binding_push_filter(value: &Value) -> bool {
-    let Some(branches) = value.get("branches") else {
-        // Defining only tags or tags-ignore stops the workflow from firing
-        // for branch pushes entirely, so it is a release trigger, not
-        // integration CI; a branches-ignore filter still fires for branches.
-        if value.get("branches-ignore").is_some() {
-            return true;
-        }
-        return value.get("tags").is_none() && value.get("tags-ignore").is_none();
-    };
-    match branches {
-        Value::String(pattern) => integration_branch_pattern(pattern),
-        Value::Sequence(patterns) => patterns
-            .iter()
-            .filter_map(Value::as_str)
-            .any(integration_branch_pattern),
-        _ => true,
-    }
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 fn integration_branch_pattern(pattern: &str) -> bool {
     pattern.contains('*') || matches!(pattern, "main" | "master" | "trunk" | "develop")
 }
 
 #[cfg(test)]
 mod tests {

---- rust_rules::workflow_binding::tests::neutralized_workflow_contributes_no_evidence stdout ----

thread 'rust_rules::workflow_binding::tests::neutralized_workflow_contributes_no_evidence' (2284367) panicked at crates/slophammer-cli/src/rust_rules/workflow_binding.rs:196:9:
assertion `left == right` failed
  left: Some("go test ./...")
 right: Some("")

---- rust_rules::workflow_binding::tests::tag_only_push_triggers_do_not_bind stdout ----

thread 'rust_rules::workflow_binding::tests::tag_only_push_triggers_do_not_bind' (2284370) panicked at crates/slophammer-cli/src/rust_rules/workflow_binding.rs:282:9:
assertion `left == right` failed
  left: Some("cargo test --workspace")
 right: Some("")

failures:
    rust_rules::workflow_binding::tests::neutralized_workflow_contributes_no_evidence
    rust_rules::workflow_binding::tests::tag_only_push_triggers_do_not_bind

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
