*** crates/slophammer-cli/src/rust_rules/workflow_binding.rs:174:5: replace binding_push_filter -> bool with false

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/workflow_binding.rs
+++ replace binding_push_filter -> bool with false
@@ -166,33 +166,17 @@
     match name {
         "pull_request" | "pull_request_target" | "merge_group" | "schedule" => true,
         "push" => binding_push_filter(value),
         _ => false,
     }
 }
 
 fn binding_push_filter(value: &Value) -> bool {
-    let Some(branches) = value.get("branches") else {
-        // Defining only tags or tags-ignore stops the workflow from firing
-        // for branch pushes entirely, so it is a release trigger, not
-        // integration CI; a branches-ignore filter still fires for branches.
-        if value.get("branches-ignore").is_some() {
-            return true;
-        }
-        return value.get("tags").is_none() && value.get("tags-ignore").is_none();
-    };
-    match branches {
-        Value::String(pattern) => integration_branch_pattern(pattern),
-        Value::Sequence(patterns) => patterns
-            .iter()
-            .filter_map(Value::as_str)
-            .any(integration_branch_pattern),
-        _ => true,
-    }
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 fn integration_branch_pattern(pattern: &str) -> bool {
     pattern.contains('*') || matches!(pattern, "main" | "master" | "trunk" | "develop")
 }
 
 #[cfg(test)]
 mod tests {

*** result: Success
