*** crates/slophammer-cli/src/rust_rules/workflow_binding.rs:181:44: replace && with || in binding_push_filter

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/workflow_binding.rs
+++ replace && with || in binding_push_filter
@@ -173,17 +173,17 @@
 fn binding_push_filter(value: &Value) -> bool {
     let Some(branches) = value.get("branches") else {
         // Defining only tags or tags-ignore stops the workflow from firing
         // for branch pushes entirely, so it is a release trigger, not
         // integration CI; a branches-ignore filter still fires for branches.
         if value.get("branches-ignore").is_some() {
             return true;
         }
-        return value.get("tags").is_none() && value.get("tags-ignore").is_none();
+        return value.get("tags").is_none() || /* ~ changed by cargo-mutants ~ */ value.get("tags-ignore").is_none();
     };
     match branches {
         Value::String(pattern) => integration_branch_pattern(pattern),
         Value::Sequence(patterns) => patterns
             .iter()
             .filter_map(Value::as_str)
             .any(integration_branch_pattern),
         _ => true,

---- rust_rules::workflow_binding::tests::tag_only_push_triggers_do_not_bind stdout ----

thread 'rust_rules::workflow_binding::tests::tag_only_push_triggers_do_not_bind' (2286569) panicked at crates/slophammer-cli/src/rust_rules/workflow_binding.rs:298:9:
assertion `left == right` failed
  left: Some("cargo test --workspace")
 right: Some("")

failures:
    rust_rules::workflow_binding::tests::tag_only_push_triggers_do_not_bind

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
