*** crates/slophammer-cli/src/rust_rules/workflow_binding.rs:184:9: delete match arm Value::String(pattern) in binding_push_filter

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/workflow_binding.rs
+++ delete match arm Value::String(pattern) in binding_push_filter
@@ -176,17 +176,17 @@
         // for branch pushes entirely, so it is a release trigger, not
         // integration CI; a branches-ignore filter still fires for branches.
         if value.get("branches-ignore").is_some() {
             return true;
         }
         return value.get("tags").is_none() && value.get("tags-ignore").is_none();
     };
     match branches {
-        Value::String(pattern) => integration_branch_pattern(pattern),
+         /* ~ changed by cargo-mutants ~ */
         Value::Sequence(patterns) => patterns
             .iter()
             .filter_map(Value::as_str)
             .any(integration_branch_pattern),
         _ => true,
     }
 }

*** result: Success
