*** crates/slophammer-cli/src/rust_rules/workflow_binding.rs:185:9: delete match arm Value::Sequence(patterns) in binding_push_filter

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/workflow_binding.rs
+++ delete match arm Value::Sequence(patterns) in binding_push_filter
@@ -177,20 +177,17 @@
         // integration CI; a branches-ignore filter still fires for branches.
         if value.get("branches-ignore").is_some() {
             return true;
         }
         return value.get("tags").is_none() && value.get("tags-ignore").is_none();
     };
     match branches {
         Value::String(pattern) => integration_branch_pattern(pattern),
-        Value::Sequence(patterns) => patterns
-            .iter()
-            .filter_map(Value::as_str)
-            .any(integration_branch_pattern),
+         /* ~ changed by cargo-mutants ~ */
         _ => true,
     }
 }
 
 fn integration_branch_pattern(pattern: &str) -> bool {
     pattern.contains('*') || matches!(pattern, "main" | "master" | "trunk" | "develop")
 }

---- rust_rules::workflow_binding::tests::neutralized_workflow_contributes_no_evidence stdout ----

thread 'rust_rules::workflow_binding::tests::neutralized_workflow_contributes_no_evidence' (2288678) panicked at crates/slophammer-cli/src/rust_rules/workflow_binding.rs:209:9:
assertion `left == right` failed
  left: Some("go test ./...")
 right: Some("")

failures:
    rust_rules::workflow_binding::tests::neutralized_workflow_contributes_no_evidence

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
