*** crates/slophammer-cli/src/rust_rules/workflow_binding.rs:194:5: replace integration_branch_pattern -> bool with true

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/workflow_binding.rs
+++ replace integration_branch_pattern -> bool with true
@@ -186,17 +186,17 @@
             .iter()
             .filter_map(Value::as_str)
             .any(integration_branch_pattern),
         _ => true,
     }
 }
 
 fn integration_branch_pattern(pattern: &str) -> bool {
-    pattern.contains('*') || matches!(pattern, "main" | "master" | "trunk" | "develop")
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]
     fn neutralized_workflow_contributes_no_evidence() {

---- rust_rules::workflow_binding::tests::neutralized_workflow_contributes_no_evidence stdout ----

thread 'rust_rules::workflow_binding::tests::neutralized_workflow_contributes_no_evidence' (2289444) panicked at crates/slophammer-cli/src/rust_rules/workflow_binding.rs:212:9:
assertion `left == right` failed
  left: Some("go test ./...")
 right: Some("")

failures:
    rust_rules::workflow_binding::tests::neutralized_workflow_contributes_no_evidence

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
