*** crates/slophammer-cli/src/rust_rules/workflow_binding.rs:28:5: replace workflow_triggers -> Option<&Value> with Some(Box::leak(Box::new(Default::default())))

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/workflow_binding.rs
+++ replace workflow_triggers -> Option<&Value> with Some(Box::leak(Box::new(Default::default())))
@@ -20,18 +20,17 @@
         collect_job_evidence(job, &mut evidence);
     }
     Some(evidence.join("\n"))
 }
 
 /// YAML 1.1 resolves a plain `on` key as boolean true, so the trigger entry
 /// is looked up under both spellings.
 fn workflow_triggers(document: &Value) -> Option<&Value> {
-    let mapping = document.as_mapping()?;
-    mapping.get("on").or_else(|| mapping.get(Value::Bool(true)))
+    Some(Box::leak(Box::new(Default::default()))) /* ~ changed by cargo-mutants ~ */
 }
 
 fn collect_job_evidence(job: &Value, evidence: &mut Vec<String>) {
     if neutralized(job) {
         return;
     }
     let Some(steps) = job.get("steps").and_then(Value::as_sequence) else {
         return;

---- rust_rules::evidence::tests::makefiles_need_a_make_invocation stdout ----

thread 'rust_rules::evidence::tests::makefiles_need_a_make_invocation' (2244756) panicked at crates/slophammer-cli/src/rust_rules/evidence.rs:206:9:
assertion failed: referenced.contains("cargo test")

---- rust_rules::evidence::tests::referenced_scripts_are_evidence_one_hop_deep stdout ----

thread 'rust_rules::evidence::tests::referenced_scripts_are_evidence_one_hop_deep' (2244758) panicked at crates/slophammer-cli/src/rust_rules/evidence.rs:184:9:
assertion failed: text.contains("cargo test")

---- rust_rules::evidence::tests::unreferenced_scripts_are_not_evidence stdout ----

thread 'rust_rules::evidence::tests::unreferenced_scripts_are_not_evidence' (2244759) panicked at crates/slophammer-cli/src/rust_rules/evidence.rs:170:9:
assertion failed: text.contains("cargo test")

failures:
    app::tests::clean_fixture_has_no_findings
    rust_rules::evidence::tests::makefiles_need_a_make_invocation
    rust_rules::evidence::tests::referenced_scripts_are_evidence_one_hop_deep
    rust_rules::evidence::tests::unreferenced_scripts_are_not_evidence
    rust_rules::tests::accepts_stricter_coverage_thresholds
    rust_rules::workflow_binding::tests::matrix_commands_expand_into_evidence
    rust_rules::workflow_binding::tests::neutralized_steps_and_jobs_are_dropped
    rust_rules::workflow_binding::tests::non_literal_expressions_stay_credited
    rust_rules::workflow_binding::tests::surviving_steps_contribute_runs_and_uses

test result: FAILED. 54 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
