*** crates/slophammer-cli/src/rust_rules/workflow_binding.rs:33:5: replace collect_job_evidence with ()

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/workflow_binding.rs
+++ replace collect_job_evidence with ()
@@ -25,26 +25,17 @@
 /// YAML 1.1 resolves a plain `on` key as boolean true, so the trigger entry
 /// is looked up under both spellings.
 fn workflow_triggers(document: &Value) -> Option<&Value> {
     let mapping = document.as_mapping()?;
     mapping.get("on").or_else(|| mapping.get(Value::Bool(true)))
 }
 
 fn collect_job_evidence(job: &Value, evidence: &mut Vec<String>) {
-    if neutralized(job) {
-        return;
-    }
-    let Some(steps) = job.get("steps").and_then(Value::as_sequence) else {
-        return;
-    };
-    let matrix_commands = job_matrix_commands(job);
-    for step in steps {
-        collect_step_evidence(step, &matrix_commands, evidence);
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 fn collect_step_evidence(step: &Value, matrix_commands: &[String], evidence: &mut Vec<String>) {
     if neutralized(step) {
         return;
     }
     if let Some(uses) = step.get("uses").and_then(Value::as_str) {
         if !uses.trim().is_empty() {

---- rust_rules::evidence::tests::referenced_scripts_are_evidence_one_hop_deep stdout ----

thread 'rust_rules::evidence::tests::referenced_scripts_are_evidence_one_hop_deep' (2245864) panicked at crates/slophammer-cli/src/rust_rules/evidence.rs:184:9:
assertion failed: text.contains("cargo test")

---- rust_rules::evidence::tests::unreferenced_scripts_are_not_evidence stdout ----

thread 'rust_rules::evidence::tests::unreferenced_scripts_are_not_evidence' (2245865) panicked at crates/slophammer-cli/src/rust_rules/evidence.rs:170:9:
assertion failed: text.contains("cargo test")

---- rust_rules::evidence::tests::makefiles_need_a_make_invocation stdout ----

thread 'rust_rules::evidence::tests::makefiles_need_a_make_invocation' (2245862) panicked at crates/slophammer-cli/src/rust_rules/evidence.rs:206:9:
assertion failed: referenced.contains("cargo test")

failures:
    app::tests::clean_fixture_has_no_findings
    rust_rules::evidence::tests::makefiles_need_a_make_invocation
    rust_rules::evidence::tests::referenced_scripts_are_evidence_one_hop_deep
    rust_rules::evidence::tests::unreferenced_scripts_are_not_evidence
    rust_rules::tests::accepts_stricter_coverage_thresholds
    rust_rules::workflow_binding::tests::matrix_commands_expand_into_evidence
    rust_rules::workflow_binding::tests::neutralized_steps_and_jobs_are_dropped
    rust_rules::workflow_binding::tests::non_literal_expressions_stay_credited
    rust_rules::workflow_binding::tests::surviving_steps_contribute_runs_and_uses

test result: FAILED. 54 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
