*** crates/slophammer-cli/src/rust_rules/workflow_binding.rs:46:5: replace collect_step_evidence with ()

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/workflow_binding.rs
+++ replace collect_step_evidence with ()
@@ -38,35 +38,17 @@
     };
     let matrix_commands = job_matrix_commands(job);
     for step in steps {
         collect_step_evidence(step, &matrix_commands, evidence);
     }
 }
 
 fn collect_step_evidence(step: &Value, matrix_commands: &[String], evidence: &mut Vec<String>) {
-    if neutralized(step) {
-        return;
-    }
-    if let Some(uses) = step.get("uses").and_then(Value::as_str) {
-        if !uses.trim().is_empty() {
-            evidence.push(format!("uses: {uses}"));
-        }
-    }
-    let Some(run) = step.get("run").and_then(Value::as_str) else {
-        return;
-    };
-    if run.trim().is_empty() {
-        return;
-    }
-    if direct_matrix_command(run) && !matrix_commands.is_empty() {
-        evidence.extend(matrix_commands.iter().cloned());
-        return;
-    }
-    evidence.push(run.to_owned());
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 /// A run consisting solely of the matrix.command expression expands to the
 /// job's matrix command values, mirroring the raw-text evidence that the
 /// structural filter would otherwise drop.
 fn direct_matrix_command(run: &str) -> bool {
     let trimmed = run.trim();
     trimmed

---- rust_rules::workflow_binding::tests::non_literal_expressions_stay_credited stdout ----

thread 'rust_rules::workflow_binding::tests::non_literal_expressions_stay_credited' (2246932) panicked at crates/slophammer-cli/src/rust_rules/workflow_binding.rs:246:9:
assertion failed: text.contains("cargo test --workspace")

---- rust_rules::tests::accepts_stricter_coverage_thresholds stdout ----

thread 'rust_rules::tests::accepts_stricter_coverage_thresholds' (2246921) panicked at crates/slophammer-cli/src/rust_rules/mod.rs:407:9:
assertion failed: rust_coverage(&snapshot, &config).is_empty()

---- rust_rules::evidence::tests::unreferenced_scripts_are_not_evidence stdout ----

thread 'rust_rules::evidence::tests::unreferenced_scripts_are_not_evidence' (2246915) panicked at crates/slophammer-cli/src/rust_rules/evidence.rs:170:9:
assertion failed: text.contains("cargo test")

failures:
    app::tests::clean_fixture_has_no_findings
    rust_rules::evidence::tests::makefiles_need_a_make_invocation
    rust_rules::evidence::tests::referenced_scripts_are_evidence_one_hop_deep
    rust_rules::evidence::tests::unreferenced_scripts_are_not_evidence
    rust_rules::tests::accepts_stricter_coverage_thresholds
    rust_rules::workflow_binding::tests::matrix_commands_expand_into_evidence
    rust_rules::workflow_binding::tests::neutralized_steps_and_jobs_are_dropped
    rust_rules::workflow_binding::tests::non_literal_expressions_stay_credited
    rust_rules::workflow_binding::tests::surviving_steps_contribute_runs_and_uses

test result: FAILED. 54 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
