*** crates/slophammer-cli/src/rust_rules/workflow_binding.rs:50:12: delete ! in collect_step_evidence

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/workflow_binding.rs
+++ delete ! in collect_step_evidence
@@ -42,17 +42,17 @@
     }
 }
 
 fn collect_step_evidence(step: &Value, matrix_commands: &[String], evidence: &mut Vec<String>) {
     if neutralized(step) {
         return;
     }
     if let Some(uses) = step.get("uses").and_then(Value::as_str) {
-        if !uses.trim().is_empty() {
+        if  /* ~ changed by cargo-mutants ~ */uses.trim().is_empty() {
             evidence.push(format!("uses: {uses}"));
         }
     }
     let Some(run) = step.get("run").and_then(Value::as_str) else {
         return;
     };
     if run.trim().is_empty() {
         return;

---- rust_rules::workflow_binding::tests::surviving_steps_contribute_runs_and_uses stdout ----

thread 'rust_rules::workflow_binding::tests::surviving_steps_contribute_runs_and_uses' (2248080) panicked at crates/slophammer-cli/src/rust_rules/workflow_binding.rs:248:9:
assertion failed: text.contains("uses: actions/checkout@v6")

failures:
    rust_rules::workflow_binding::tests::surviving_steps_contribute_runs_and_uses

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
