*** crates/slophammer-cli/src/rust_rules/workflow_binding.rs:60:35: replace && with || in collect_step_evidence

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/workflow_binding.rs
+++ replace && with || in collect_step_evidence
@@ -52,17 +52,17 @@
         }
     }
     let Some(run) = step.get("run").and_then(Value::as_str) else {
         return;
     };
     if run.trim().is_empty() {
         return;
     }
-    if direct_matrix_command(run) && !matrix_commands.is_empty() {
+    if direct_matrix_command(run) || /* ~ changed by cargo-mutants ~ */ !matrix_commands.is_empty() {
         evidence.extend(matrix_commands.iter().cloned());
         return;
     }
     evidence.push(run.to_owned());
 }
 
 /// A run consisting solely of the matrix.command expression expands to the
 /// job's matrix command values, mirroring the raw-text evidence that the

*** result: Success
