*** crates/slophammer-cli/src/rust_rules/workflow_binding.rs:60:38: delete ! in collect_step_evidence

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/workflow_binding.rs
+++ delete ! in collect_step_evidence
@@ -52,17 +52,17 @@
         }
     }
     let Some(run) = step.get("run").and_then(Value::as_str) else {
         return;
     };
     if run.trim().is_empty() {
         return;
     }
-    if direct_matrix_command(run) && !matrix_commands.is_empty() {
+    if direct_matrix_command(run) &&  /* ~ changed by cargo-mutants ~ */matrix_commands.is_empty() {
         evidence.extend(matrix_commands.iter().cloned());
         return;
     }
     evidence.push(run.to_owned());
 }
 
 /// A run consisting solely of the matrix.command expression expands to the
 /// job's matrix command values, mirroring the raw-text evidence that the

---- rust_rules::workflow_binding::tests::matrix_commands_expand_into_evidence stdout ----

thread 'rust_rules::workflow_binding::tests::matrix_commands_expand_into_evidence' (2250320) panicked at crates/slophammer-cli/src/rust_rules/workflow_binding.rs:282:9:
assertion failed: text.contains("cargo test --workspace")

failures:
    rust_rules::workflow_binding::tests::matrix_commands_expand_into_evidence

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
