*** crates/slophammer-cli/src/rust_rules/workflow_binding.rs:75:43: replace == with != in direct_matrix_command

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/workflow_binding.rs
+++ replace == with != in direct_matrix_command
@@ -67,17 +67,17 @@
 /// A run consisting solely of the matrix.command expression expands to the
 /// job's matrix command values, mirroring the raw-text evidence that the
 /// structural filter would otherwise drop.
 fn direct_matrix_command(run: &str) -> bool {
     let trimmed = run.trim();
     trimmed
         .strip_prefix("${{")
         .and_then(|rest| rest.strip_suffix("}}"))
-        .is_some_and(|inner| inner.trim() == "matrix.command")
+        .is_some_and(|inner| inner.trim() != /* ~ changed by cargo-mutants ~ */ "matrix.command")
 }
 
 fn job_matrix_commands(job: &Value) -> Vec<String> {
     let Some(matrix) = job
         .get("strategy")
         .and_then(|strategy| strategy.get("matrix"))
     else {
         return Vec::new();

---- rust_rules::workflow_binding::tests::matrix_commands_expand_into_evidence stdout ----

thread 'rust_rules::workflow_binding::tests::matrix_commands_expand_into_evidence' (2253512) panicked at crates/slophammer-cli/src/rust_rules/workflow_binding.rs:282:9:
assertion failed: text.contains("cargo test --workspace")

failures:
    rust_rules::workflow_binding::tests::matrix_commands_expand_into_evidence

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
