*** crates/slophammer-cli/src/rust_rules/workflow_binding.rs:99:5: replace sequence_strings -> Vec<String> with vec!["xyzzy".into()]

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/workflow_binding.rs
+++ replace sequence_strings -> Vec<String> with vec!["xyzzy".into()]
@@ -91,26 +91,17 @@
                 .filter_map(Value::as_str)
                 .map(str::to_owned),
         );
     }
     commands
 }
 
 fn sequence_strings(value: Option<&Value>) -> Vec<String> {
-    value
-        .and_then(Value::as_sequence)
-        .map(|items| {
-            items
-                .iter()
-                .filter_map(Value::as_str)
-                .map(str::to_owned)
-                .collect()
-        })
-        .unwrap_or_default()
+    vec!["xyzzy".into()] /* ~ changed by cargo-mutants ~ */
 }
 
 /// A job or step is neutralized when it cannot run or cannot fail: a literal
 /// false `if:` condition or a literal `continue-on-error: true`. Non-literal
 /// expressions stay credited; the checker ships no expression evaluator.
 fn neutralized(entry: &Value) -> bool {
     if literal_bool(entry.get("continue-on-error"), true) {
         return true;

---- rust_rules::workflow_binding::tests::matrix_commands_expand_into_evidence stdout ----

thread 'rust_rules::workflow_binding::tests::matrix_commands_expand_into_evidence' (2259977) panicked at crates/slophammer-cli/src/rust_rules/workflow_binding.rs:273:9:
assertion failed: text.contains("cargo test --workspace")

failures:
    rust_rules::workflow_binding::tests::matrix_commands_expand_into_evidence

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
