*** crates/slophammer-cli/src/rust_rules/workflow_binding.rs:9:5: replace binding_workflow_text -> Option<String> with None

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/workflow_binding.rs
+++ replace binding_workflow_text -> Option<String> with None
@@ -1,30 +1,17 @@
 use yaml_serde::Value;
 
 /// Returns the command evidence a workflow may contribute: run scripts and
 /// action references from steps that can execute and can fail on integration
 /// branches. Returns `None` when the workflow cannot be structurally
 /// filtered (unparseable, or no jobs mapping), in which case the caller
 /// keeps the raw text so filtering only removes false passes.
 pub fn binding_workflow_text(content: &str) -> Option<String> {
-    let document: Value = yaml_serde::from_str(content).ok()?;
-    let mapping = document.as_mapping()?;
-    let jobs = mapping.get("jobs")?.as_mapping()?;
-    if jobs.is_empty() {
-        return None;
-    }
-    if !binding_triggers(workflow_triggers(&document)) {
-        return Some(String::new());
-    }
-    let mut evidence = Vec::new();
-    for (_, job) in jobs {
-        collect_job_evidence(job, &mut evidence);
-    }
-    Some(evidence.join("\n"))
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 /// YAML 1.1 resolves a plain `on` key as boolean true, so the trigger entry
 /// is looked up under both spellings.
 fn workflow_triggers(document: &Value) -> Option<&Value> {
     let mapping = document.as_mapping()?;
     mapping.get("on").or_else(|| mapping.get(Value::Bool(true)))
 }

---- rust_rules::workflow_binding::tests::non_literal_expressions_stay_credited stdout ----

thread 'rust_rules::workflow_binding::tests::non_literal_expressions_stay_credited' (2239354) panicked at crates/slophammer-cli/src/rust_rules/workflow_binding.rs:250:52:
binding text

---- rust_rules::workflow_binding::tests::surviving_steps_contribute_runs_and_uses stdout ----

thread 'rust_rules::workflow_binding::tests::surviving_steps_contribute_runs_and_uses' (2239355) panicked at crates/slophammer-cli/src/rust_rules/workflow_binding.rs:234:52:
binding text

---- rust_rules::workflow_binding::tests::neutralized_workflow_contributes_no_evidence stdout ----

thread 'rust_rules::workflow_binding::tests::neutralized_workflow_contributes_no_evidence' (2239353) panicked at crates/slophammer-cli/src/rust_rules/workflow_binding.rs:199:9:
assertion `left == right` failed
  left: None
 right: Some("")

failures:
    rust_rules::workflow_binding::tests::matrix_commands_expand_into_evidence
    rust_rules::workflow_binding::tests::neutralized_steps_and_jobs_are_dropped
    rust_rules::workflow_binding::tests::neutralized_workflow_contributes_no_evidence
    rust_rules::workflow_binding::tests::non_literal_expressions_stay_credited
    rust_rules::workflow_binding::tests::surviving_steps_contribute_runs_and_uses
    rust_rules::workflow_binding::tests::tag_only_push_triggers_do_not_bind

test result: FAILED. 57 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
