*** crates/slophammer-cli/src/rust_rules/workflow_binding.rs:9:5: replace binding_workflow_text -> Option<String> with Some("xyzzy".into())

*** mutation diff:
--- crates/slophammer-cli/src/rust_rules/workflow_binding.rs
+++ replace binding_workflow_text -> Option<String> with Some("xyzzy".into())
@@ -1,30 +1,17 @@
 use yaml_serde::Value;
 
 /// Returns the command evidence a workflow may contribute: run scripts and
 /// action references from steps that can execute and can fail on integration
 /// branches. Returns `None` when the workflow cannot be structurally
 /// filtered (unparseable, or no jobs mapping), in which case the caller
 /// keeps the raw text so filtering only removes false passes.
 pub fn binding_workflow_text(content: &str) -> Option<String> {
-    let document: Value = yaml_serde::from_str(content).ok()?;
-    let mapping = document.as_mapping()?;
-    let jobs = mapping.get("jobs")?.as_mapping()?;
-    if jobs.is_empty() {
-        return None;
-    }
-    if !binding_triggers(workflow_triggers(&document)) {
-        return Some(String::new());
-    }
-    let mut evidence = Vec::new();
-    for (_, job) in jobs {
-        collect_job_evidence(job, &mut evidence);
-    }
-    Some(evidence.join("\n"))
+    Some("xyzzy".into()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// YAML 1.1 resolves a plain `on` key as boolean true, so the trigger entry
 /// is looked up under both spellings.
 fn workflow_triggers(document: &Value) -> Option<&Value> {
     let mapping = document.as_mapping()?;
     mapping.get("on").or_else(|| mapping.get(Value::Bool(true)))
 }

---- rust_rules::workflow_binding::tests::neutralized_workflow_contributes_no_evidence stdout ----

thread 'rust_rules::workflow_binding::tests::neutralized_workflow_contributes_no_evidence' (2241458) panicked at crates/slophammer-cli/src/rust_rules/workflow_binding.rs:199:9:
assertion `left == right` failed
  left: Some("xyzzy")
 right: Some("")

---- rust_rules::evidence::tests::unreferenced_scripts_are_not_evidence stdout ----

thread 'rust_rules::evidence::tests::unreferenced_scripts_are_not_evidence' (2241442) panicked at crates/slophammer-cli/src/rust_rules/evidence.rs:170:9:
assertion failed: text.contains("cargo test")

---- rust_rules::workflow_binding::tests::matrix_commands_expand_into_evidence stdout ----

thread 'rust_rules::workflow_binding::tests::matrix_commands_expand_into_evidence' (2241456) panicked at crates/slophammer-cli/src/rust_rules/workflow_binding.rs:269:9:
assertion failed: text.contains("cargo test --workspace")

failures:
    app::tests::clean_fixture_has_no_findings
    rust_rules::evidence::tests::makefiles_need_a_make_invocation
    rust_rules::evidence::tests::referenced_scripts_are_evidence_one_hop_deep
    rust_rules::evidence::tests::unreferenced_scripts_are_not_evidence
    rust_rules::tests::accepts_stricter_coverage_thresholds
    rust_rules::workflow_binding::tests::matrix_commands_expand_into_evidence
    rust_rules::workflow_binding::tests::neutralized_steps_and_jobs_are_dropped
    rust_rules::workflow_binding::tests::neutralized_workflow_contributes_no_evidence
    rust_rules::workflow_binding::tests::non_literal_expressions_stay_credited
    rust_rules::workflow_binding::tests::surviving_steps_contribute_runs_and_uses
    rust_rules::workflow_binding::tests::tag_only_push_triggers_do_not_bind
    rust_rules::workflow_binding::tests::unparseable_workflows_fall_back_to_raw

test result: FAILED. 51 passed; 12 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
