*** crates/slophammer-cli/src/scan.rs:22:9: replace Snapshot::file -> Option<&RepoFile> with None

*** mutation diff:
--- crates/slophammer-cli/src/scan.rs
+++ replace Snapshot::file -> Option<&RepoFile> with None
@@ -14,17 +14,17 @@
 #[derive(Clone, Debug, Eq, PartialEq)]
 pub struct Snapshot {
     pub root: PathBuf,
     pub files: BTreeMap<String, RepoFile>,
 }
 
 impl Snapshot {
     pub fn file(&self, path: &str) -> Option<&RepoFile> {
-        self.files.get(path)
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn has_case_insensitive(&self, filename: &str) -> bool {
         self.files
             .keys()
             .filter(|path| !path.contains('/'))
             .any(|path| path.eq_ignore_ascii_case(filename))
     }

---- rust_rules::unsafe_policy::tests::allow_documented_requires_allow_entry stdout ----

thread 'rust_rules::unsafe_policy::tests::allow_documented_requires_allow_entry' (2013760) panicked at crates/slophammer-cli/src/rust_rules/unsafe_policy.rs:183:9:
assertion `left == right` failed
  left: 0
 right: 1

---- rust_rules::boundaries::tests::allowed_inherited_workspace_path_dependencies_pass stdout ----

thread 'rust_rules::boundaries::tests::allowed_inherited_workspace_path_dependencies_pass' (2013741) panicked at crates/slophammer-cli/src/rust_rules/boundaries.rs:320:9:
assertion failed: findings.is_empty()

---- rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked stdout ----

thread 'rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked' (2013742) panicked at crates/slophammer-cli/src/rust_rules/boundaries.rs:302:9:
assertion failed: findings[0].message.contains("crates/b")

failures:
    app::tests::check_applies_rule_severity_overrides
    app::tests::clean_fixture_has_no_findings
    app::tests::config_error_fixtures_return_error_code
    rust_rules::boundaries::tests::allowed_inherited_workspace_path_dependencies_pass
    rust_rules::boundaries::tests::inherited_workspace_path_dependencies_are_checked
    rust_rules::dry::tests::detects_same_file_copied_blocks
    rust_rules::tests::plain_rust_toolchain_pin_satisfies_msrv_rule
    rust_rules::unsafe_policy::tests::allow_documented_requires_allow_entry

test result: FAILED. 55 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
