*** crates/slophammer-cli/src/scan.rs:26:9: replace Snapshot::has_case_insensitive -> bool with true

*** mutation diff:
--- crates/slophammer-cli/src/scan.rs
+++ replace Snapshot::has_case_insensitive -> bool with true
@@ -18,20 +18,17 @@
 }
 
 impl Snapshot {
     pub fn file(&self, path: &str) -> Option<&RepoFile> {
         self.files.get(path)
     }
 
     pub fn has_case_insensitive(&self, filename: &str) -> bool {
-        self.files
-            .keys()
-            .filter(|path| !path.contains('/'))
-            .any(|path| path.eq_ignore_ascii_case(filename))
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn has_workflow(&self) -> bool {
         self.files.keys().any(|path| active_workflow_path(path))
     }
 }
 
 fn active_workflow_path(path: &str) -> bool {

---- app::tests::check_applies_rule_severity_overrides stdout ----

thread 'app::tests::check_applies_rule_severity_overrides' (2014223) panicked at crates/slophammer-cli/src/app.rs:455:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    app::tests::check_applies_rule_severity_overrides

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
