*** crates/slophammer-cli/src/scan.rs:28:28: delete ! in Snapshot::has_case_insensitive

*** mutation diff:
--- crates/slophammer-cli/src/scan.rs
+++ delete ! in Snapshot::has_case_insensitive
@@ -20,17 +20,17 @@
 impl Snapshot {
     pub fn file(&self, path: &str) -> Option<&RepoFile> {
         self.files.get(path)
     }
 
     pub fn has_case_insensitive(&self, filename: &str) -> bool {
         self.files
             .keys()
-            .filter(|path| !path.contains('/'))
+            .filter(|path|  /* ~ changed by cargo-mutants ~ */path.contains('/'))
             .any(|path| path.eq_ignore_ascii_case(filename))
     }
 
     pub fn has_workflow(&self) -> bool {
         self.files.keys().any(|path| active_workflow_path(path))
     }
 }

---- app::tests::only_rules_accept_comma_separated_ids stdout ----

thread 'app::tests::only_rules_accept_comma_separated_ids' (2015204) panicked at crates/slophammer-cli/src/app.rs:325:9:
assertion `left == right` failed: 
  left: 1
 right: 0

---- app::tests::clean_fixture_has_no_findings stdout ----

thread 'app::tests::clean_fixture_has_no_findings' (2015200) panicked at crates/slophammer-cli/src/app.rs:351:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    app::tests::clean_fixture_has_no_findings
    app::tests::only_rules_accept_comma_separated_ids

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
