*** crates/slophammer-cli/src/scan.rs:33:9: replace Snapshot::has_workflow -> bool with true

*** mutation diff:
--- crates/slophammer-cli/src/scan.rs
+++ replace Snapshot::has_workflow -> bool with true
@@ -25,17 +25,17 @@
     pub fn has_case_insensitive(&self, filename: &str) -> bool {
         self.files
             .keys()
             .filter(|path| !path.contains('/'))
             .any(|path| path.eq_ignore_ascii_case(filename))
     }
 
     pub fn has_workflow(&self) -> bool {
-        self.files.keys().any(|path| active_workflow_path(path))
+        true /* ~ changed by cargo-mutants ~ */
     }
 }
 
 fn active_workflow_path(path: &str) -> bool {
     let Some(name) = path.strip_prefix(".github/workflows/") else {
         return false;
     };
     !name.contains('/') && (name.ends_with(".yml") || name.ends_with(".yaml"))

---- scan::tests::ignores_nested_archived_workflow_paths stdout ----

thread 'scan::tests::ignores_nested_archived_workflow_paths' (2015749) panicked at crates/slophammer-cli/src/scan.rs:134:9:
assertion failed: !snapshot.has_workflow()

failures:
    scan::tests::ignores_nested_archived_workflow_paths

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
