*** crates/slophammer-cli/src/scan.rs:33:9: replace Snapshot::has_workflow -> bool with false

*** mutation diff:
--- crates/slophammer-cli/src/scan.rs
+++ replace Snapshot::has_workflow -> bool with false
@@ -25,17 +25,17 @@
     pub fn has_case_insensitive(&self, filename: &str) -> bool {
         self.files
             .keys()
             .filter(|path| !path.contains('/'))
             .any(|path| path.eq_ignore_ascii_case(filename))
     }
 
     pub fn has_workflow(&self) -> bool {
-        self.files.keys().any(|path| active_workflow_path(path))
+        false /* ~ changed by cargo-mutants ~ */
     }
 }
 
 fn active_workflow_path(path: &str) -> bool {
     let Some(name) = path.strip_prefix(".github/workflows/") else {
         return false;
     };
     !name.contains('/') && (name.ends_with(".yml") || name.ends_with(".yaml"))

---- scan::tests::detects_workflow_paths stdout ----

thread 'scan::tests::detects_workflow_paths' (2016235) panicked at crates/slophammer-cli/src/scan.rs:119:9:
assertion failed: snapshot.has_workflow()

---- app::tests::clean_fixture_has_no_findings stdout ----

thread 'app::tests::clean_fixture_has_no_findings' (2016175) panicked at crates/slophammer-cli/src/app.rs:351:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    app::tests::clean_fixture_has_no_findings
    scan::tests::detects_workflow_paths

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
