*** crates/slophammer-cli/src/scan.rs:38:5: replace active_workflow_path -> bool with false

*** mutation diff:
--- crates/slophammer-cli/src/scan.rs
+++ replace active_workflow_path -> bool with false
@@ -30,20 +30,17 @@
     }
 
     pub fn has_workflow(&self) -> bool {
         self.files.keys().any(|path| active_workflow_path(path))
     }
 }
 
 fn active_workflow_path(path: &str) -> bool {
-    let Some(name) = path.strip_prefix(".github/workflows/") else {
-        return false;
-    };
-    !name.contains('/') && (name.ends_with(".yml") || name.ends_with(".yaml"))
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 #[derive(Debug, Error)]
 pub enum ScanError {
     #[error("repository root does not exist: {0}")]
     MissingRoot(String),
     #[error("walk failed: {0}")]
     Walk(#[from] ignore::Error),

---- scan::tests::detects_workflow_paths stdout ----

thread 'scan::tests::detects_workflow_paths' (2017208) panicked at crates/slophammer-cli/src/scan.rs:116:9:
assertion failed: snapshot.has_workflow()

---- app::tests::clean_fixture_has_no_findings stdout ----

thread 'app::tests::clean_fixture_has_no_findings' (2017148) panicked at crates/slophammer-cli/src/app.rs:351:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    app::tests::clean_fixture_has_no_findings
    scan::tests::detects_workflow_paths

test result: FAILED. 61 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
