*** crates/slophammer-cli/src/scan.rs:41:25: replace && with || in active_workflow_path

*** mutation diff:
--- crates/slophammer-cli/src/scan.rs
+++ replace && with || in active_workflow_path
@@ -33,17 +33,17 @@
         self.files.keys().any(|path| active_workflow_path(path))
     }
 }
 
 fn active_workflow_path(path: &str) -> bool {
     let Some(name) = path.strip_prefix(".github/workflows/") else {
         return false;
     };
-    !name.contains('/') && (name.ends_with(".yml") || name.ends_with(".yaml"))
+    !name.contains('/') || /* ~ changed by cargo-mutants ~ */ (name.ends_with(".yml") || name.ends_with(".yaml"))
 }
 
 #[derive(Debug, Error)]
 pub enum ScanError {
     #[error("repository root does not exist: {0}")]
     MissingRoot(String),
     #[error("walk failed: {0}")]
     Walk(#[from] ignore::Error),

---- scan::tests::ignores_nested_archived_workflow_paths stdout ----

thread 'scan::tests::ignores_nested_archived_workflow_paths' (2017697) panicked at crates/slophammer-cli/src/scan.rs:134:9:
assertion failed: !snapshot.has_workflow()

failures:
    scan::tests::ignores_nested_archived_workflow_paths

test result: FAILED. 62 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
