*** crates/slophammer-cli/src/scan.rs:56:8: delete ! in scan_repo

*** mutation diff:
--- crates/slophammer-cli/src/scan.rs
+++ delete ! in scan_repo
@@ -48,17 +48,17 @@
     #[error("walk failed: {0}")]
     Walk(#[from] ignore::Error),
     #[error("path is not valid UTF-8: {0}")]
     NonUtf8Path(String),
 }
 
 pub fn scan_repo(root: impl AsRef<Path>) -> Result<Snapshot, ScanError> {
     let root = root.as_ref();
-    if !root.exists() {
+    if  /* ~ changed by cargo-mutants ~ */root.exists() {
         return Err(ScanError::MissingRoot(root.display().to_string()));
     }
     let root = root.to_path_buf();
     let mut files = BTreeMap::new();
     let walker = WalkBuilder::new(&root)
         .hidden(false)
         .git_ignore(true)
         .parents(true)

---- app::tests::check_applies_rule_severity_overrides stdout ----

thread 'app::tests::check_applies_rule_severity_overrides' (2019113) panicked at crates/slophammer-cli/src/app.rs:455:9:
assertion `left == right` failed
  left: 2
 right: 1

---- app::tests::config_error_fixtures_return_error_code stdout ----

thread 'app::tests::config_error_fixtures_return_error_code' (2019115) panicked at crates/slophammer-cli/src/app.rs:476:13:
rust-invalid-config

---- app::tests::clean_fixture_has_no_findings stdout ----

thread 'app::tests::clean_fixture_has_no_findings' (2019114) panicked at crates/slophammer-cli/src/app.rs:351:9:
assertion `left == right` failed
  left: 2
 right: 0

failures:
    app::tests::check_applies_rule_severity_overrides
    app::tests::clean_fixture_has_no_findings
    app::tests::config_error_fixtures_return_error_code
    app::tests::direct_commands_use_report_contract
    app::tests::only_rules_accept_comma_separated_ids
    app::tests::rust_failure_fixtures_report_findings

test result: FAILED. 57 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
