*** crates/slophammer-cli/src/scan.rs:65:31: delete ! in scan_repo

*** mutation diff:
--- crates/slophammer-cli/src/scan.rs
+++ delete ! in scan_repo
@@ -57,17 +57,17 @@
         return Err(ScanError::MissingRoot(root.display().to_string()));
     }
     let root = root.to_path_buf();
     let mut files = BTreeMap::new();
     let walker = WalkBuilder::new(&root)
         .hidden(false)
         .git_ignore(true)
         .parents(true)
-        .filter_entry(|entry| !ignored_entry(entry.path()))
+        .filter_entry(|entry|  /* ~ changed by cargo-mutants ~ */ignored_entry(entry.path()))
         .build();
     for entry in walker {
         let entry = entry?;
         let file_type = entry.file_type();
         if !file_type.is_some_and(|item| item.is_file()) {
             continue;
         }
         let Some(path) = relative_path(&root, entry.path())? else {

---- app::tests::config_error_fixtures_return_error_code stdout ----

thread 'app::tests::config_error_fixtures_return_error_code' (2019598) panicked at crates/slophammer-cli/src/app.rs:475:13:
assertion `left == right` failed: rust-invalid-config
  left: 1
 right: 2

---- app::tests::check_applies_rule_severity_overrides stdout ----

thread 'app::tests::check_applies_rule_severity_overrides' (2019596) panicked at crates/slophammer-cli/src/app.rs:461:9:
assertion failed: result.stdout.contains("\"severity\": \"warn\"")

---- app::tests::only_rules_accept_comma_separated_ids stdout ----

thread 'app::tests::only_rules_accept_comma_separated_ids' (2019601) panicked at crates/slophammer-cli/src/app.rs:325:9:
assertion `left == right` failed: 
  left: 1
 right: 0

failures:
    app::tests::check_applies_rule_severity_overrides
    app::tests::clean_fixture_has_no_findings
    app::tests::config_error_fixtures_return_error_code
    app::tests::direct_commands_use_report_contract
    app::tests::only_rules_accept_comma_separated_ids

test result: FAILED. 58 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
