*** crates/slophammer-cli/src/scan.rs:93:5: replace ignored_entry -> bool with true

*** mutation diff:
--- crates/slophammer-cli/src/scan.rs
+++ replace ignored_entry -> bool with true
@@ -85,24 +85,17 @@
         return Ok(None);
     };
     let utf8 = Utf8PathBuf::from_path_buf(relative.to_path_buf())
         .map_err(|path| ScanError::NonUtf8Path(path.display().to_string()))?;
     Ok(Some(utf8.as_str().replace('\\', "/")))
 }
 
 fn ignored_entry(path: &Path) -> bool {
-    path.file_name()
-        .and_then(|name| name.to_str())
-        .is_some_and(|name| {
-            matches!(
-                name,
-                ".git" | "node_modules" | "target" | "dist" | "coverage"
-            )
-        })
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]
     fn detects_workflow_paths() {

---- app::tests::check_applies_rule_severity_overrides stdout ----

thread 'app::tests::check_applies_rule_severity_overrides' (2022031) panicked at crates/slophammer-cli/src/app.rs:461:9:
assertion failed: result.stdout.contains("\"severity\": \"warn\"")

---- app::tests::only_rules_accept_comma_separated_ids stdout ----

thread 'app::tests::only_rules_accept_comma_separated_ids' (2022036) panicked at crates/slophammer-cli/src/app.rs:325:9:
assertion `left == right` failed: 
  left: 1
 right: 0

---- app::tests::config_error_fixtures_return_error_code stdout ----

thread 'app::tests::config_error_fixtures_return_error_code' (2022033) panicked at crates/slophammer-cli/src/app.rs:475:13:
assertion `left == right` failed: rust-invalid-config
  left: 1
 right: 2

failures:
    app::tests::check_applies_rule_severity_overrides
    app::tests::clean_fixture_has_no_findings
    app::tests::config_error_fixtures_return_error_code
    app::tests::direct_commands_use_report_contract
    app::tests::only_rules_accept_comma_separated_ids

test result: FAILED. 58 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
